[Killed] BlockStatement
src/cli.ts:45:45
   add: { type: 'string' },
 } as const;
 
-function errorMessage(err: unknown): string {
-  return err instanceof Error ? err.message : String(err);
-}
+function errorMessage(err: unknown): string {}
 
 function parseList(value: string | undefined): string[] | null {
killedBy: runCli init rejects an invalid shape with exit 2
statusReason: expected 'checkride: undefined\n' to contain 'invalid --shape'

[Killed] BlockStatement
src/cli.ts:49:64
   return err instanceof Error ? err.message : String(err);
 }
 
-function parseList(value: string | undefined): string[] | null {
-  if (!value) return null;
-  return value.split(',').map((s) => s.trim()).filter(Boolean);
-}
+function parseList(value: string | undefined): string[] | null {}
 
 /** The command is the first non-flag token; the rest are its arguments. */
killedBy: parseCliArgs defaults to the run command with empty flags
statusReason: expected { bail: false, json: false, …(5) } to match object { bail: false, json: false, …(2) }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/cli.ts:50:7
 }
 
 function parseList(value: string | undefined): string[] | null {
-  if (!value) return null;
+  if (false) return null;
   return value.split(',').map((s) => s.trim()).filter(Boolean);
 }
killedBy: parseCliArgs defaults to the run command with empty flags
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BooleanLiteral
src/cli.ts:50:7
 }
 
 function parseList(value: string | undefined): string[] | null {
-  if (!value) return null;
+  if (value) return null;
   return value.split(',').map((s) => s.trim()).filter(Boolean);
 }
killedBy: parseCliArgs defaults to the run command with empty flags
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] MethodExpression
src/cli.ts:51:10
 
 function parseList(value: string | undefined): string[] | null {
   if (!value) return null;
-  return value.split(',').map((s) => s.trim()).filter(Boolean);
+  return value.split(',').map(s => s.trim());
 }
 
killedBy: parseCliArgs trims whitespace and drops empties in list flags
statusReason: expected [ 'docs', '', 'spell' ] to deeply equal [ 'docs', 'spell' ]

[Killed] MethodExpression
src/cli.ts:51:38
 
 function parseList(value: string | undefined): string[] | null {
   if (!value) return null;
-  return value.split(',').map((s) => s.trim()).filter(Boolean);
+  return value.split(',').map((s) => s).filter(Boolean);
 }
 
killedBy: parseCliArgs trims whitespace and drops empties in list flags
statusReason: expected [ ' docs ', ' ', ' spell ' ] to deeply equal [ 'docs', 'spell' ]

[Killed] BlockStatement
src/cli.ts:55:77
 }
 
 /** The command is the first non-flag token; the rest are its arguments. */
-function detectCommand(argv: string[]): { command: string; rest: string[] } {
-  const first = argv[0];
-  if (first !== undefined && !first.startsWith('-')) {
-    return { command: first, rest: argv.slice(1) };
-  }
-  return { command: 'run', rest: argv };
-}
+function detectCommand(argv: string[]): { command: string; rest: string[] } {}
 
 /** Parse argv into a command name and the run flags. */
killedBy: parseCliArgs defaults to the run command with empty flags
statusReason: Cannot destructure property 'command' of 'detectCommand(...)' as it is undefined.

[Killed] BooleanLiteral
src/cli.ts:57:30
 /** The command is the first non-flag token; the rest are its arguments. */
 function detectCommand(argv: string[]): { command: string; rest: string[] } {
   const first = argv[0];
-  if (first !== undefined && !first.startsWith('-')) {
+  if (first !== undefined && first.startsWith('-')) {
     return { command: first, rest: argv.slice(1) };
   }
killedBy: parseCliArgs parses lists and boolean flags
statusReason: expected null to deeply equal [ 'types', 'lint' ]

[Killed] MethodExpression
src/cli.ts:57:31
 /** The command is the first non-flag token; the rest are its arguments. */
 function detectCommand(argv: string[]): { command: string; rest: string[] } {
   const first = argv[0];
-  if (first !== undefined && !first.startsWith('-')) {
+  if (first !== undefined && !first.endsWith('-')) {
     return { command: first, rest: argv.slice(1) };
   }
killedBy: parseCliArgs parses lists and boolean flags
statusReason: expected null to deeply equal [ 'types', 'lint' ]

[Survived] MethodExpression
src/cli.ts:58:36
 function detectCommand(argv: string[]): { command: string; rest: string[] } {
   const first = argv[0];
   if (first !== undefined && !first.startsWith('-')) {
-    return { command: first, rest: argv.slice(1) };
+    return { command: first, rest: argv };
   }
   return { command: 'run', rest: argv };

[Killed] BlockStatement
src/cli.ts:64:84
 }
 
 /** Parse argv into a command name and the run flags. */
-export function parseCliArgs(argv: string[]): { command: string; flags: RunFlags } {
-  const { command, rest } = detectCommand(argv);
-  const { values } = parseArgs({ args: rest, allowPositionals: true, options: RUN_OPTIONS });
-  const flags: RunFlags = {
-    bail: values.bail,
-    json: values.json,
-    all: values.all,
-    changed: values.changed,
-    only: parseList(values.only),
-    skip: parseList(values.skip),
-    include: parseList(values.include),
-  };
-  return { command, flags };
-}
+export function parseCliArgs(argv: string[]): { command: string; flags: RunFlags } {}
 
 function asShape(value: string | undefined): Shape | undefined {
killedBy: parseCliArgs defaults to the run command with empty flags
statusReason: Cannot destructure property 'command' of 'parseCliArgs(...)' as it is undefined.

[Survived] BooleanLiteral
src/cli.ts:66:64
 /** Parse argv into a command name and the run flags. */
 export function parseCliArgs(argv: string[]): { command: string; flags: RunFlags } {
   const { command, rest } = detectCommand(argv);
-  const { values } = parseArgs({ args: rest, allowPositionals: true, options: RUN_OPTIONS });
+  const { values } = parseArgs({ args: rest, allowPositionals: false, options: RUN_OPTIONS });
   const flags: RunFlags = {
     bail: values.bail,

[Killed] BlockStatement
src/cli.ts:79:64
   return { command, flags };
 }
 
-function asShape(value: string | undefined): Shape | undefined {
-  if (value === undefined) return undefined;
-  if (value === 'flat' || value === 'monorepo' || value === 'hybrid') return value;
-  throw new Error(`invalid --shape '${value}' (expected flat | monorepo | hybrid)`);
-}
+function asShape(value: string | undefined): Shape | undefined {}
 
 /** Parse `init` arguments into init options. */
killedBy: parseInitArgs parses every init flag
statusReason: expected { name: 'demo', scope: '@s', …(4) } to match object { shape: 'monorepo', …(6) }

[Killed] ConditionalExpression
src/cli.ts:80:7
 }
 
 function asShape(value: string | undefined): Shape | undefined {
-  if (value === undefined) return undefined;
+  if (false) return undefined;
   if (value === 'flat' || value === 'monorepo' || value === 'hybrid') return value;
   throw new Error(`invalid --shape '${value}' (expected flat | monorepo | hybrid)`);
killedBy: parseInitArgs omits unset flags (so defaults apply)
statusReason: invalid --shape 'undefined' (expected flat | monorepo | hybrid)

[Killed] ConditionalExpression
src/cli.ts:80:7
 }
 
 function asShape(value: string | undefined): Shape | undefined {
-  if (value === undefined) return undefined;
+  if (true) return undefined;
   if (value === 'flat' || value === 'monorepo' || value === 'hybrid') return value;
   throw new Error(`invalid --shape '${value}' (expected flat | monorepo | hybrid)`);
killedBy: parseInitArgs parses every init flag
statusReason: expected { name: 'demo', scope: '@s', …(4) } to match object { shape: 'monorepo', …(6) }

[Killed] ConditionalExpression
src/cli.ts:81:7
 
 function asShape(value: string | undefined): Shape | undefined {
   if (value === undefined) return undefined;
-  if (value === 'flat' || value === 'monorepo' || value === 'hybrid') return value;
+  if (false) return value;
   throw new Error(`invalid --shape '${value}' (expected flat | monorepo | hybrid)`);
 }
killedBy: parseInitArgs parses every init flag
statusReason: invalid --shape 'monorepo' (expected flat | monorepo | hybrid)

[Killed] ConditionalExpression
src/cli.ts:81:7
 
 function asShape(value: string | undefined): Shape | undefined {
   if (value === undefined) return undefined;
-  if (value === 'flat' || value === 'monorepo' || value === 'hybrid') return value;
+  if (false || value === 'hybrid') return value;
   throw new Error(`invalid --shape '${value}' (expected flat | monorepo | hybrid)`);
 }
killedBy: parseInitArgs parses every init flag
statusReason: invalid --shape 'monorepo' (expected flat | monorepo | hybrid)

[Killed] BlockStatement
src/cli.ts:86:69
 }
 
 /** Parse `init` arguments into init options. */
-export function parseInitArgs(argv: string[]): Partial<InitOptions> {
-  const { rest } = detectCommand(argv);
-  const { values } = parseArgs({ args: rest, allowPositionals: true, options: INIT_OPTIONS });
-  const opts: Partial<InitOptions> = {};
-  const shape = asShape(values.shape);
-  if (shape) opts.shape = shape;
-  if (values.name) opts.name = values.name;
-  if (values.scope) opts.scope = values.scope;
-  if (values.license) opts.license = values.license;
-  if (values.author) opts.author = values.author;
-  if (values['dry-run']) opts.dryRun = true;
-  const add = parseList(values.add);
-  if (add) opts.add = add;
-  return opts;
-}
+export function parseInitArgs(argv: string[]): Partial<InitOptions> {}
 
 async function dispatchRun(argv: string[], deps: CliDeps): Promise<number> {
killedBy: parseInitArgs parses every init flag
statusReason: expected undefined to match object { shape: 'monorepo', …(6) }

[Survived] BooleanLiteral
src/cli.ts:88:64
 /** Parse `init` arguments into init options. */
 export function parseInitArgs(argv: string[]): Partial<InitOptions> {
   const { rest } = detectCommand(argv);
-  const { values } = parseArgs({ args: rest, allowPositionals: true, options: INIT_OPTIONS });
+  const { values } = parseArgs({ args: rest, allowPositionals: false, options: INIT_OPTIONS });
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);

[Killed] ObjectLiteral
src/cli.ts:88:32
 /** Parse `init` arguments into init options. */
 export function parseInitArgs(argv: string[]): Partial<InitOptions> {
   const { rest } = detectCommand(argv);
-  const { values } = parseArgs({ args: rest, allowPositionals: true, options: INIT_OPTIONS });
+  const { values } = parseArgs({});
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);
killedBy: parseInitArgs parses every init flag
statusReason: expected {} to match object { shape: 'monorepo', …(6) }

[Killed] ConditionalExpression
src/cli.ts:91:7
   const { values } = parseArgs({ args: rest, allowPositionals: true, options: INIT_OPTIONS });
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);
-  if (shape) opts.shape = shape;
+  if (false) opts.shape = shape;
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
killedBy: parseInitArgs parses every init flag
statusReason: expected { name: 'demo', scope: '@s', …(4) } to match object { shape: 'monorepo', …(6) }

[Survived] ConditionalExpression
src/cli.ts:91:7
   const { values } = parseArgs({ args: rest, allowPositionals: true, options: INIT_OPTIONS });
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);
-  if (shape) opts.shape = shape;
+  if (true) opts.shape = shape;
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;

[Killed] ConditionalExpression
src/cli.ts:92:7
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);
   if (shape) opts.shape = shape;
-  if (values.name) opts.name = values.name;
+  if (false) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
killedBy: parseInitArgs parses every init flag
statusReason: expected { Object (shape, scope, ...) } to match object { shape: 'monorepo', …(6) }

[Survived] ConditionalExpression
src/cli.ts:92:7
   const opts: Partial<InitOptions> = {};
   const shape = asShape(values.shape);
   if (shape) opts.shape = shape;
-  if (values.name) opts.name = values.name;
+  if (true) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;

[Killed] ConditionalExpression
src/cli.ts:93:7
   const shape = asShape(values.shape);
   if (shape) opts.shape = shape;
   if (values.name) opts.name = values.name;
-  if (values.scope) opts.scope = values.scope;
+  if (false) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
   if (values.author) opts.author = values.author;
killedBy: parseInitArgs parses every init flag
statusReason: expected { shape: 'monorepo', …(5) } to match object { shape: 'monorepo', …(6) }

[Survived] ConditionalExpression
src/cli.ts:93:7
   const shape = asShape(values.shape);
   if (shape) opts.shape = shape;
   if (values.name) opts.name = values.name;
-  if (values.scope) opts.scope = values.scope;
+  if (true) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
   if (values.author) opts.author = values.author;

[Killed] ConditionalExpression
src/cli.ts:94:7
   if (shape) opts.shape = shape;
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
-  if (values.license) opts.license = values.license;
+  if (false) opts.license = values.license;
   if (values.author) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;
killedBy: parseInitArgs parses every init flag
statusReason: expected { shape: 'monorepo', …(5) } to match object { shape: 'monorepo', …(6) }

[Survived] ConditionalExpression
src/cli.ts:94:7
   if (shape) opts.shape = shape;
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
-  if (values.license) opts.license = values.license;
+  if (true) opts.license = values.license;
   if (values.author) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;

[Killed] ConditionalExpression
src/cli.ts:95:7
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
-  if (values.author) opts.author = values.author;
+  if (false) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;
   const add = parseList(values.add);
killedBy: parseInitArgs parses every init flag
statusReason: expected { shape: 'monorepo', …(5) } to match object { shape: 'monorepo', …(6) }

[Survived] ConditionalExpression
src/cli.ts:95:7
   if (values.name) opts.name = values.name;
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
-  if (values.author) opts.author = values.author;
+  if (true) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;
   const add = parseList(values.add);

[Killed] BooleanLiteral
src/cli.ts:96:40
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
   if (values.author) opts.author = values.author;
-  if (values['dry-run']) opts.dryRun = true;
+  if (values['dry-run']) opts.dryRun = false;
   const add = parseList(values.add);
   if (add) opts.add = add;
killedBy: parseInitArgs parses every init flag
statusReason: expected { shape: 'monorepo', …(6) } to match object { shape: 'monorepo', …(6) }

[Killed] ConditionalExpression
src/cli.ts:96:7
   if (values.scope) opts.scope = values.scope;
   if (values.license) opts.license = values.license;
   if (values.author) opts.author = values.author;
-  if (values['dry-run']) opts.dryRun = true;
+  if (true) opts.dryRun = true;
   const add = parseList(values.add);
   if (add) opts.add = add;
killedBy: parseInitArgs omits unset flags (so defaults apply)
statusReason: expected true to be undefined

[Killed] ConditionalExpression
src/cli.ts:98:7
   if (values.author) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;
   const add = parseList(values.add);
-  if (add) opts.add = add;
+  if (false) opts.add = add;
   return opts;
 }
killedBy: parseInitArgs parses every init flag
statusReason: expected { shape: 'monorepo', …(5) } to match object { shape: 'monorepo', …(6) }

[Killed] ConditionalExpression
src/cli.ts:98:7
   if (values.author) opts.author = values.author;
   if (values['dry-run']) opts.dryRun = true;
   const add = parseList(values.add);
-  if (add) opts.add = add;
+  if (true) opts.add = add;
   return opts;
 }
killedBy: parseInitArgs omits unset flags (so defaults apply)
statusReason: expected null to be undefined

[Killed] BlockStatement
src/cli.ts:102:76
   return opts;
 }
 
-async function dispatchRun(argv: string[], deps: CliDeps): Promise<number> {
-  const { flags } = parseCliArgs(argv);
-  const result = await runChecks({ ...flags, cwd: deps.cwd, stdout: deps.stdout, stderr: deps.stderr });
-  return result.exitCode;
-}
+async function dispatchRun(argv: string[], deps: CliDeps): Promise<number> {}
 
 async function dispatchInit(argv: string[], deps: CliDeps): Promise<number> {
killedBy: runCli dispatch returns 2 on a parse error
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/cli.ts:108:77
   return result.exitCode;
 }
 
-async function dispatchInit(argv: string[], deps: CliDeps): Promise<number> {
-  const result = await runInit({ ...parseInitArgs(argv), cwd: deps.cwd, stdout: deps.stdout });
-  return result.exitCode;
-}
+async function dispatchInit(argv: string[], deps: CliDeps): Promise<number> {}
 
 async function dispatchDoctor(argv: string[], deps: CliDeps): Promise<number> {
killedBy: runCli init generates a new flat project
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/cli.ts:113:79
   return result.exitCode;
 }
 
-async function dispatchDoctor(argv: string[], deps: CliDeps): Promise<number> {
-  const { flags } = parseCliArgs(argv);
-  const result = await runDoctor({ json: flags.json ?? false, cwd: deps.cwd, stdout: deps.stdout });
-  return result.exitCode;
-}
+async function dispatchDoctor(argv: string[], deps: CliDeps): Promise<number> {}
 
 async function dispatchFix(argv: string[], deps: CliDeps): Promise<number> {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected undefined to be +0 // Object.is equality

[Survived] LogicalOperator
src/cli.ts:115:42
 
 async function dispatchDoctor(argv: string[], deps: CliDeps): Promise<number> {
   const { flags } = parseCliArgs(argv);
-  const result = await runDoctor({ json: flags.json ?? false, cwd: deps.cwd, stdout: deps.stdout });
+  const result = await runDoctor({ json: flags.json && false, cwd: deps.cwd, stdout: deps.stdout });
   return result.exitCode;
 }

[NoCoverage] BooleanLiteral
src/cli.ts:115:56
 
 async function dispatchDoctor(argv: string[], deps: CliDeps): Promise<number> {
   const { flags } = parseCliArgs(argv);
-  const result = await runDoctor({ json: flags.json ?? false, cwd: deps.cwd, stdout: deps.stdout });
+  const result = await runDoctor({ json: flags.json ?? true, cwd: deps.cwd, stdout: deps.stdout });
   return result.exitCode;
 }

[NoCoverage] BlockStatement
src/cli.ts:119:76
   return result.exitCode;
 }
 
-async function dispatchFix(argv: string[], deps: CliDeps): Promise<number> {
-  const { flags } = parseCliArgs(argv);
-  const result = await runFix({ ...flags, cwd: deps.cwd, stderr: deps.stderr });
-  return result.exitCode;
-}
+async function dispatchFix(argv: string[], deps: CliDeps): Promise<number> {}
 
 /** Dispatch a CLI invocation; returns the process exit code. */

[Killed] BlockStatement
src/cli.ts:126:78
 }
 
 /** Dispatch a CLI invocation; returns the process exit code. */
-export async function runCli(argv: string[], deps: CliDeps): Promise<number> {
-  const { command } = detectCommand(argv);
-  const dispatch: Record<string, (a: string[], d: CliDeps) => Promise<number>> = {
-    run: dispatchRun,
-    init: dispatchInit,
-    doctor: dispatchDoctor,
-    fix: dispatchFix,
-  };
-  const handler = dispatch[command];
-  if (!handler) {
-    deps.stderr.write(`checkride: unknown command '${command}'.\n`);
-    return 2;
-  }
-  try {
-    return await handler(argv, deps);
-  } catch (err) {
-    deps.stderr.write(`checkride: ${errorMessage(err)}\n`);
-    return 2;
-  }
-}
+export async function runCli(argv: string[], deps: CliDeps): Promise<number> {}
 
 const invokedDirectly =
killedBy: runCli dispatch rejects an unknown command
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ObjectLiteral
src/cli.ts:128:82
 /** Dispatch a CLI invocation; returns the process exit code. */
 export async function runCli(argv: string[], deps: CliDeps): Promise<number> {
   const { command } = detectCommand(argv);
-  const dispatch: Record<string, (a: string[], d: CliDeps) => Promise<number>> = {
-    run: dispatchRun,
-    init: dispatchInit,
-    doctor: dispatchDoctor,
-    fix: dispatchFix,
-  };
+  const dispatch: Record<string, (a: string[], d: CliDeps) => Promise<number>> = {};
   const handler = dispatch[command];
   if (!handler) {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:135:7
     fix: dispatchFix,
   };
   const handler = dispatch[command];
-  if (!handler) {
+  if (true) {
     deps.stderr.write(`checkride: unknown command '${command}'.\n`);
     return 2;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cli.ts:135:7
     fix: dispatchFix,
   };
   const handler = dispatch[command];
-  if (!handler) {
+  if (false) {
     deps.stderr.write(`checkride: unknown command '${command}'.\n`);
     return 2;
killedBy: runCli dispatch rejects an unknown command
statusReason: expected 'checkride: handler is not a function\n' to contain 'unknown command \'bogus\''

[Killed] BlockStatement
src/cli.ts:139:7
     deps.stderr.write(`checkride: unknown command '${command}'.\n`);
     return 2;
   }
-  try {
-    return await handler(argv, deps);
-  } catch (err) {
+  try {} catch (err) {
     deps.stderr.write(`checkride: ${errorMessage(err)}\n`);
     return 2;
killedBy: runCli dispatch returns 2 on a parse error
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/cli.ts:141:17
   }
   try {
     return await handler(argv, deps);
-  } catch (err) {
-    deps.stderr.write(`checkride: ${errorMessage(err)}\n`);
-    return 2;
-  }
+  } catch (err) {}
 }
 
killedBy: runCli dispatch returns 2 on a parse error
statusReason: expected undefined to be 2 // Object.is equality

[Survived] EqualityOperator
src/cli.ts:148:3
 }
 
 const invokedDirectly =
-  process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
+  process.argv[1] === undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
 
 if (invokedDirectly) {

[Timeout] EqualityOperator
src/cli.ts:148:36
 }
 
 const invokedDirectly =
-  process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
+  process.argv[1] !== undefined && import.meta.url !== pathToFileURL(process.argv[1]).href;
 
 if (invokedDirectly) {

[Survived] ConditionalExpression
src/cli.ts:150:5
 const invokedDirectly =
   process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
 
-if (invokedDirectly) {
+if (false) {
   const code = await runCli(process.argv.slice(2), {
     cwd: process.cwd(),

[Timeout] ConditionalExpression
src/cli.ts:150:5
 const invokedDirectly =
   process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
 
-if (invokedDirectly) {
+if (true) {
   const code = await runCli(process.argv.slice(2), {
     cwd: process.cwd(),

[NoCoverage] MethodExpression
src/cli.ts:151:29
   process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
 
 if (invokedDirectly) {
-  const code = await runCli(process.argv.slice(2), {
+  const code = await runCli(process.argv, {
     cwd: process.cwd(),
     stdout: process.stdout,

[NoCoverage] ObjectLiteral
src/cli.ts:151:52
   process.argv[1] !== undefined && import.meta.url === pathToFileURL(process.argv[1]).href;
 
 if (invokedDirectly) {
-  const code = await runCli(process.argv.slice(2), {
-    cwd: process.cwd(),
-    stdout: process.stdout,
-    stderr: process.stderr,
-  });
+  const code = await runCli(process.argv.slice(2), {});
   process.exit(code);
 }
