[Killed] BlockStatement
src/config.ts:60:65
 const CONFIG_FILE = 'checkride.config.json';
 
 /** Read and parse `checkride.config.json` from `cwd`, or `null` when absent. */
-export function loadConfig(cwd: string): CheckrideConfig | null {
-  const path = join(cwd, CONFIG_FILE);
-  if (!existsSync(path)) return null;
-  const text = readFileSync(path, 'utf8');
-  const config: CheckrideConfig = JSON.parse(text);
-  return config;
-}
+export function loadConfig(cwd: string): CheckrideConfig | null {}
 
 function byName(name: string, adapters: readonly Adapter[]): Adapter | null {
killedBy: loadConfig returns null when no config file exists
statusReason: expected undefined to be null

[Killed] BooleanLiteral
src/config.ts:62:7
 /** Read and parse `checkride.config.json` from `cwd`, or `null` when absent. */
 export function loadConfig(cwd: string): CheckrideConfig | null {
   const path = join(cwd, CONFIG_FILE);
-  if (!existsSync(path)) return null;
+  if (existsSync(path)) return null;
   const text = readFileSync(path, 'utf8');
   const config: CheckrideConfig = JSON.parse(text);
killedBy: runCli run (built-in links path) exits 0 when the only check passes
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/config.ts:62:7
 /** Read and parse `checkride.config.json` from `cwd`, or `null` when absent. */
 export function loadConfig(cwd: string): CheckrideConfig | null {
   const path = join(cwd, CONFIG_FILE);
-  if (!existsSync(path)) return null;
+  if (false) return null;
   const text = readFileSync(path, 'utf8');
   const config: CheckrideConfig = JSON.parse(text);
killedBy: runCli run (built-in links path) exits 0 when the only check passes
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/config.ts:68:77
   return config;
 }
 
-function byName(name: string, adapters: readonly Adapter[]): Adapter | null {
-  return adapters.find((a) => a.name === name) ?? null;
-}
+function byName(name: string, adapters: readonly Adapter[]): Adapter | null {}
 
 /** First adapter for `slot` whose detect files are present (empty detect = always). */
killedBy: config resolution a string selects an adapter, beating detection
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] ArrowFunction
src/config.ts:69:24
 }
 
 function byName(name: string, adapters: readonly Adapter[]): Adapter | null {
-  return adapters.find((a) => a.name === name) ?? null;
+  return adapters.find(() => undefined) ?? null;
 }
 
killedBy: config resolution a string selects an adapter, beating detection
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] LogicalOperator
src/config.ts:69:10
 }
 
 function byName(name: string, adapters: readonly Adapter[]): Adapter | null {
-  return adapters.find((a) => a.name === name) ?? null;
+  return adapters.find(a => a.name === name) && null;
 }
 
killedBy: config resolution a string selects an adapter, beating detection
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] BlockStatement
src/config.ts:77:19
   slot: string,
   adapters: readonly Adapter[],
   fileExists: (file: string) => boolean,
-): Adapter | null {
-  for (const a of adapters) {
-    if (a.slot !== slot) continue;
-    if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
-  }
-  return null;
-}
+): Adapter | null {}
 
 function applyOverrides(base: Adapter, o: UseConfig): Adapter {
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/config.ts:78:29
   adapters: readonly Adapter[],
   fileExists: (file: string) => boolean,
 ): Adapter | null {
-  for (const a of adapters) {
-    if (a.slot !== slot) continue;
-    if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
-  }
+  for (const a of adapters) {}
   return null;
 }
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:79:9
   fileExists: (file: string) => boolean,
 ): Adapter | null {
   for (const a of adapters) {
-    if (a.slot !== slot) continue;
+    if (false) continue;
     if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
   }
killedBy: detection (no config) skips a slot with no detectable tool
statusReason: expected { name: 'links', slot: 'links', …(7) } to be null

[Killed] EqualityOperator
src/config.ts:79:9
   fileExists: (file: string) => boolean,
 ): Adapter | null {
   for (const a of adapters) {
-    if (a.slot !== slot) continue;
+    if (a.slot === slot) continue;
     if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
   }
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: expected 'links' to be 'oxlint' // Object.is equality

[Killed] EqualityOperator
src/config.ts:80:9
 ): Adapter | null {
   for (const a of adapters) {
     if (a.slot !== slot) continue;
-    if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
+    if (a.detect.length !== 0 || a.detect.some((f) => fileExists(f))) return a;
   }
   return null;
killedBy: detection (no config) skips a slot with no detectable tool
statusReason: expected { name: 'oxlint', slot: 'lint', …(7) } to be null

[Killed] LogicalOperator
src/config.ts:80:9
 ): Adapter | null {
   for (const a of adapters) {
     if (a.slot !== slot) continue;
-    if (a.detect.length === 0 || a.detect.some((f) => fileExists(f))) return a;
+    if (a.detect.length === 0 && a.detect.some(f => fileExists(f))) return a;
   }
   return null;
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] BlockStatement
src/config.ts:85:63
   return null;
 }
 
-function applyOverrides(base: Adapter, o: UseConfig): Adapter {
-  return {
-    ...base,
-    ...(o.command !== undefined ? { command: o.command } : {}),
-    ...(o.args !== undefined ? { args: o.args } : {}),
-    ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
-    ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
-    ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
-    ...(o.description !== undefined ? { description: o.description } : {}),
-  };
-}
+function applyOverrides(base: Adapter, o: UseConfig): Adapter {}
 
 function customAdapter(slot: string, c: CustomCheck): Adapter {
killedBy: config resolution { use } applies overrides on top of the adapter
statusReason: expected undefined to be 'vitest' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:88:9
 function applyOverrides(base: Adapter, o: UseConfig): Adapter {
   return {
     ...base,
-    ...(o.command !== undefined ? { command: o.command } : {}),
+    ...(true ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected undefined to be 'pnpm' // Object.is equality

[Killed] EqualityOperator
src/config.ts:88:9
 function applyOverrides(base: Adapter, o: UseConfig): Adapter {
   return {
     ...base,
-    ...(o.command !== undefined ? { command: o.command } : {}),
+    ...(o.command === undefined ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:89:9
   return {
     ...base,
     ...(o.command !== undefined ? { command: o.command } : {}),
-    ...(o.args !== undefined ? { args: o.args } : {}),
+    ...(false ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] EqualityOperator
src/config.ts:89:9
   return {
     ...base,
     ...(o.command !== undefined ? { command: o.command } : {}),
-    ...(o.args !== undefined ? { args: o.args } : {}),
+    ...(o.args === undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] EqualityOperator
src/config.ts:90:9
     ...base,
     ...(o.command !== undefined ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
-    ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
+    ...(o.outputFile === undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:90:9
     ...base,
     ...(o.command !== undefined ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
-    ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
+    ...(false ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:91:9
     ...(o.command !== undefined ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
-    ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
+    ...(false ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
     ...(o.description !== undefined ? { description: o.description } : {}),
killedBy: config resolution { use } applies overrides on top of the adapter
statusReason: expected [ '--changed', 'origin/main' ] to deeply equal [ '--changed', 'main' ]

[Killed] EqualityOperator
src/config.ts:91:9
     ...(o.command !== undefined ? { command: o.command } : {}),
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
-    ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
+    ...(o.changedArgs === undefined ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
     ...(o.description !== undefined ? { description: o.description } : {}),
killedBy: config resolution { use } applies overrides on top of the adapter
statusReason: expected [ '--changed', 'origin/main' ] to deeply equal [ '--changed', 'main' ]

[Killed] EqualityOperator
src/config.ts:92:9
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
-    ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
+    ...(o.fixArgs === undefined ? { fixArgs: o.fixArgs } : {}),
     ...(o.description !== undefined ? { description: o.description } : {}),
   };
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(7) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:92:9
     ...(o.args !== undefined ? { args: o.args } : {}),
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
-    ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
+    ...(false ? { fixArgs: o.fixArgs } : {}),
     ...(o.description !== undefined ? { description: o.description } : {}),
   };
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(7) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:93:9
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
-    ...(o.description !== undefined ? { description: o.description } : {}),
+    ...(true ? { description: o.description } : {}),
   };
 }
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected undefined to be 'Vitest tests with coverage' // Object.is equality

[Killed] EqualityOperator
src/config.ts:93:9
     ...(o.outputFile !== undefined ? { outputFile: o.outputFile } : {}),
     ...(o.changedArgs !== undefined ? { changedArgs: o.changedArgs } : {}),
     ...(o.fixArgs !== undefined ? { fixArgs: o.fixArgs } : {}),
-    ...(o.description !== undefined ? { description: o.description } : {}),
+    ...(o.description === undefined ? { description: o.description } : {}),
   };
 }
killedBy: config resolution { use } overrides exactly the provided fields, keeping the rest
statusReason: expected { name: 'vitest', slot: 'test', …(8) } to match object { command: 'bun', args: [ 'x' ], …(4) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/config.ts:97:63
   };
 }
 
-function customAdapter(slot: string, c: CustomCheck): Adapter {
-  return {
-    name: c.name ?? `custom:${slot}`,
-    slot,
-    description: c.description ?? `Custom ${slot} check`,
-    detect: [],
-    command: c.command,
-    args: c.args ?? [],
-    outputFile: c.outputFile ?? null,
-    ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
-    ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
-    devDeps: {},
-  };
-}
+function customAdapter(slot: string, c: CustomCheck): Adapter {}
 
 function active(slot: Slot, adapter: Adapter): ResolvedCheck {
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected undefined to match object { command: 'node', …(4) }

[Killed] LogicalOperator
src/config.ts:99:11
 
 function customAdapter(slot: string, c: CustomCheck): Adapter {
   return {
-    name: c.name ?? `custom:${slot}`,
+    name: c.name && `custom:${slot}`,
     slot,
     description: c.description ?? `Custom ${slot} check`,
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: undefined, slot: 'lint', …(6) } to match object { command: 'node', …(4) }
(3 matching properties omitted from actual)

[Killed] LogicalOperator
src/config.ts:101:18
   return {
     name: c.name ?? `custom:${slot}`,
     slot,
-    description: c.description ?? `Custom ${slot} check`,
+    description: c.description && `Custom ${slot} check`,
     detect: [],
     command: c.command,
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'custom:lint', …(7) } to match object { command: 'node', …(4) }
(3 matching properties omitted from actual)

[Survived] ArrayDeclaration
src/config.ts:102:13
     name: c.name ?? `custom:${slot}`,
     slot,
     description: c.description ?? `Custom ${slot} check`,
-    detect: [],
+    detect: ["Stryker was here"],
     command: c.command,
     args: c.args ?? [],

[Killed] LogicalOperator
src/config.ts:104:11
     description: c.description ?? `Custom ${slot} check`,
     detect: [],
     command: c.command,
-    args: c.args ?? [],
+    args: c.args && [],
     outputFile: c.outputFile ?? null,
     ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'custom:lint', …(7) } to match object { command: 'node', …(4) }
(3 matching properties omitted from actual)

[Killed] LogicalOperator
src/config.ts:105:17
     detect: [],
     command: c.command,
     args: c.args ?? [],
-    outputFile: c.outputFile ?? null,
+    outputFile: c.outputFile && null,
     ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
     ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'custom:lint', …(7) } to match object { command: 'node', …(4) }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/config.ts:106:9
     command: c.command,
     args: c.args ?? [],
     outputFile: c.outputFile ?? null,
-    ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
+    ...(c.changedArgs === undefined ? { changedArgs: c.changedArgs } : {}),
     ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
     devDeps: {},
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'lic', slot: 'lint', …(7) } to match object { name: 'lic', description: 'D', …(4) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:106:9
     command: c.command,
     args: c.args ?? [],
     outputFile: c.outputFile ?? null,
-    ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
+    ...(false ? { changedArgs: c.changedArgs } : {}),
     ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
     devDeps: {},
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'lic', slot: 'lint', …(7) } to match object { name: 'lic', description: 'D', …(4) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/config.ts:107:9
     args: c.args ?? [],
     outputFile: c.outputFile ?? null,
     ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
-    ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
+    ...(false ? { fixArgs: c.fixArgs } : {}),
     devDeps: {},
   };
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'lic', slot: 'lint', …(7) } to match object { name: 'lic', description: 'D', …(4) }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/config.ts:107:9
     args: c.args ?? [],
     outputFile: c.outputFile ?? null,
     ...(c.changedArgs !== undefined ? { changedArgs: c.changedArgs } : {}),
-    ...(c.fixArgs !== undefined ? { fixArgs: c.fixArgs } : {}),
+    ...(c.fixArgs === undefined ? { fixArgs: c.fixArgs } : {}),
     devDeps: {},
   };
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected { name: 'lic', slot: 'lint', …(7) } to match object { name: 'lic', description: 'D', …(4) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/config.ts:112:62
   };
 }
 
-function active(slot: Slot, adapter: Adapter): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter, skip: null };
-}
+function active(slot: Slot, adapter: Adapter): ResolvedCheck {}
 
 function skipped(slot: Slot, reason: string): ResolvedCheck {
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: no resolution for lint

[Killed] BooleanLiteral
src/config.ts:113:50
 }
 
 function active(slot: Slot, adapter: Adapter): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter, skip: null };
+  return { slot: slot.name, optIn: slot.optIn ?? true, adapter, skip: null };
 }
 
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/config.ts:113:36
 }
 
 function active(slot: Slot, adapter: Adapter): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter, skip: null };
+  return { slot: slot.name, optIn: slot.optIn && false, adapter, skip: null };
 }
 
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/config.ts:116:61
   return { slot: slot.name, optIn: slot.optIn ?? false, adapter, skip: null };
 }
 
-function skipped(slot: Slot, reason: string): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter: null, skip: reason };
-}
+function skipped(slot: Slot, reason: string): ResolvedCheck {}
 
 function resolveOne(
killedBy: detection (no config) skips a slot with no detectable tool
statusReason: no resolution for lint

[Killed] BooleanLiteral
src/config.ts:117:50
 }
 
 function skipped(slot: Slot, reason: string): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter: null, skip: reason };
+  return { slot: slot.name, optIn: slot.optIn ?? true, adapter: null, skip: reason };
 }
 
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/config.ts:117:36
 }
 
 function skipped(slot: Slot, reason: string): ResolvedCheck {
-  return { slot: slot.name, optIn: slot.optIn ?? false, adapter: null, skip: reason };
+  return { slot: slot.name, optIn: slot.optIn && false, adapter: null, skip: reason };
 }
 
killedBy: detection (no config) propagates opt-in from the slot catalogue
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/config.ts:125:18
   entry: SlotConfig | undefined,
   adapters: readonly Adapter[],
   fileExists: (file: string) => boolean,
-): ResolvedCheck {
-  if (entry === false) {
-    return skipped(slot, 'disabled in checkride.config.json');
-  }
-  if (typeof entry === 'string') {
-    const adapter = byName(entry, adapters);
-    return adapter
-      ? active(slot, adapter)
-      : skipped(slot, `configured adapter '${entry}' is not in the registry`);
-  }
-  if (entry && typeof entry === 'object') {
-    if ('use' in entry) {
-      const base = byName(entry.use, adapters);
-      return base
-        ? active(slot, applyOverrides(base, entry))
-        : skipped(slot, `configured adapter '${entry.use}' is not in the registry`);
-    }
-    if ('command' in entry) {
-      return active(slot, customAdapter(slot.name, entry));
-    }
-  }
-  const detected = detectAdapter(slot.name, adapters, fileExists);
-  return detected ? active(slot, detected) : skipped(slot, 'no tool detected for slot');
-}
+): ResolvedCheck {}
 
 /**
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: no resolution for lint

[Killed] ConditionalExpression
src/config.ts:126:7
   adapters: readonly Adapter[],
   fileExists: (file: string) => boolean,
 ): ResolvedCheck {
-  if (entry === false) {
+  if (false) {
     return skipped(slot, 'disabled in checkride.config.json');
   }
killedBy: config resolution false disables the slot even when a tool is present
statusReason: expected null to be 'disabled in checkride.config.json' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:126:7
   adapters: readonly Adapter[],
   fileExists: (file: string) => boolean,
 ): ResolvedCheck {
-  if (entry === false) {
+  if (true) {
     return skipped(slot, 'disabled in checkride.config.json');
   }
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] EqualityOperator
src/config.ts:129:7
   if (entry === false) {
     return skipped(slot, 'disabled in checkride.config.json');
   }
-  if (typeof entry === 'string') {
+  if (typeof entry !== 'string') {
     const adapter = byName(entry, adapters);
     return adapter
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] BlockStatement
src/config.ts:129:34
   if (entry === false) {
     return skipped(slot, 'disabled in checkride.config.json');
   }
-  if (typeof entry === 'string') {
-    const adapter = byName(entry, adapters);
-    return adapter
-      ? active(slot, adapter)
-      : skipped(slot, `configured adapter '${entry}' is not in the registry`);
-  }
+  if (typeof entry === 'string') {}
   if (entry && typeof entry === 'object') {
     if ('use' in entry) {
killedBy: config resolution a string selects an adapter, beating detection
statusReason: expected undefined to be 'oxlint' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:135:7
       ? active(slot, adapter)
       : skipped(slot, `configured adapter '${entry}' is not in the registry`);
   }
-  if (entry && typeof entry === 'object') {
+  if (true) {
     if ('use' in entry) {
       const base = byName(entry.use, adapters);
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: Cannot use 'in' operator to search for 'use' in undefined

[Killed] EqualityOperator
src/config.ts:135:16
       ? active(slot, adapter)
       : skipped(slot, `configured adapter '${entry}' is not in the registry`);
   }
-  if (entry && typeof entry === 'object') {
+  if (entry && typeof entry !== 'object') {
     if ('use' in entry) {
       const base = byName(entry.use, adapters);
killedBy: config resolution { use } applies overrides on top of the adapter
statusReason: expected undefined to be 'vitest' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:136:9
       : skipped(slot, `configured adapter '${entry}' is not in the registry`);
   }
   if (entry && typeof entry === 'object') {
-    if ('use' in entry) {
+    if (true) {
       const base = byName(entry.use, adapters);
       return base
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected null to match object { command: 'node', …(4) }

[Killed] BlockStatement
src/config.ts:136:25
       : skipped(slot, `configured adapter '${entry}' is not in the registry`);
   }
   if (entry && typeof entry === 'object') {
-    if ('use' in entry) {
-      const base = byName(entry.use, adapters);
-      return base
-        ? active(slot, applyOverrides(base, entry))
-        : skipped(slot, `configured adapter '${entry.use}' is not in the registry`);
-    }
+    if ('use' in entry) {}
     if ('command' in entry) {
       return active(slot, customAdapter(slot.name, entry));
killedBy: config resolution { use } applies overrides on top of the adapter
statusReason: expected undefined to be 'vitest' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:142:9
         ? active(slot, applyOverrides(base, entry))
         : skipped(slot, `configured adapter '${entry.use}' is not in the registry`);
     }
-    if ('command' in entry) {
+    if (false) {
       return active(slot, customAdapter(slot.name, entry));
     }
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected null to match object { command: 'node', …(4) }

[Killed] BlockStatement
src/config.ts:142:29
         ? active(slot, applyOverrides(base, entry))
         : skipped(slot, `configured adapter '${entry.use}' is not in the registry`);
     }
-    if ('command' in entry) {
-      return active(slot, customAdapter(slot.name, entry));
-    }
+    if ('command' in entry) {}
   }
   const detected = detectAdapter(slot.name, adapters, fileExists);
killedBy: config resolution { command } custom check fills defaults and respects overrides
statusReason: expected null to match object { command: 'node', …(4) }
