[Killed] BlockStatement
src/config.ts:161:21
   config: CheckrideConfig | null;
   cwd?: string;
   fileExists?: (file: string) => boolean;
-}): ResolvedCheck[] {
-  const cwd = input.cwd ?? process.cwd();
-  const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
-  const checks = input.config?.checks ?? {};
-  const catalogue = input.slots.map((slot) =>
-    resolveOne(slot, checks[slot.name], input.adapters, fileExists),
-  );
-
-  const catalogueNames = new Set(input.slots.map((s) => s.name));
-  const extras: ResolvedCheck[] = [];
-  for (const [name, entry] of Object.entries(checks)) {
-    if (catalogueNames.has(name)) continue;
-    if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
-      extras.push(active({ name }, customAdapter(name, entry)));
-    }
-  }
-
-  return [...catalogue, ...extras];
-}
+}): ResolvedCheck[] {}
 
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/config.ts:162:15
   cwd?: string;
   fileExists?: (file: string) => boolean;
 }): ResolvedCheck[] {
-  const cwd = input.cwd ?? process.cwd();
+  const cwd = input.cwd && process.cwd();
   const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
   const checks = input.config?.checks ?? {};
killedBy: fixture: existing-biome a repo with biome.json (no oxlint config) resolves lint -> biome
statusReason: expected 'oxlint' to be 'biome' // Object.is equality

[Killed] LogicalOperator
src/config.ts:163:22
   fileExists?: (file: string) => boolean;
 }): ResolvedCheck[] {
   const cwd = input.cwd ?? process.cwd();
-  const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
+  const fileExists = input.fileExists && ((file: string) => existsSync(join(cwd, file)));
   const checks = input.config?.checks ?? {};
   const catalogue = input.slots.map((slot) =>
killedBy: detection (no config) skips a slot with no detectable tool
statusReason: expected { name: 'oxlint', slot: 'lint', …(7) } to be null

[Killed] ArrowFunction
src/config.ts:163:43
   fileExists?: (file: string) => boolean;
 }): ResolvedCheck[] {
   const cwd = input.cwd ?? process.cwd();
-  const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
+  const fileExists = input.fileExists ?? (() => undefined);
   const checks = input.config?.checks ?? {};
   const catalogue = input.slots.map((slot) =>
killedBy: runDoctor (real env, gutted project) reports missing tools for a project with no node_modules
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/config.ts:164:18
 }): ResolvedCheck[] {
   const cwd = input.cwd ?? process.cwd();
   const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
-  const checks = input.config?.checks ?? {};
+  const checks = input.config?.checks && {};
   const catalogue = input.slots.map((slot) =>
     resolveOne(slot, checks[slot.name], input.adapters, fileExists),
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: Cannot read properties of undefined (reading 'lint')

[Killed] OptionalChaining
src/config.ts:164:18
 }): ResolvedCheck[] {
   const cwd = input.cwd ?? process.cwd();
   const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
-  const checks = input.config?.checks ?? {};
+  const checks = input.config.checks ?? {};
   const catalogue = input.slots.map((slot) =>
     resolveOne(slot, checks[slot.name], input.adapters, fileExists),
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: Cannot read properties of null (reading 'checks')

[Killed] ArrowFunction
src/config.ts:165:37
   const cwd = input.cwd ?? process.cwd();
   const fileExists = input.fileExists ?? ((file: string) => existsSync(join(cwd, file)));
   const checks = input.config?.checks ?? {};
-  const catalogue = input.slots.map((slot) =>
-    resolveOne(slot, checks[slot.name], input.adapters, fileExists),
+  const catalogue = input.slots.map(() => undefined,
   );
 
killedBy: detection (no config) picks the blessed adapter when its config file is present
statusReason: no resolution for lint

[Survived] ArrowFunction
src/config.ts:169:50
     resolveOne(slot, checks[slot.name], input.adapters, fileExists),
   );
 
-  const catalogueNames = new Set(input.slots.map((s) => s.name));
+  const catalogueNames = new Set(input.slots.map(() => undefined));
   const extras: ResolvedCheck[] = [];
   for (const [name, entry] of Object.entries(checks)) {

[Killed] ArrayDeclaration
src/config.ts:170:35
   );
 
   const catalogueNames = new Set(input.slots.map((s) => s.name));
-  const extras: ResolvedCheck[] = [];
+  const extras: ResolvedCheck[] = ["Stryker was here"];
   for (const [name, entry] of Object.entries(checks)) {
     if (catalogueNames.has(name)) continue;
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: expected [ 'types', 'lint', undefined ] to deeply equal [ 'types', 'lint' ]

[Killed] BlockStatement
src/config.ts:171:55
 
   const catalogueNames = new Set(input.slots.map((s) => s.name));
   const extras: ResolvedCheck[] = [];
-  for (const [name, entry] of Object.entries(checks)) {
-    if (catalogueNames.has(name)) continue;
-    if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
-      extras.push(active({ name }, customAdapter(name, entry)));
-    }
-  }
+  for (const [name, entry] of Object.entries(checks)) {}
 
   return [...catalogue, ...extras];
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected undefined to be 'node' // Object.is equality

[Killed] ConditionalExpression
src/config.ts:172:9
   const catalogueNames = new Set(input.slots.map((s) => s.name));
   const extras: ResolvedCheck[] = [];
   for (const [name, entry] of Object.entries(checks)) {
-    if (catalogueNames.has(name)) continue;
+    if (true) continue;
     if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
       extras.push(active({ name }, customAdapter(name, entry)));
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected undefined to be 'node' // Object.is equality

[Survived] ConditionalExpression
src/config.ts:172:9
   const catalogueNames = new Set(input.slots.map((s) => s.name));
   const extras: ResolvedCheck[] = [];
   for (const [name, entry] of Object.entries(checks)) {
-    if (catalogueNames.has(name)) continue;
+    if (false) continue;
     if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
       extras.push(active({ name }, customAdapter(name, entry)));

[Killed] EqualityOperator
src/config.ts:173:18
   const extras: ResolvedCheck[] = [];
   for (const [name, entry] of Object.entries(checks)) {
     if (catalogueNames.has(name)) continue;
-    if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
+    if (entry && typeof entry !== 'object' && !('use' in entry) && 'command' in entry) {
       extras.push(active({ name }, customAdapter(name, entry)));
     }
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected undefined to be 'node' // Object.is equality

[Killed] BlockStatement
src/config.ts:173:88
   const extras: ResolvedCheck[] = [];
   for (const [name, entry] of Object.entries(checks)) {
     if (catalogueNames.has(name)) continue;
-    if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {
-      extras.push(active({ name }, customAdapter(name, entry)));
-    }
+    if (entry && typeof entry === 'object' && !('use' in entry) && 'command' in entry) {}
   }
 
killedBy: config resolution a custom check on a non-catalogue name is appended
statusReason: expected undefined to be 'node' // Object.is equality
