[Killed] BlockStatement
src/doctor.ts:79:63
   install: 'Run `pnpm install` from the repo root.',
 };
 
-async function whichReal(cmd: string): Promise<string | null> {
-  try {
-    const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
-    const first = stdout.split('\n').find((l) => l.trim());
-    return first ? first.trim() : null;
-  } catch {
-    return null;
-  }
-}
+async function whichReal(cmd: string): Promise<string | null> {}
 
 async function versionReal(cmd: string, args: string[]): Promise<string | null> {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:80:7
 };
 
 async function whichReal(cmd: string): Promise<string | null> {
-  try {
-    const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
-    const first = stdout.split('\n').find((l) => l.trim());
-    return first ? first.trim() : null;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:81:40
 
 async function whichReal(cmd: string): Promise<string | null> {
   try {
-    const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
+    const { stdout } = await execFileP(true ? 'where' : 'which', [cmd]);
     const first = stdout.split('\n').find((l) => l.trim());
     return first ? first.trim() : null;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/doctor.ts:81:40
 
 async function whichReal(cmd: string): Promise<string | null> {
   try {
-    const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
+    const { stdout } = await execFileP(process.platform !== 'win32' ? 'where' : 'which', [cmd]);
     const first = stdout.split('\n').find((l) => l.trim());
     return first ? first.trim() : null;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/doctor.ts:82:43
 async function whichReal(cmd: string): Promise<string | null> {
   try {
     const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
-    const first = stdout.split('\n').find((l) => l.trim());
+    const first = stdout.split('\n').find(() => undefined);
     return first ? first.trim() : null;
   } catch {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Survived] MethodExpression
src/doctor.ts:82:50
 async function whichReal(cmd: string): Promise<string | null> {
   try {
     const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
-    const first = stdout.split('\n').find((l) => l.trim());
+    const first = stdout.split('\n').find((l) => l);
     return first ? first.trim() : null;
   } catch {

[Survived] MethodExpression
src/doctor.ts:83:20
   try {
     const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
     const first = stdout.split('\n').find((l) => l.trim());
-    return first ? first.trim() : null;
+    return first ? first : null;
   } catch {
     return null;

[NoCoverage] BlockStatement
src/doctor.ts:84:11
     const { stdout } = await execFileP(process.platform === 'win32' ? 'where' : 'which', [cmd]);
     const first = stdout.split('\n').find((l) => l.trim());
     return first ? first.trim() : null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/doctor.ts:89:81
   }
 }
 
-async function versionReal(cmd: string, args: string[]): Promise<string | null> {
-  try {
-    const { stdout } = await execFileP(cmd, args, { timeout: 5000 });
-    return stdout.trim();
-  } catch {
-    return null;
-  }
-}
+async function versionReal(cmd: string, args: string[]): Promise<string | null> {}
 
 async function canWriteReal(dir: string): Promise<boolean> {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:90:7
 }
 
 async function versionReal(cmd: string, args: string[]): Promise<string | null> {
-  try {
-    const { stdout } = await execFileP(cmd, args, { timeout: 5000 });
-    return stdout.trim();
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Survived] ObjectLiteral
src/doctor.ts:91:51
 
 async function versionReal(cmd: string, args: string[]): Promise<string | null> {
   try {
-    const { stdout } = await execFileP(cmd, args, { timeout: 5000 });
+    const { stdout } = await execFileP(cmd, args, {});
     return stdout.trim();
   } catch {

[Survived] MethodExpression
src/doctor.ts:92:12
 async function versionReal(cmd: string, args: string[]): Promise<string | null> {
   try {
     const { stdout } = await execFileP(cmd, args, { timeout: 5000 });
-    return stdout.trim();
+    return stdout;
   } catch {
     return null;

[NoCoverage] BlockStatement
src/doctor.ts:93:11
   try {
     const { stdout } = await execFileP(cmd, args, { timeout: 5000 });
     return stdout.trim();
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/doctor.ts:98:60
   }
 }
 
-async function canWriteReal(dir: string): Promise<boolean> {
-  try {
-    await mkdir(dir, { recursive: true });
-    const probe = join(dir, `.write-probe-${process.pid}`);
-    await writeFile(probe, '');
-    await rm(probe, { force: true });
-    return true;
-  } catch {
-    return false;
-  }
-}
+async function canWriteReal(dir: string): Promise<boolean> {}
 
 function readEnginesReal(cwd: string): { node?: string; pnpm?: string } {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:99:7
 }
 
 async function canWriteReal(dir: string): Promise<boolean> {
-  try {
-    await mkdir(dir, { recursive: true });
-    const probe = join(dir, `.write-probe-${process.pid}`);
-    await writeFile(probe, '');
-    await rm(probe, { force: true });
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:100:35
 
 async function canWriteReal(dir: string): Promise<boolean> {
   try {
-    await mkdir(dir, { recursive: true });
+    await mkdir(dir, { recursive: false });
     const probe = join(dir, `.write-probe-${process.pid}`);
     await writeFile(probe, '');
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BooleanLiteral
src/doctor.ts:103:30
     await mkdir(dir, { recursive: true });
     const probe = join(dir, `.write-probe-${process.pid}`);
     await writeFile(probe, '');
-    await rm(probe, { force: true });
+    await rm(probe, { force: false });
     return true;
   } catch {

[Killed] BooleanLiteral
src/doctor.ts:104:12
     const probe = join(dir, `.write-probe-${process.pid}`);
     await writeFile(probe, '');
     await rm(probe, { force: true });
-    return true;
+    return false;
   } catch {
     return false;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:110:73
   }
 }
 
-function readEnginesReal(cwd: string): { node?: string; pnpm?: string } {
-  try {
-    const raw = readFileSync(join(cwd, 'package.json'), 'utf8');
-    const pkg: { engines?: { node?: string; pnpm?: string } } = JSON.parse(raw);
-    return pkg.engines ?? {};
-  } catch {
-    return {};
-  }
-}
+function readEnginesReal(cwd: string): { node?: string; pnpm?: string } {}
 
 const realEnv: DoctorEnv = {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:111:7
 }
 
 function readEnginesReal(cwd: string): { node?: string; pnpm?: string } {
-  try {
-    const raw = readFileSync(join(cwd, 'package.json'), 'utf8');
-    const pkg: { engines?: { node?: string; pnpm?: string } } = JSON.parse(raw);
-    return pkg.engines ?? {};
-  } catch {
+  try {} catch {
     return {};
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Survived] LogicalOperator
src/doctor.ts:114:12
   try {
     const raw = readFileSync(join(cwd, 'package.json'), 'utf8');
     const pkg: { engines?: { node?: string; pnpm?: string } } = JSON.parse(raw);
-    return pkg.engines ?? {};
+    return pkg.engines && {};
   } catch {
     return {};

[Killed] BlockStatement
src/doctor.ts:115:11
     const raw = readFileSync(join(cwd, 'package.json'), 'utf8');
     const pkg: { engines?: { node?: string; pnpm?: string } } = JSON.parse(raw);
     return pkg.engines ?? {};
-  } catch {
-    return {};
-  }
+  } catch {}
 }
 
killedBy: runDoctor (real env, gutted project) reports missing tools for a project with no node_modules
statusReason: Cannot read properties of undefined (reading 'node')

[Survived] ArrowFunction
src/doctor.ts:126:13
   exists: existsSync,
   canWrite: canWriteReal,
   readEngines: readEnginesReal,
-  platform: () => ({ os: osPlatform(), arch: osArch() }),
+  platform: () => undefined,
 };
 

[Survived] ObjectLiteral
src/doctor.ts:126:20
   exists: existsSync,
   canWrite: canWriteReal,
   readEngines: readEnginesReal,
-  platform: () => ({ os: osPlatform(), arch: osArch() }),
+  platform: () => ({}),
 };
 

[Killed] BlockStatement
src/doctor.ts:129:70
   platform: () => ({ os: osPlatform(), arch: osArch() }),
 };
 
-function parseSemver(text: string | null | undefined): Semver | null {
-  if (!text) return null;
-  const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
-  if (!m) return null;
-  return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
-}
+function parseSemver(text: string | null | undefined): Semver | null {}
 
 function compareSemver(a: Semver, b: Semver): number {
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:130:7
 };
 
 function parseSemver(text: string | null | undefined): Semver | null {
-  if (!text) return null;
+  if (true) return null;
   const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
   if (!m) return null;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:130:7
 };
 
 function parseSemver(text: string | null | undefined): Semver | null {
-  if (!text) return null;
+  if (text) return null;
   const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
   if (!m) return null;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] Regex
src/doctor.ts:131:13
 
 function parseSemver(text: string | null | undefined): Semver | null {
   if (!text) return null;
-  const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
+  const m = /(\d+)\.(\d+)\.(\D+)/.exec(text);
   if (!m) return null;
   return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/doctor.ts:131:13
 
 function parseSemver(text: string | null | undefined): Semver | null {
   if (!text) return null;
-  const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
+  const m = /(\d+)\.(\D+)\.(\d+)/.exec(text);
   if (!m) return null;
   return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:132:7
 function parseSemver(text: string | null | undefined): Semver | null {
   if (!text) return null;
   const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
-  if (!m) return null;
+  if (true) return null;
   return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
 }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:132:7
 function parseSemver(text: string | null | undefined): Semver | null {
   if (!text) return null;
   const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
-  if (!m) return null;
+  if (m) return null;
   return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
 }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/doctor.ts:133:10
   if (!text) return null;
   const m = /(\d+)\.(\d+)\.(\d+)/.exec(text);
   if (!m) return null;
-  return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
+  return {};
 }
 
killedBy: runDoctor (injected env) an outdated node is flagged
statusReason: expected 'ok' to be 'outdated' // Object.is equality

[Killed] BlockStatement
src/doctor.ts:136:54
   return { major: Number(m[1]), minor: Number(m[2]), patch: Number(m[3]), raw: m[0] };
 }
 
-function compareSemver(a: Semver, b: Semver): number {
-  if (a.major !== b.major) return a.major - b.major;
-  if (a.minor !== b.minor) return a.minor - b.minor;
-  return a.patch - b.patch;
-}
+function compareSemver(a: Semver, b: Semver): number {}
 
 function formatExpected(min: Semver): string {
killedBy: runDoctor (injected env) an outdated node is flagged
statusReason: expected 'ok' to be 'outdated' // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:137:7
 }
 
 function compareSemver(a: Semver, b: Semver): number {
-  if (a.major !== b.major) return a.major - b.major;
+  if (false) return a.major - b.major;
   if (a.minor !== b.minor) return a.minor - b.minor;
   return a.patch - b.patch;
killedBy: runDoctor (injected env) an outdated node is flagged
statusReason: expected 'ok' to be 'outdated' // Object.is equality

[Killed] EqualityOperator
src/doctor.ts:137:7
 }
 
 function compareSemver(a: Semver, b: Semver): number {
-  if (a.major !== b.major) return a.major - b.major;
+  if (a.major === b.major) return a.major - b.major;
   if (a.minor !== b.minor) return a.minor - b.minor;
   return a.patch - b.patch;
killedBy: runDoctor (injected env) an outdated node is flagged
statusReason: expected 'ok' to be 'outdated' // Object.is equality

[Survived] ArithmeticOperator
src/doctor.ts:138:35
 
 function compareSemver(a: Semver, b: Semver): number {
   if (a.major !== b.major) return a.major - b.major;
-  if (a.minor !== b.minor) return a.minor - b.minor;
+  if (a.minor !== b.minor) return a.minor + b.minor;
   return a.patch - b.patch;
 }

[Survived] ConditionalExpression
src/doctor.ts:138:7
 
 function compareSemver(a: Semver, b: Semver): number {
   if (a.major !== b.major) return a.major - b.major;
-  if (a.minor !== b.minor) return a.minor - b.minor;
+  if (false) return a.minor - b.minor;
   return a.patch - b.patch;
 }

[Survived] ArithmeticOperator
src/doctor.ts:139:10
 function compareSemver(a: Semver, b: Semver): number {
   if (a.major !== b.major) return a.major - b.major;
   if (a.minor !== b.minor) return a.minor - b.minor;
-  return a.patch - b.patch;
+  return a.patch + b.patch;
 }
 

[Survived] BlockStatement
src/doctor.ts:142:46
   return a.patch - b.patch;
 }
 
-function formatExpected(min: Semver): string {
-  return `>=${min.major}.${min.minor}.${min.patch}`;
-}
+function formatExpected(min: Semver): string {}
 
 async function checkVersioned(name: string, cmd: string, min: Semver, env: DoctorEnv): Promise<DoctorCheck> {

[Killed] BlockStatement
src/doctor.ts:146:109
   return `>=${min.major}.${min.minor}.${min.patch}`;
 }
 
-async function checkVersioned(name: string, cmd: string, min: Semver, env: DoctorEnv): Promise<DoctorCheck> {
-  const expected = formatExpected(min);
-  const path = await env.which(cmd);
-  if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
-  }
-  const found = parseSemver(await env.version(cmd, ['--version']));
-  if (!found) {
-    return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
-  }
-  if (compareSemver(found, min) < 0) {
-    return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
-  }
-  return { name, category: 'env', required: true, status: 'ok', found: found.raw, expected, hint: null };
-}
+async function checkVersioned(name: string, cmd: string, min: Semver, env: DoctorEnv): Promise<DoctorCheck> {}
 
 async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:149:7
 async function checkVersioned(name: string, cmd: string, min: Semver, env: DoctorEnv): Promise<DoctorCheck> {
   const expected = formatExpected(min);
   const path = await env.which(cmd);
-  if (!path) {
+  if (path) {
     return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:149:7
 async function checkVersioned(name: string, cmd: string, min: Semver, env: DoctorEnv): Promise<DoctorCheck> {
   const expected = formatExpected(min);
   const path = await env.which(cmd);
-  if (!path) {
+  if (true) {
     return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/doctor.ts:150:47
   const expected = formatExpected(min);
   const path = await env.which(cmd);
   if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
+    return { name, category: 'env', required: false, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const found = parseSemver(await env.version(cmd, ['--version']));

[Survived] LogicalOperator
src/doctor.ts:150:101
   const expected = formatExpected(min);
   const path = await env.which(cmd);
   if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
+    return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] && `Install \`${cmd}\`.` };
   }
   const found = parseSemver(await env.version(cmd, ['--version']));

[Killed] ConditionalExpression
src/doctor.ts:153:7
     return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const found = parseSemver(await env.version(cmd, ['--version']));
-  if (!found) {
+  if (true) {
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:153:7
     return { name, category: 'env', required: true, status: 'missing', found: null, expected, hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const found = parseSemver(await env.version(cmd, ['--version']));
-  if (!found) {
+  if (found) {
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] BooleanLiteral
src/doctor.ts:154:47
   }
   const found = parseSemver(await env.version(cmd, ['--version']));
   if (!found) {
-    return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
+    return { name, category: 'env', required: false, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
   if (compareSemver(found, min) < 0) {

[Killed] EqualityOperator
src/doctor.ts:156:7
   if (!found) {
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
-  if (compareSemver(found, min) < 0) {
+  if (compareSemver(found, min) >= 0) {
     return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/doctor.ts:156:7
   if (!found) {
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
-  if (compareSemver(found, min) < 0) {
+  if (compareSemver(found, min) <= 0) {
     return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
   }
killedBy: runDoctor (injected env) a version exactly at the minimum is ok, not outdated
statusReason: expected 'outdated' to be 'ok' // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:157:47
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
   if (compareSemver(found, min) < 0) {
-    return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
+    return { name, category: 'env', required: false, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
   }
   return { name, category: 'env', required: true, status: 'ok', found: found.raw, expected, hint: null };
killedBy: runDoctor (injected env) an outdated node is flagged
statusReason: expected true to be false // Object.is equality

[Survived] LogicalOperator
src/doctor.ts:157:107
     return { name, category: 'env', required: true, status: 'unknown', found: null, expected, hint: `Could not parse \`${cmd} --version\` output.` };
   }
   if (compareSemver(found, min) < 0) {
-    return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
+    return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] && `Upgrade \`${cmd}\` to ${expected}.` };
   }
   return { name, category: 'env', required: true, status: 'ok', found: found.raw, expected, hint: null };

[Survived] BooleanLiteral
src/doctor.ts:159:45
   if (compareSemver(found, min) < 0) {
     return { name, category: 'env', required: true, status: 'outdated', found: found.raw, expected, hint: INSTALL_HINTS[name] ?? `Upgrade \`${cmd}\` to ${expected}.` };
   }
-  return { name, category: 'env', required: true, status: 'ok', found: found.raw, expected, hint: null };
+  return { name, category: 'env', required: false, status: 'ok', found: found.raw, expected, hint: null };
 }
 

[Killed] BlockStatement
src/doctor.ts:162:94
   return { name, category: 'env', required: true, status: 'ok', found: found.raw, expected, hint: null };
 }
 
-async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
-  const path = await env.which(cmd);
-  if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
-  }
-  const raw = await env.version(cmd, ['--version']);
-  return { name, category: 'env', required: true, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
-}
+async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {}
 
 function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/doctor.ts:164:14
 
 async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const path = await env.which(cmd);
-  if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
-  }
+  if (!path) {}
   const raw = await env.version(cmd, ['--version']);
   return { name, category: 'env', required: true, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
killedBy: runDoctor (injected env) a missing required binary on PATH is reported
statusReason: expected 'ok' to be 'missing' // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:164:7
 
 async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const path = await env.which(cmd);
-  if (!path) {
+  if (false) {
     return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
killedBy: runDoctor (injected env) a missing required binary on PATH is reported
statusReason: expected 'ok' to be 'missing' // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:165:47
 async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const path = await env.which(cmd);
   if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
+    return { name, category: 'env', required: false, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const raw = await env.version(cmd, ['--version']);
killedBy: runDoctor (injected env) a missing required binary on PATH is reported
statusReason: expected true to be false // Object.is equality

[Survived] LogicalOperator
src/doctor.ts:165:120
 async function checkPresent(name: string, cmd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const path = await env.which(cmd);
   if (!path) {
-    return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
+    return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] && `Install \`${cmd}\`.` };
   }
   const raw = await env.version(cmd, ['--version']);

[Survived] BooleanLiteral
src/doctor.ts:168:45
     return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const raw = await env.version(cmd, ['--version']);
-  return { name, category: 'env', required: true, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
+  return { name, category: 'env', required: false, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
 }
 

[Survived] LogicalOperator
src/doctor.ts:168:72
     return { name, category: 'env', required: true, status: 'missing', found: null, expected: 'present on PATH', hint: INSTALL_HINTS[name] ?? `Install \`${cmd}\`.` };
   }
   const raw = await env.version(cmd, ['--version']);
-  return { name, category: 'env', required: true, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
+  return { name, category: 'env', required: true, status: 'ok', found: raw && path, expected: 'present on PATH', hint: null };
 }
 
