[Killed] BlockStatement
src/doctor.ts:171:65
   return { name, category: 'env', required: true, status: 'ok', found: raw ?? path, expected: 'present on PATH', hint: null };
 }
 
-function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
-  if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
-  }
-  if (!env.exists(join(cwd, 'node_modules'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
-  }
-  return { name: 'install', category: 'install', required: true, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };
-}
+function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {}
 
 async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] BooleanLiteral
src/doctor.ts:172:7
 }
 
 function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
-  if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
+  if (env.exists(join(cwd, 'pnpm-lock.yaml'))) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:172:7
 }
 
 function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
-  if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
+  if (true) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/doctor.ts:173:62
 
 function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
   if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
+    return { name: 'install', category: 'install', required: false, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
   if (!env.exists(join(cwd, 'node_modules'))) {

[Survived] LogicalOperator
src/doctor.ts:173:142
 
 function checkInstall(cwd: string, env: DoctorEnv): DoctorCheck {
   if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
+    return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] && null };
   }
   if (!env.exists(join(cwd, 'node_modules'))) {

[Killed] BooleanLiteral
src/doctor.ts:175:7
   if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
-  if (!env.exists(join(cwd, 'node_modules'))) {
+  if (env.exists(join(cwd, 'node_modules'))) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:175:7
   if (!env.exists(join(cwd, 'pnpm-lock.yaml'))) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
-  if (!env.exists(join(cwd, 'node_modules'))) {
+  if (true) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
   }
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] BooleanLiteral
src/doctor.ts:176:62
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
   if (!env.exists(join(cwd, 'node_modules'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
+    return { name: 'install', category: 'install', required: false, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
   }
   return { name: 'install', category: 'install', required: true, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };

[NoCoverage] LogicalOperator
src/doctor.ts:176:154
     return { name: 'install', category: 'install', required: true, status: 'missing', found: null, expected: 'pnpm-lock.yaml present', hint: INSTALL_HINTS['install'] ?? null };
   }
   if (!env.exists(join(cwd, 'node_modules'))) {
-    return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
+    return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] && null };
   }
   return { name: 'install', category: 'install', required: true, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };

[Survived] BooleanLiteral
src/doctor.ts:178:60
   if (!env.exists(join(cwd, 'node_modules'))) {
     return { name: 'install', category: 'install', required: true, status: 'missing', found: 'lockfile only', expected: 'node_modules/ populated', hint: INSTALL_HINTS['install'] ?? null };
   }
-  return { name: 'install', category: 'install', required: true, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };
+  return { name: 'install', category: 'install', required: false, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };
 }
 

[Killed] BlockStatement
src/doctor.ts:181:95
   return { name: 'install', category: 'install', required: true, status: 'ok', found: 'node_modules + lockfile', expected: null, hint: null };
 }
 
-async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
-  const name = `${adapter.name} (${adapter.slot})`;
-  if (adapter.builtin) {
-    return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
-  }
-  if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
-    const tool = adapter.args[1];
-    if (!tool) {
-      return { name, category: 'tool', required: true, status: 'unknown', found: null, expected: null, hint: null };
-    }
-    const bin = join(cwd, 'node_modules', '.bin', tool);
-    return env.exists(bin)
-      ? { name, category: 'tool', required: true, status: 'ok', found: bin, expected: `node_modules/.bin/${tool}`, hint: null }
-      : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `node_modules/.bin/${tool}`, hint: `Run \`pnpm install\` (or add ${tool}).` };
-  }
-  const path = await env.which(adapter.command);
-  return path
-    ? { name, category: 'tool', required: true, status: 'ok', found: path, expected: `${adapter.command} on PATH`, hint: null }
-    : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `${adapter.command} on PATH`, hint: `Install \`${adapter.command}\`.` };
-}
+async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {}
 
 async function checkWritable(cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:183:7
 
 async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const name = `${adapter.name} (${adapter.slot})`;
-  if (adapter.builtin) {
+  if (true) {
     return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
   }
killedBy: runDoctor (injected env) a missing tool binary -> missing, exit 1
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/doctor.ts:183:7
 
 async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const name = `${adapter.name} (${adapter.slot})`;
-  if (adapter.builtin) {
+  if (false) {
     return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
   }

[Survived] BooleanLiteral
src/doctor.ts:184:48
 async function checkTool(adapter: Adapter, cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
   const name = `${adapter.name} (${adapter.slot})`;
   if (adapter.builtin) {
-    return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
+    return { name, category: 'tool', required: false, status: 'ok', found: 'built-in', expected: null, hint: null };
   }
   if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {

[Killed] EqualityOperator
src/doctor.ts:186:7
   if (adapter.builtin) {
     return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
   }
-  if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
+  if (adapter.command !== 'pnpm' && adapter.args[0] === 'exec') {
     const tool = adapter.args[1];
     if (!tool) {
killedBy: runDoctor (injected env) a missing tool binary -> missing, exit 1
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/doctor.ts:186:37
   if (adapter.builtin) {
     return { name, category: 'tool', required: true, status: 'ok', found: 'built-in', expected: null, hint: null };
   }
-  if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
+  if (adapter.command === 'pnpm' && adapter.args[0] !== 'exec') {
     const tool = adapter.args[1];
     if (!tool) {
killedBy: runDoctor (injected env) a missing tool binary -> missing, exit 1
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:188:9
   }
   if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
     const tool = adapter.args[1];
-    if (!tool) {
+    if (tool) {
       return { name, category: 'tool', required: true, status: 'unknown', found: null, expected: null, hint: null };
     }
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/doctor.ts:188:9
   }
   if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
     const tool = adapter.args[1];
-    if (!tool) {
+    if (true) {
       return { name, category: 'tool', required: true, status: 'unknown', found: null, expected: null, hint: null };
     }
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/doctor.ts:189:50
   if (adapter.command === 'pnpm' && adapter.args[0] === 'exec') {
     const tool = adapter.args[1];
     if (!tool) {
-      return { name, category: 'tool', required: true, status: 'unknown', found: null, expected: null, hint: null };
+      return { name, category: 'tool', required: false, status: 'unknown', found: null, expected: null, hint: null };
     }
     const bin = join(cwd, 'node_modules', '.bin', tool);

[Survived] BooleanLiteral
src/doctor.ts:193:45
     }
     const bin = join(cwd, 'node_modules', '.bin', tool);
     return env.exists(bin)
-      ? { name, category: 'tool', required: true, status: 'ok', found: bin, expected: `node_modules/.bin/${tool}`, hint: null }
+      ? { name, category: 'tool', required: false, status: 'ok', found: bin, expected: `node_modules/.bin/${tool}`, hint: null }
       : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `node_modules/.bin/${tool}`, hint: `Run \`pnpm install\` (or add ${tool}).` };
   }

[Killed] BooleanLiteral
src/doctor.ts:194:45
     const bin = join(cwd, 'node_modules', '.bin', tool);
     return env.exists(bin)
       ? { name, category: 'tool', required: true, status: 'ok', found: bin, expected: `node_modules/.bin/${tool}`, hint: null }
-      : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `node_modules/.bin/${tool}`, hint: `Run \`pnpm install\` (or add ${tool}).` };
+      : { name, category: 'tool', required: false, status: 'missing', found: null, expected: `node_modules/.bin/${tool}`, hint: `Run \`pnpm install\` (or add ${tool}).` };
   }
   const path = await env.which(adapter.command);
killedBy: runDoctor (injected env) a missing tool binary -> missing, exit 1
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/doctor.ts:198:43
   }
   const path = await env.which(adapter.command);
   return path
-    ? { name, category: 'tool', required: true, status: 'ok', found: path, expected: `${adapter.command} on PATH`, hint: null }
+    ? { name, category: 'tool', required: false, status: 'ok', found: path, expected: `${adapter.command} on PATH`, hint: null }
     : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `${adapter.command} on PATH`, hint: `Install \`${adapter.command}\`.` };
 }

[Survived] BooleanLiteral
src/doctor.ts:199:43
   const path = await env.which(adapter.command);
   return path
     ? { name, category: 'tool', required: true, status: 'ok', found: path, expected: `${adapter.command} on PATH`, hint: null }
-    : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `${adapter.command} on PATH`, hint: `Install \`${adapter.command}\`.` };
+    : { name, category: 'tool', required: false, status: 'missing', found: null, expected: `${adapter.command} on PATH`, hint: `Install \`${adapter.command}\`.` };
 }
 

[Killed] BlockStatement
src/doctor.ts:202:81
     : { name, category: 'tool', required: true, status: 'missing', found: null, expected: `${adapter.command} on PATH`, hint: `Install \`${adapter.command}\`.` };
 }
 
-async function checkWritable(cwd: string, env: DoctorEnv): Promise<DoctorCheck> {
-  const dir = join(cwd, '.check');
-  const ok = await env.canWrite(dir);
-  return ok
-    ? { name: '.check', category: 'workspace', required: true, status: 'ok', found: 'writable', expected: 'writable', hint: null }
-    : { name: '.check', category: 'workspace', required: true, status: 'missing', found: 'not writable', expected: 'writable', hint: `Ensure ${dir} is writable.` };
-}
+async function checkWritable(cwd: string, env: DoctorEnv): Promise<DoctorCheck> {}
 
 function statusMark(status: DoctorStatus): string {
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: Cannot read properties of undefined (reading 'required')

[Survived] BooleanLiteral
src/doctor.ts:206:58
   const dir = join(cwd, '.check');
   const ok = await env.canWrite(dir);
   return ok
-    ? { name: '.check', category: 'workspace', required: true, status: 'ok', found: 'writable', expected: 'writable', hint: null }
+    ? { name: '.check', category: 'workspace', required: false, status: 'ok', found: 'writable', expected: 'writable', hint: null }
     : { name: '.check', category: 'workspace', required: true, status: 'missing', found: 'not writable', expected: 'writable', hint: `Ensure ${dir} is writable.` };
 }

[NoCoverage] BooleanLiteral
src/doctor.ts:207:58
   const ok = await env.canWrite(dir);
   return ok
     ? { name: '.check', category: 'workspace', required: true, status: 'ok', found: 'writable', expected: 'writable', hint: null }
-    : { name: '.check', category: 'workspace', required: true, status: 'missing', found: 'not writable', expected: 'writable', hint: `Ensure ${dir} is writable.` };
+    : { name: '.check', category: 'workspace', required: false, status: 'missing', found: 'not writable', expected: 'writable', hint: `Ensure ${dir} is writable.` };
 }
 

[Survived] BlockStatement
src/doctor.ts:210:51
     : { name: '.check', category: 'workspace', required: true, status: 'missing', found: 'not writable', expected: 'writable', hint: `Ensure ${dir} is writable.` };
 }
 
-function statusMark(status: DoctorStatus): string {
-  if (status === 'ok') return '✔';
-  if (status === 'outdated') return '⚠';
-  return '✘';
-}
+function statusMark(status: DoctorStatus): string {}
 
 const GROUPS: { key: DoctorCheck['category']; label: string }[] = [

[Survived] EqualityOperator
src/doctor.ts:211:7
 }
 
 function statusMark(status: DoctorStatus): string {
-  if (status === 'ok') return '✔';
+  if (status !== 'ok') return '✔';
   if (status === 'outdated') return '⚠';
   return '✘';

[Survived] ConditionalExpression
src/doctor.ts:211:7
 }
 
 function statusMark(status: DoctorStatus): string {
-  if (status === 'ok') return '✔';
+  if (true) return '✔';
   if (status === 'outdated') return '⚠';
   return '✘';

[NoCoverage] ConditionalExpression
src/doctor.ts:212:7
 
 function statusMark(status: DoctorStatus): string {
   if (status === 'ok') return '✔';
-  if (status === 'outdated') return '⚠';
+  if (false) return '⚠';
   return '✘';
 }

[NoCoverage] EqualityOperator
src/doctor.ts:212:7
 
 function statusMark(status: DoctorStatus): string {
   if (status === 'ok') return '✔';
-  if (status === 'outdated') return '⚠';
+  if (status !== 'outdated') return '⚠';
   return '✘';
 }

[Survived] ObjectLiteral
src/doctor.ts:218:3
 
 const GROUPS: { key: DoctorCheck['category']; label: string }[] = [
   { key: 'env', label: 'ENVIRONMENT' },
-  { key: 'install', label: 'INSTALL' },
+  {},
   { key: 'tool', label: 'TOOLS' },
   { key: 'workspace', label: 'WORKSPACE' },

[Killed] BlockStatement
src/doctor.ts:223:60
   { key: 'workspace', label: 'WORKSPACE' },
 ];
 
-function renderTable(report: DoctorReport, out: Out): void {
-  out.write('\ncheckride doctor\n\n');
-  for (const group of GROUPS) {
-    const items = report.checks.filter((c) => c.category === group.key);
-    if (items.length === 0) continue;
-    out.write(`  ${group.label}\n`);
-    for (const c of items) {
-      const found = c.found ?? '—';
-      const expected = c.expected ? `  (${c.expected})` : '';
-      out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);
-      if (c.status !== 'ok' && c.hint) out.write(`      -> ${c.hint}\n`);
-    }
-  }
-  out.write(report.ok ? '\n✔ environment ok\n\n' : '\n✘ environment has problems (see above)\n\n');
-}
+function renderTable(report: DoctorReport, out: Out): void {}
 
 /** Run the doctor against `cwd`; render and return the report. */
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '' to contain 'checkride doctor'

[Killed] BlockStatement
src/doctor.ts:225:31
 
 function renderTable(report: DoctorReport, out: Out): void {
   out.write('\ncheckride doctor\n\n');
-  for (const group of GROUPS) {
-    const items = report.checks.filter((c) => c.category === group.key);
-    if (items.length === 0) continue;
-    out.write(`  ${group.label}\n`);
-    for (const c of items) {
-      const found = c.found ?? '—';
-      const expected = c.expected ? `  (${c.expected})` : '';
-      out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);
-      if (c.status !== 'ok' && c.hint) out.write(`      -> ${c.hint}\n`);
-    }
-  }
+  for (const group of GROUPS) {}
   out.write(report.ok ? '\n✔ environment ok\n\n' : '\n✘ environment has problems (see above)\n\n');
 }
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '\ncheckride doctor\n\n\n✔ environment…' to contain 'ENVIRONMENT'

[Killed] ConditionalExpression
src/doctor.ts:226:47
 function renderTable(report: DoctorReport, out: Out): void {
   out.write('\ncheckride doctor\n\n');
   for (const group of GROUPS) {
-    const items = report.checks.filter((c) => c.category === group.key);
+    const items = report.checks.filter((c) => false);
     if (items.length === 0) continue;
     out.write(`  ${group.label}\n`);
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '\ncheckride doctor\n\n\n✔ environment…' to contain 'ENVIRONMENT'

[Killed] ArrowFunction
src/doctor.ts:226:40
 function renderTable(report: DoctorReport, out: Out): void {
   out.write('\ncheckride doctor\n\n');
   for (const group of GROUPS) {
-    const items = report.checks.filter((c) => c.category === group.key);
+    const items = report.checks.filter(() => undefined);
     if (items.length === 0) continue;
     out.write(`  ${group.label}\n`);
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '\ncheckride doctor\n\n\n✔ environment…' to contain 'ENVIRONMENT'

[Killed] EqualityOperator
src/doctor.ts:227:9
   out.write('\ncheckride doctor\n\n');
   for (const group of GROUPS) {
     const items = report.checks.filter((c) => c.category === group.key);
-    if (items.length === 0) continue;
+    if (items.length !== 0) continue;
     out.write(`  ${group.label}\n`);
     for (const c of items) {
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '\ncheckride doctor\n\n\n✔ environment…' to contain 'ENVIRONMENT'

[Killed] ConditionalExpression
src/doctor.ts:227:9
   out.write('\ncheckride doctor\n\n');
   for (const group of GROUPS) {
     const items = report.checks.filter((c) => c.category === group.key);
-    if (items.length === 0) continue;
+    if (true) continue;
     out.write(`  ${group.label}\n`);
     for (const c of items) {
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '\ncheckride doctor\n\n\n✔ environment…' to contain 'ENVIRONMENT'

[Survived] BlockStatement
src/doctor.ts:229:28
     const items = report.checks.filter((c) => c.category === group.key);
     if (items.length === 0) continue;
     out.write(`  ${group.label}\n`);
-    for (const c of items) {
-      const found = c.found ?? '—';
-      const expected = c.expected ? `  (${c.expected})` : '';
-      out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);
-      if (c.status !== 'ok' && c.hint) out.write(`      -> ${c.hint}\n`);
-    }
+    for (const c of items) {}
   }
   out.write(report.ok ? '\n✔ environment ok\n\n' : '\n✘ environment has problems (see above)\n\n');

[Survived] LogicalOperator
src/doctor.ts:230:21
     if (items.length === 0) continue;
     out.write(`  ${group.label}\n`);
     for (const c of items) {
-      const found = c.found ?? '—';
+      const found = c.found && '—';
       const expected = c.expected ? `  (${c.expected})` : '';
       out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);

[Survived] ConditionalExpression
src/doctor.ts:233:11
       const found = c.found ?? '—';
       const expected = c.expected ? `  (${c.expected})` : '';
       out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);
-      if (c.status !== 'ok' && c.hint) out.write(`      -> ${c.hint}\n`);
+      if (false) out.write(`      -> ${c.hint}\n`);
     }
   }

[Survived] LogicalOperator
src/doctor.ts:233:11
       const found = c.found ?? '—';
       const expected = c.expected ? `  (${c.expected})` : '';
       out.write(`  ${statusMark(c.status)} ${c.name.padEnd(22)} ${found}${expected}\n`);
-      if (c.status !== 'ok' && c.hint) out.write(`      -> ${c.hint}\n`);
+      if (c.status !== 'ok' || c.hint) out.write(`      -> ${c.hint}\n`);
     }
   }

[Killed] LogicalOperator
src/doctor.ts:241:15
 
 /** Run the doctor against `cwd`; render and return the report. */
 export async function runDoctor(options: DoctorOptions): Promise<DoctorResult> {
-  const cwd = options.cwd ?? process.cwd();
+  const cwd = options.cwd && process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
killedBy: runDoctor (real env, gutted project) reports missing tools for a project with no node_modules
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/doctor.ts:242:17
 /** Run the doctor against `cwd`; render and return the report. */
 export async function runDoctor(options: DoctorOptions): Promise<DoctorResult> {
   const cwd = options.cwd ?? process.cwd();
-  const slots = options.slots ?? SLOTS;
+  const slots = options.slots && SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/doctor.ts:243:20
 export async function runDoctor(options: DoctorOptions): Promise<DoctorResult> {
   const cwd = options.cwd ?? process.cwd();
   const slots = options.slots ?? SLOTS;
-  const adapters = options.adapters ?? ADAPTERS;
+  const adapters = options.adapters && ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Survived] EqualityOperator
src/doctor.ts:244:18
   const cwd = options.cwd ?? process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
-  const config = options.config !== undefined ? options.config : loadConfig(cwd);
+  const config = options.config === undefined ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
   const env = options.env ?? realEnv;

[Survived] ConditionalExpression
src/doctor.ts:244:18
   const cwd = options.cwd ?? process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
-  const config = options.config !== undefined ? options.config : loadConfig(cwd);
+  const config = true ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
   const env = options.env ?? realEnv;

[Killed] LogicalOperator
src/doctor.ts:245:18
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
-  const stdout = options.stdout ?? process.stdout;
+  const stdout = options.stdout && process.stdout;
   const env = options.env ?? realEnv;
   const json = options.json ?? false;
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '' to contain 'checkride doctor'

[Killed] LogicalOperator
src/doctor.ts:246:15
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
-  const env = options.env ?? realEnv;
+  const env = options.env && realEnv;
   const json = options.json ?? false;
 
killedBy: runCli dispatch doctor exits 0 on this healthy, installed project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/doctor.ts:247:32
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
   const env = options.env ?? realEnv;
-  const json = options.json ?? false;
+  const json = options.json ?? true;
 
   const engines = env.readEngines(cwd);
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '{\n  "ok": true,\n  "platform": {\n  …' to contain 'checkride doctor'

[Survived] LogicalOperator
src/doctor.ts:247:16
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stdout = options.stdout ?? process.stdout;
   const env = options.env ?? realEnv;
-  const json = options.json ?? false;
+  const json = options.json && false;
 
   const engines = env.readEngines(cwd);

[Killed] LogicalOperator
src/doctor.ts:250:19
   const json = options.json ?? false;
 
   const engines = env.readEngines(cwd);
-  const nodeMin = parseSemver(engines.node) ?? { major: 24, minor: 0, patch: 0, raw: '24.0.0' };
+  const nodeMin = parseSemver(engines.node) && {
+  major: 24,
+  minor: 0,
+  patch: 0,
+  raw: '24.0.0'
+};
   const pnpmMin = parseSemver(engines.pnpm) ?? { major: 9, minor: 0, patch: 0, raw: '9.0.0' };
 
killedBy: runDoctor (real env, gutted project) reports missing tools for a project with no node_modules
statusReason: Cannot read properties of null (reading 'major')
