[Killed] LogicalOperator
src/doctor.ts:251:19
 
   const engines = env.readEngines(cwd);
   const nodeMin = parseSemver(engines.node) ?? { major: 24, minor: 0, patch: 0, raw: '24.0.0' };
-  const pnpmMin = parseSemver(engines.pnpm) ?? { major: 9, minor: 0, patch: 0, raw: '9.0.0' };
+  const pnpmMin = parseSemver(engines.pnpm) && {
+  major: 9,
+  minor: 0,
+  patch: 0,
+  raw: '9.0.0'
+};
 
   const checks: DoctorCheck[] = [
killedBy: runDoctor (real env, gutted project) reports missing tools for a project with no node_modules
statusReason: Cannot read properties of null (reading 'major')

[Survived] ObjectLiteral
src/doctor.ts:251:48
 
   const engines = env.readEngines(cwd);
   const nodeMin = parseSemver(engines.node) ?? { major: 24, minor: 0, patch: 0, raw: '24.0.0' };
-  const pnpmMin = parseSemver(engines.pnpm) ?? { major: 9, minor: 0, patch: 0, raw: '9.0.0' };
+  const pnpmMin = parseSemver(engines.pnpm) ?? {};
 
   const checks: DoctorCheck[] = [

[Killed] BooleanLiteral
src/doctor.ts:262:72
 
   // Verify the tools the default run uses (opt-in slots are excluded unless run).
   const resolved = resolveChecks({ slots, adapters, config, cwd });
-  const active = selectChecks(resolved, {}).filter((r) => r.adapter && !r.skip);
+  const active = selectChecks(resolved, {}).filter((r) => r.adapter && r.skip);
   for (const r of active) {
     if (r.adapter) checks.push(await checkTool(r.adapter, cwd, env));
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected [ 'node', 'pnpm', 'git', …(2) ] to include 'oxlint (lint)'

[Killed] ConditionalExpression
src/doctor.ts:262:59
 
   // Verify the tools the default run uses (opt-in slots are excluded unless run).
   const resolved = resolveChecks({ slots, adapters, config, cwd });
-  const active = selectChecks(resolved, {}).filter((r) => r.adapter && !r.skip);
+  const active = selectChecks(resolved, {}).filter((r) => false);
   for (const r of active) {
     if (r.adapter) checks.push(await checkTool(r.adapter, cwd, env));
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected [ 'node', 'pnpm', 'git', …(2) ] to include 'oxlint (lint)'

[Killed] BlockStatement
src/doctor.ts:263:27
   // Verify the tools the default run uses (opt-in slots are excluded unless run).
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const active = selectChecks(resolved, {}).filter((r) => r.adapter && !r.skip);
-  for (const r of active) {
-    if (r.adapter) checks.push(await checkTool(r.adapter, cwd, env));
-  }
+  for (const r of active) {}
 
   checks.push(await checkWritable(cwd, env));
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected [ 'node', 'pnpm', 'git', …(2) ] to include 'oxlint (lint)'

[Killed] ConditionalExpression
src/doctor.ts:264:9
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const active = selectChecks(resolved, {}).filter((r) => r.adapter && !r.skip);
   for (const r of active) {
-    if (r.adapter) checks.push(await checkTool(r.adapter, cwd, env));
+    if (false) checks.push(await checkTool(r.adapter, cwd, env));
   }
 
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected [ 'node', 'pnpm', 'git', …(2) ] to include 'oxlint (lint)'

[Survived] ConditionalExpression
src/doctor.ts:264:9
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const active = selectChecks(resolved, {}).filter((r) => r.adapter && !r.skip);
   for (const r of active) {
-    if (r.adapter) checks.push(await checkTool(r.adapter, cwd, env));
+    if (true) checks.push(await checkTool(r.adapter, cwd, env));
   }
 

[Killed] ArrowFunction
src/doctor.ts:269:27
 
   checks.push(await checkWritable(cwd, env));
 
-  const ok = checks.every((c) => !c.required || c.status === 'ok');
+  const ok = checks.every(() => undefined);
   const report: DoctorReport = { ok, platform: env.platform(), checks };
 
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/doctor.ts:269:14
 
   checks.push(await checkWritable(cwd, env));
 
-  const ok = checks.every((c) => !c.required || c.status === 'ok');
+  const ok = checks.some(c => !c.required || c.status === 'ok');
   const report: DoctorReport = { ok, platform: env.platform(), checks };
 
killedBy: runDoctor (injected env) a missing tool binary -> missing, exit 1
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/doctor.ts:270:32
   checks.push(await checkWritable(cwd, env));
 
   const ok = checks.every((c) => !c.required || c.status === 'ok');
-  const report: DoctorReport = { ok, platform: env.platform(), checks };
+  const report: DoctorReport = {};
 
   if (json) {
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/doctor.ts:272:7
   const ok = checks.every((c) => !c.required || c.status === 'ok');
   const report: DoctorReport = { ok, platform: env.platform(), checks };
 
-  if (json) {
+  if (true) {
     stdout.write(`${JSON.stringify(report, null, 2)}\n`);
   } else {
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '{\n  "ok": true,\n  "platform": {\n  …' to contain 'checkride doctor'

[Survived] ConditionalExpression
src/doctor.ts:272:7
   const ok = checks.every((c) => !c.required || c.status === 'ok');
   const report: DoctorReport = { ok, platform: env.platform(), checks };
 
-  if (json) {
+  if (false) {
     stdout.write(`${JSON.stringify(report, null, 2)}\n`);
   } else {

[Killed] BlockStatement
src/doctor.ts:274:10
 
   if (json) {
     stdout.write(`${JSON.stringify(report, null, 2)}\n`);
-  } else {
-    renderTable(report, stdout);
-  }
+  } else {}
 
   return { ok, report, exitCode: ok ? 0 : 1 };
killedBy: runDoctor (injected env) renders a human table when not --json
statusReason: expected '' to contain 'checkride doctor'

[Killed] ObjectLiteral
src/doctor.ts:278:10
     renderTable(report, stdout);
   }
 
-  return { ok, report, exitCode: ok ? 0 : 1 };
+  return {};
 }
 
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: expected undefined to be true // Object.is equality
