[Survived] ArrowFunction
src/init.ts:54:32
   exitCode: number;
 };
 
-const NULL_OUT: Out = { write: () => true };
+const NULL_OUT: Out = { write: () => undefined };
 
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */

[NoCoverage] BooleanLiteral
src/init.ts:54:38
   exitCode: number;
 };
 
-const NULL_OUT: Out = { write: () => true };
+const NULL_OUT: Out = { write: () => false };
 
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */

[NoCoverage] BlockStatement
src/init.ts:57:78
 const NULL_OUT: Out = { write: () => true };
 
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */
-async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
-  if (slots.length === 0) return [];
-  const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
-  return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);
-}
+async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {}
 
 export type InventoryEntry = { slot: string; status: 'adopted' | 'empty'; adapter: string | null };

[NoCoverage] ConditionalExpression
src/init.ts:58:7
 
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */
 async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
-  if (slots.length === 0) return [];
+  if (false) return [];
   const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
   return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);

[NoCoverage] ConditionalExpression
src/init.ts:58:7
 
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */
 async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
-  if (slots.length === 0) return [];
+  if (true) return [];
   const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
   return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);

[NoCoverage] BooleanLiteral
src/init.ts:59:65
 /** Run the adopted checks once; a failing (non-skipped) check marks its slot. */
 async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
   if (slots.length === 0) return [];
-  const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
+  const { summary } = await runChecks({ cwd, only: slots, json: false, stdout: NULL_OUT, stderr: NULL_OUT });
   return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);
 }

[NoCoverage] EqualityOperator
src/init.ts:60:48
 async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
   if (slots.length === 0) return [];
   const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
-  return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);
+  return summary.checks.filter((c) => !c.ok && c.skipped === true).map((c) => c.name);
 }
 

[NoCoverage] ArrowFunction
src/init.ts:60:32
 async function defaultProbe(slots: string[], cwd: string): Promise<string[]> {
   if (slots.length === 0) return [];
   const { summary } = await runChecks({ cwd, only: slots, json: true, stdout: NULL_OUT, stderr: NULL_OUT });
-  return summary.checks.filter((c) => !c.ok && c.skipped !== true).map((c) => c.name);
+  return summary.checks.filter(() => undefined).map((c) => c.name);
 }
 

[Killed] BlockStatement
src/init.ts:75:44
 // AGENTS.md stanza (gate: idempotent)
 // ----------------------------------------------------------------------------
 
-function escapeRegex(text: string): string {
-  return text.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-}
+function escapeRegex(text: string): string {}
 
 /** The agent-facing contract block, parameterized by the active checks. */
killedBy: AGENTS stanza (idempotency) applying twice is a no-op (refresh in place)
statusReason: expected '# AGENTS.md\n\nintro\n\n<!-- checkrid…' to be '# AGENTS.md\n\nintro\n\n<!-- checkrid…' // Object.is equality

[Killed] Regex
src/init.ts:76:23
 // ----------------------------------------------------------------------------
 
 function escapeRegex(text: string): string {
-  return text.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return text.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&');
 }
 
killedBy: AGENTS stanza (idempotency) applying twice is a no-op (refresh in place)
statusReason: expected '# AGENTS.md\n\nintro\n\n<!-- checkrid…' to be '# AGENTS.md\n\nintro\n\n<!-- checkrid…' // Object.is equality

[Killed] BlockStatement
src/init.ts:111:68
  * Insert or refresh the checkride stanza in an AGENTS.md body. Idempotent:
  * applying twice yields identical output.
  */
-export function applyStanza(content: string, body: string): string {
-  const block = `${STANZA_BEGIN}\n\n${body}\n\n${STANZA_END}`;
-  const re = new RegExp(`${escapeRegex(STANZA_BEGIN)}[\\s\\S]*?${escapeRegex(STANZA_END)}`);
-  if (re.test(content)) {
-    return content.replace(re, block);
-  }
-  if (content.trim().length === 0) {
-    return `${block}\n`;
-  }
-  return `${content.replace(/\s*$/, '')}\n\n${block}\n`;
-}
+export function applyStanza(content: string, body: string): string {}
 
 // ----------------------------------------------------------------------------
killedBy: runCli init generates a new flat project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/init.ts:114:25
 export function applyStanza(content: string, body: string): string {
   const block = `${STANZA_BEGIN}\n\n${body}\n\n${STANZA_END}`;
   const re = new RegExp(`${escapeRegex(STANZA_BEGIN)}[\\s\\S]*?${escapeRegex(STANZA_END)}`);
-  if (re.test(content)) {
-    return content.replace(re, block);
-  }
+  if (re.test(content)) {}
   if (content.trim().length === 0) {
     return `${block}\n`;
killedBy: AGENTS stanza (idempotency) applying twice is a no-op (refresh in place)
statusReason: expected '# AGENTS.md\n\nintro\n\n<!-- checkrid…' to be '# AGENTS.md\n\nintro\n\n<!-- checkrid…' // Object.is equality

[Killed] ConditionalExpression
src/init.ts:114:7
 export function applyStanza(content: string, body: string): string {
   const block = `${STANZA_BEGIN}\n\n${body}\n\n${STANZA_END}`;
   const re = new RegExp(`${escapeRegex(STANZA_BEGIN)}[\\s\\S]*?${escapeRegex(STANZA_END)}`);
-  if (re.test(content)) {
+  if (false) {
     return content.replace(re, block);
   }
killedBy: AGENTS stanza (idempotency) applying twice is a no-op (refresh in place)
statusReason: expected '# AGENTS.md\n\nintro\n\n<!-- checkrid…' to be '# AGENTS.md\n\nintro\n\n<!-- checkrid…' // Object.is equality

[Killed] BlockStatement
src/init.ts:117:36
   if (re.test(content)) {
     return content.replace(re, block);
   }
-  if (content.trim().length === 0) {
-    return `${block}\n`;
-  }
+  if (content.trim().length === 0) {}
   return `${content.replace(/\s*$/, '')}\n\n${block}\n`;
 }
killedBy: AGENTS stanza (idempotency) creates a body when content is empty
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/init.ts:117:7
   if (re.test(content)) {
     return content.replace(re, block);
   }
-  if (content.trim().length === 0) {
+  if (content.trim().length !== 0) {
     return `${block}\n`;
   }
killedBy: AGENTS stanza (idempotency) inserts a stanza into existing content
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/init.ts:120:29
   if (content.trim().length === 0) {
     return `${block}\n`;
   }
-  return `${content.replace(/\s*$/, '')}\n\n${block}\n`;
+  return `${content.replace(/\s$/, '')}\n\n${block}\n`;
 }
 

[Killed] BlockStatement
src/init.ts:133:22
   slots?: readonly Slot[];
   adapters?: readonly Adapter[];
   fileExists?: (file: string) => boolean;
-}): InventoryEntry[] {
-  const slots = (input.slots ?? SLOTS).filter((s) => !s.optIn);
-  const resolved = resolveChecks({
-    slots,
-    adapters: input.adapters ?? ADAPTERS,
-    config: null,
-    ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
-    ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
-  });
-  return resolved.map((r) => ({
-    slot: r.slot,
-    status: r.adapter ? 'adopted' : 'empty',
-    adapter: r.adapter?.name ?? null,
-  }));
-}
+}): InventoryEntry[] {}
 
 // ----------------------------------------------------------------------------
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
src/init.ts:134:54
   adapters?: readonly Adapter[];
   fileExists?: (file: string) => boolean;
 }): InventoryEntry[] {
-  const slots = (input.slots ?? SLOTS).filter((s) => !s.optIn);
+  const slots = (input.slots ?? SLOTS).filter((s) => s.optIn);
   const resolved = resolveChecks({
     slots,
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: expected undefined to match object { status: 'adopted', adapter: 'tsc' }

[Killed] LogicalOperator
src/init.ts:134:18
   adapters?: readonly Adapter[];
   fileExists?: (file: string) => boolean;
 }): InventoryEntry[] {
-  const slots = (input.slots ?? SLOTS).filter((s) => !s.optIn);
+  const slots = (input.slots && SLOTS).filter((s) => !s.optIn);
   const resolved = resolveChecks({
     slots,
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] LogicalOperator
src/init.ts:137:15
   const slots = (input.slots ?? SLOTS).filter((s) => !s.optIn);
   const resolved = resolveChecks({
     slots,
-    adapters: input.adapters ?? ADAPTERS,
+    adapters: input.adapters && ADAPTERS,
     config: null,
     ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: adapters is not iterable

[Survived] ConditionalExpression
src/init.ts:139:9
     slots,
     adapters: input.adapters ?? ADAPTERS,
     config: null,
-    ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
+    ...(false ? { cwd: input.cwd } : {}),
     ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
   });

[Survived] EqualityOperator
src/init.ts:139:9
     slots,
     adapters: input.adapters ?? ADAPTERS,
     config: null,
-    ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
+    ...(input.cwd === undefined ? { cwd: input.cwd } : {}),
     ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
   });

[Killed] EqualityOperator
src/init.ts:140:9
     adapters: input.adapters ?? ADAPTERS,
     config: null,
     ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
-    ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
+    ...(input.fileExists === undefined ? { fileExists: input.fileExists } : {}),
   });
   return resolved.map((r) => ({
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: expected { slot: 'lint', …(2) } to match object { status: 'adopted', adapter: 'biome' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/init.ts:140:9
     adapters: input.adapters ?? ADAPTERS,
     config: null,
     ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
-    ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
+    ...(false ? { fileExists: input.fileExists } : {}),
   });
   return resolved.map((r) => ({
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: expected { slot: 'lint', …(2) } to match object { status: 'adopted', adapter: 'biome' }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/init.ts:142:23
     ...(input.cwd !== undefined ? { cwd: input.cwd } : {}),
     ...(input.fileExists !== undefined ? { fileExists: input.fileExists } : {}),
   });
-  return resolved.map((r) => ({
-    slot: r.slot,
-    status: r.adapter ? 'adopted' : 'empty',
-    adapter: r.adapter?.name ?? null,
-  }));
+  return resolved.map(() => undefined);
 }
 
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] OptionalChaining
src/init.ts:145:14
   return resolved.map((r) => ({
     slot: r.slot,
     status: r.adapter ? 'adopted' : 'empty',
-    adapter: r.adapter?.name ?? null,
+    adapter: r.adapter.name ?? null,
   }));
 }
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: Cannot read properties of null (reading 'name')

[Killed] LogicalOperator
src/init.ts:145:14
   return resolved.map((r) => ({
     slot: r.slot,
     status: r.adapter ? 'adopted' : 'empty',
-    adapter: r.adapter?.name ?? null,
+    adapter: r.adapter?.name && null,
   }));
 }
killedBy: adoption inventory reports adopted vs empty per default slot
statusReason: expected { slot: 'types', …(2) } to match object { status: 'adopted', adapter: 'tsc' }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/init.ts:153:44
 // Generation helpers
 // ----------------------------------------------------------------------------
 
-function readTemplate(rel: string): string {
-  return readFileSync(join(TEMPLATES_DIR, rel), 'utf8');
-}
+function readTemplate(rel: string): string {}
 
 function render(text: string, vars: Record<string, string>): string {
killedBy: runCli init generates a new flat project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/init.ts:157:69
   return readFileSync(join(TEMPLATES_DIR, rel), 'utf8');
 }
 
-function render(text: string, vars: Record<string, string>): string {
-  return text.replace(/\{\{(\w+)\}\}/g, (_m, key: string) => vars[key] ?? '');
-}
+function render(text: string, vars: Record<string, string>): string {}
 
 function constName(name: string): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] LogicalOperator
src/init.ts:158:62
 }
 
 function render(text: string, vars: Record<string, string>): string {
-  return text.replace(/\{\{(\w+)\}\}/g, (_m, key: string) => vars[key] ?? '');
+  return text.replace(/\{\{(\w+)\}\}/g, (_m, key: string) => vars[key] && '');
 }
 
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: expected '{\n  "files": [],\n  "references": [\…' to contain './apps/demo'

[Killed] ArrowFunction
src/init.ts:158:41
 }
 
 function render(text: string, vars: Record<string, string>): string {
-  return text.replace(/\{\{(\w+)\}\}/g, (_m, key: string) => vars[key] ?? '');
+  return text.replace(/\{\{(\w+)\}\}/g, () => undefined);
 }
 
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: expected '{\n  "files": [],\n  "references": [\…' to contain './apps/demo'

[Killed] BlockStatement
src/init.ts:161:42
   return text.replace(/\{\{(\w+)\}\}/g, (_m, key: string) => vars[key] ?? '');
 }
 
-function constName(name: string): string {
-  const id = name.toUpperCase().replace(/[^A-Z0-9]+/g, '_').replace(/^_+|_+$/g, '');
-  return id.length > 0 ? id : 'APP';
-}
+function constName(name: string): string {}
 
 function productVersion(): string {
killedBy: new-project generation (flat) the generated smoke test asserts on the module constant
statusReason: expected 'export const undefined = \'my-app\';\n' to contain 'export const MY_APP = \'my-app\';'

[Killed] MethodExpression
src/init.ts:162:14
 }
 
 function constName(name: string): string {
-  const id = name.toUpperCase().replace(/[^A-Z0-9]+/g, '_').replace(/^_+|_+$/g, '');
+  const id = name.toLowerCase().replace(/[^A-Z0-9]+/g, '_').replace(/^_+|_+$/g, '');
   return id.length > 0 ? id : 'APP';
 }
killedBy: new-project generation (flat) the generated smoke test asserts on the module constant
statusReason: expected 'export const APP = \'my-app\';\n' to contain 'export const MY_APP = \'my-app\';'

[Killed] ConditionalExpression
src/init.ts:163:10
 
 function constName(name: string): string {
   const id = name.toUpperCase().replace(/[^A-Z0-9]+/g, '_').replace(/^_+|_+$/g, '');
-  return id.length > 0 ? id : 'APP';
+  return false ? id : 'APP';
 }
 
killedBy: new-project generation (flat) the generated smoke test asserts on the module constant
statusReason: expected 'export const APP = \'my-app\';\n' to contain 'export const MY_APP = \'my-app\';'

[Killed] EqualityOperator
src/init.ts:163:10
 
 function constName(name: string): string {
   const id = name.toUpperCase().replace(/[^A-Z0-9]+/g, '_').replace(/^_+|_+$/g, '');
-  return id.length > 0 ? id : 'APP';
+  return id.length <= 0 ? id : 'APP';
 }
 
killedBy: new-project generation (flat) the generated smoke test asserts on the module constant
statusReason: expected 'export const APP = \'my-app\';\n' to contain 'export const MY_APP = \'my-app\';'

[Survived] BlockStatement
src/init.ts:166:35
   return id.length > 0 ? id : 'APP';
 }
 
-function productVersion(): string {
-  try {
-    const raw = readFileSync(join(TEMPLATES_DIR, '..', 'package.json'), 'utf8');
-    const pkg: { version?: string } = JSON.parse(raw);
-    return pkg.version ?? '0.1.0';
-  } catch {
-    return '0.1.0';
-  }
-}
+function productVersion(): string {}
 
 function collectDevDeps(

[Survived] BlockStatement
src/init.ts:167:7
 }
 
 function productVersion(): string {
-  try {
-    const raw = readFileSync(join(TEMPLATES_DIR, '..', 'package.json'), 'utf8');
-    const pkg: { version?: string } = JSON.parse(raw);
-    return pkg.version ?? '0.1.0';
-  } catch {
+  try {} catch {
     return '0.1.0';
   }

[Survived] LogicalOperator
src/init.ts:170:12
   try {
     const raw = readFileSync(join(TEMPLATES_DIR, '..', 'package.json'), 'utf8');
     const pkg: { version?: string } = JSON.parse(raw);
-    return pkg.version ?? '0.1.0';
+    return pkg.version && '0.1.0';
   } catch {
     return '0.1.0';

[NoCoverage] BlockStatement
src/init.ts:171:11
     const raw = readFileSync(join(TEMPLATES_DIR, '..', 'package.json'), 'utf8');
     const pkg: { version?: string } = JSON.parse(raw);
     return pkg.version ?? '0.1.0';
-  } catch {
-    return '0.1.0';
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/init.ts:180:27
   adapters: readonly Adapter[],
   slots: readonly Slot[],
   checkrideSpec: string,
-): Record<string, string> {
-  const deps: Record<string, string> = {};
-  for (const slot of slots) {
-    if (slot.optIn) continue;
-    const adapter = adapters.find((a) => a.slot === slot.name);
-    if (adapter) Object.assign(deps, adapter.devDeps);
-  }
-  deps['checkride'] = checkrideSpec;
-  const sorted: Record<string, string> = {};
-  for (const key of Object.keys(deps).toSorted()) sorted[key] = deps[key] ?? '';
-  return sorted;
-}
+): Record<string, string> {}
 
 function rootPackageJson(
killedBy: new-project generation (flat) writes a complete flat project
statusReason: Cannot read properties of undefined (reading 'checkride')

[Killed] BlockStatement
src/init.ts:182:29
   checkrideSpec: string,
 ): Record<string, string> {
   const deps: Record<string, string> = {};
-  for (const slot of slots) {
-    if (slot.optIn) continue;
-    const adapter = adapters.find((a) => a.slot === slot.name);
-    if (adapter) Object.assign(deps, adapter.devDeps);
-  }
+  for (const slot of slots) {}
   deps['checkride'] = checkrideSpec;
   const sorted: Record<string, string> = {};
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/init.ts:183:9
 ): Record<string, string> {
   const deps: Record<string, string> = {};
   for (const slot of slots) {
-    if (slot.optIn) continue;
+    if (true) continue;
     const adapter = adapters.find((a) => a.slot === slot.name);
     if (adapter) Object.assign(deps, adapter.devDeps);
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/init.ts:183:9
 ): Record<string, string> {
   const deps: Record<string, string> = {};
   for (const slot of slots) {
-    if (slot.optIn) continue;
+    if (false) continue;
     const adapter = adapters.find((a) => a.slot === slot.name);
     if (adapter) Object.assign(deps, adapter.devDeps);

[Killed] ConditionalExpression
src/init.ts:184:42
   const deps: Record<string, string> = {};
   for (const slot of slots) {
     if (slot.optIn) continue;
-    const adapter = adapters.find((a) => a.slot === slot.name);
+    const adapter = adapters.find((a) => false);
     if (adapter) Object.assign(deps, adapter.devDeps);
   }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/init.ts:184:42
   const deps: Record<string, string> = {};
   for (const slot of slots) {
     if (slot.optIn) continue;
-    const adapter = adapters.find((a) => a.slot === slot.name);
+    const adapter = adapters.find((a) => true);
     if (adapter) Object.assign(deps, adapter.devDeps);
   }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/init.ts:185:9
   for (const slot of slots) {
     if (slot.optIn) continue;
     const adapter = adapters.find((a) => a.slot === slot.name);
-    if (adapter) Object.assign(deps, adapter.devDeps);
+    if (false) Object.assign(deps, adapter.devDeps);
   }
   deps['checkride'] = checkrideSpec;
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/init.ts:185:9
   for (const slot of slots) {
     if (slot.optIn) continue;
     const adapter = adapters.find((a) => a.slot === slot.name);
-    if (adapter) Object.assign(deps, adapter.devDeps);
+    if (true) Object.assign(deps, adapter.devDeps);
   }
   deps['checkride'] = checkrideSpec;

[Killed] LogicalOperator
src/init.ts:189:65
   }
   deps['checkride'] = checkrideSpec;
   const sorted: Record<string, string> = {};
-  for (const key of Object.keys(deps).toSorted()) sorted[key] = deps[key] ?? '';
+  for (const key of Object.keys(deps).toSorted()) sorted[key] = deps[key] && '';
   return sorted;
 }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected '' to be '^0.1.0' // Object.is equality

[Survived] BooleanLiteral
src/init.ts:207:32
     license,
     ...(author ? { author } : {}),
     type: 'module',
-    ...(workspace ? { private: true } : {}),
+    ...(workspace ? { private: false } : {}),
     engines: { node: '>=24.0.0', pnpm: '>=9.0.0' },
     scripts: {

[Survived] ObjectLiteral
src/init.ts:207:21
     license,
     ...(author ? { author } : {}),
     type: 'module',
-    ...(workspace ? { private: true } : {}),
+    ...(workspace ? {} : {}),
     engines: { node: '>=24.0.0', pnpm: '>=9.0.0' },
     scripts: {

[Killed] BlockStatement
src/init.ts:227:50
   return `${JSON.stringify(pkg, null, 2)}\n`;
 }
 
-function packageJsonFor(pkgName: string): string {
-  const pkg = {
-    name: pkgName,
-    version: '0.0.0',
-    private: true,
-    type: 'module',
-    exports: { '.': './src/index.ts' },
-  };
-  return `${JSON.stringify(pkg, null, 2)}\n`;
-}
+function packageJsonFor(pkgName: string): string {}
 
 const PACKAGE_TSCONFIG = `${JSON.stringify(
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ObjectLiteral
src/init.ts:228:15
 }
 
 function packageJsonFor(pkgName: string): string {
-  const pkg = {
-    name: pkgName,
-    version: '0.0.0',
-    private: true,
-    type: 'module',
-    exports: { '.': './src/index.ts' },
-  };
+  const pkg = {};
   return `${JSON.stringify(pkg, null, 2)}\n`;
 }
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: expected undefined to be '@demo/demo' // Object.is equality

[Survived] BooleanLiteral
src/init.ts:231:14
   const pkg = {
     name: pkgName,
     version: '0.0.0',
-    private: true,
+    private: false,
     type: 'module',
     exports: { '.': './src/index.ts' },

[Survived] ArrayDeclaration
src/init.ts:242:14
   {
     extends: '../../tsconfig.base.json',
     compilerOptions: { rootDir: './src', outDir: './dist' },
-    include: ['src/**/*'],
+    include: [],
     exclude: ['dist', 'node_modules'],
   },

[Killed] BlockStatement
src/init.ts:249:46
   2,
 )}\n`;
 
-function sourceModule(value: string): string {
-  const id = constName(value);
-  return `export const ${id} = '${value}';\n`;
-}
+function sourceModule(value: string): string {}
 
 function smokeTest(value: string): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/init.ts:254:43
   return `export const ${id} = '${value}';\n`;
 }
 
-function smokeTest(value: string): string {
-  const id = constName(value);
-  return [
-    "import { expect, test } from 'vitest';",
-    '',
-    "import { " + id + " } from './index.js';",
-    '',
-    `test('${value} smoke', () => {`,
-    `  expect(${id}).toBe('${value}');`,
-    '});',
-    '',
-  ].join('\n');
-}
+function smokeTest(value: string): string {}
 
 function readme(name: string): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/init.ts:268:39
   ].join('\n');
 }
 
-function readme(name: string): string {
-  return [
-    `# ${name}`,
-    '',
-    'A TypeScript project verified by checkride.',
-    '',
-    '```bash',
-    'pnpm check        # run the full pipeline; exit 0 = done',
-    '```',
-    '',
-    'See [AGENTS.md](./AGENTS.md) for the contract agents follow in this repository.',
-    '',
-  ].join('\n');
-}
+function readme(name: string): string {}
 
 function claudeMd(): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/init.ts:283:29
   ].join('\n');
 }
 
-function claudeMd(): string {
-  return [
-    '# CLAUDE.md',
-    '',
-    'Claude Code-specific notes. See [AGENTS.md](./AGENTS.md) for the full contract.',
-    '',
-  ].join('\n');
-}
+function claudeMd(): string {}
 
 function agentsMd(activeSlots: readonly string[]): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
src/init.ts:292:59
   ].join('\n');
 }
 
-function agentsMd(activeSlots: readonly string[]): string {
-  const intro = ['# AGENTS.md', '', 'Instructions for any coding agent working in this repository.', ''].join('\n');
-  return applyStanza(intro, buildStanza(activeSlots));
-}
+function agentsMd(activeSlots: readonly string[]): string {}
 
 const MIT = (year: number, holder: string): string =>
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ArrowFunction
src/init.ts:297:13
   return applyStanza(intro, buildStanza(activeSlots));
 }
 
-const MIT = (year: number, holder: string): string =>
-  [
-    'MIT License',
-    '',
-    `Copyright (c) ${year} ${holder}`,
-    '',
-    'Permission is hereby granted, free of charge, to any person obtaining a copy',
-    'of this software and associated documentation files (the "Software"), to deal',
-    'in the Software without restriction, including without limitation the rights',
-    'to use, copy, modify, merge, publish, distribute, sublicense, and/or sell',
-    'copies of the Software, and to permit persons to whom the Software is',
-    'furnished to do so, subject to the following conditions:',
-    '',
-    'The above copyright notice and this permission notice shall be included in all',
-    'copies or substantial portions of the Software.',
-    '',
-    'THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR',
-    'IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,',
-    'FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE',
-    'AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER',
-    'LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,',
-    'OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE',
-    'SOFTWARE.',
-    '',
-  ].join('\n');
+const MIT = () => undefined;
 
 function licenseText(license: string, holder: string): string {
killedBy: runCli init generates a new flat project
statusReason: expected 2 to be +0 // Object.is equality
