[Killed] BlockStatement
src/init.ts:323:63
     '',
   ].join('\n');
 
-function licenseText(license: string, holder: string): string {
-  const year = new Date().getFullYear();
-  if (license === 'MIT') return MIT(year, holder);
-  return `${license} License\n\nCopyright (c) ${year} ${holder}\n`;
-}
+function licenseText(license: string, holder: string): string {}
 
 function cspellWithName(name: string, scope: string | null): string {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Survived] ConditionalExpression
src/init.ts:325:7
 
 function licenseText(license: string, holder: string): string {
   const year = new Date().getFullYear();
-  if (license === 'MIT') return MIT(year, holder);
+  if (true) return MIT(year, holder);
   return `${license} License\n\nCopyright (c) ${year} ${holder}\n`;
 }

[Survived] ConditionalExpression
src/init.ts:325:7
 
 function licenseText(license: string, holder: string): string {
   const year = new Date().getFullYear();
-  if (license === 'MIT') return MIT(year, holder);
+  if (false) return MIT(year, holder);
   return `${license} License\n\nCopyright (c) ${year} ${holder}\n`;
 }

[Killed] BlockStatement
src/init.ts:329:69
   return `${license} License\n\nCopyright (c) ${year} ${holder}\n`;
 }
 
-function cspellWithName(name: string, scope: string | null): string {
-  const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
-  const words = new Set(base.words ?? []);
-  for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
-    if (token.length > 1) words.add(token);
-  }
-  base.words = [...words].toSorted();
-  return `${JSON.stringify(base, null, 2)}\n`;
-}
+function cspellWithName(name: string, scope: string | null): string {}
 
 // ----------------------------------------------------------------------------
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Survived] LogicalOperator
src/init.ts:331:25
 
 function cspellWithName(name: string, scope: string | null): string {
   const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
-  const words = new Set(base.words ?? []);
+  const words = new Set(base.words && []);
   for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
     if (token.length > 1) words.add(token);

[Survived] BlockStatement
src/init.ts:332:72
 function cspellWithName(name: string, scope: string | null): string {
   const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
   const words = new Set(base.words ?? []);
-  for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
-    if (token.length > 1) words.add(token);
-  }
+  for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {}
   base.words = [...words].toSorted();
   return `${JSON.stringify(base, null, 2)}\n`;

[Survived] LogicalOperator
src/init.ts:332:34
 function cspellWithName(name: string, scope: string | null): string {
   const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
   const words = new Set(base.words ?? []);
-  for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
+  for (const token of `${name} ${scope && ''}`.split(/[^A-Za-z0-9]+/)) {
     if (token.length > 1) words.add(token);
   }

[Survived] EqualityOperator
src/init.ts:333:9
   const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
   const words = new Set(base.words ?? []);
   for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
-    if (token.length > 1) words.add(token);
+    if (token.length <= 1) words.add(token);
   }
   base.words = [...words].toSorted();

[Survived] ConditionalExpression
src/init.ts:333:9
   const base: { words?: string[] } & Record<string, unknown> = JSON.parse(readTemplate('shared/cspell.json'));
   const words = new Set(base.words ?? []);
   for (const token of `${name} ${scope ?? ''}`.split(/[^A-Za-z0-9]+/)) {
-    if (token.length > 1) words.add(token);
+    if (true) words.add(token);
   }
   base.words = [...words].toSorted();

[Killed] BlockStatement
src/init.ts:349:80
   written: string[];
 };
 
-async function put(w: Writer, relPath: string, content: string): Promise<void> {
-  w.written.push(relPath);
-  if (w.dryRun) return;
-  const target = join(w.cwd, relPath);
-  await mkdir(dirname(target), { recursive: true });
-  await writeFile(target, content);
-}
+async function put(w: Writer, relPath: string, content: string): Promise<void> {}
 
 async function writeSharedStatic(w: Writer): Promise<void> {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: package.json: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/init.ts:351:7
 
 async function put(w: Writer, relPath: string, content: string): Promise<void> {
   w.written.push(relPath);
-  if (w.dryRun) return;
+  if (false) return;
   const target = join(w.cwd, relPath);
   await mkdir(dirname(target), { recursive: true });
killedBy: new-project generation (flat) --dry-run writes nothing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/init.ts:351:7
 
 async function put(w: Writer, relPath: string, content: string): Promise<void> {
   w.written.push(relPath);
-  if (w.dryRun) return;
+  if (true) return;
   const target = join(w.cwd, relPath);
   await mkdir(dirname(target), { recursive: true });
killedBy: new-project generation (flat) writes a complete flat project
statusReason: package.json: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/init.ts:353:45
   w.written.push(relPath);
   if (w.dryRun) return;
   const target = join(w.cwd, relPath);
-  await mkdir(dirname(target), { recursive: true });
+  await mkdir(dirname(target), { recursive: false });
   await writeFile(target, content);
 }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: EEXIST: file already exists, mkdir '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-new-LjUTn8'

[Killed] BlockStatement
src/init.ts:357:60
   await writeFile(target, content);
 }
 
-async function writeSharedStatic(w: Writer): Promise<void> {
-  const map: [string, string][] = [
-    ['shared/tsconfig.base.json', 'tsconfig.base.json'],
-    ['shared/oxlintrc.json', '.oxlintrc.json'],
-    ['shared/markdownlint-cli2.jsonc', '.markdownlint-cli2.jsonc'],
-    ['shared/sgconfig.yml', 'sgconfig.yml'],
-    ['shared/vitest.config.ts.template', 'vitest.config.ts'],
-    ['shared/gitignore', '.gitignore'],
-    ['shared/npmrc', '.npmrc'],
-  ];
-  for (const [from, to] of map) await put(w, to, readTemplate(from));
-  for (const rule of ['no-class.yml', 'no-default-export.yml', 'no-deep-sibling-import.yml', 'require-js-extension.yml']) {
-    await put(w, join('rules', rule), readTemplate(join('shared', 'rules', rule)));
-  }
-}
+async function writeSharedStatic(w: Writer): Promise<void> {}
 
 async function writePackage(w: Writer, dir: string, pkgName: string, value: string): Promise<void> {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: tsconfig.base.json: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/init.ts:358:35
 }
 
 async function writeSharedStatic(w: Writer): Promise<void> {
-  const map: [string, string][] = [
-    ['shared/tsconfig.base.json', 'tsconfig.base.json'],
-    ['shared/oxlintrc.json', '.oxlintrc.json'],
-    ['shared/markdownlint-cli2.jsonc', '.markdownlint-cli2.jsonc'],
-    ['shared/sgconfig.yml', 'sgconfig.yml'],
-    ['shared/vitest.config.ts.template', 'vitest.config.ts'],
-    ['shared/gitignore', '.gitignore'],
-    ['shared/npmrc', '.npmrc'],
-  ];
+  const map: [string, string][] = [];
   for (const [from, to] of map) await put(w, to, readTemplate(from));
   for (const rule of ['no-class.yml', 'no-default-export.yml', 'no-deep-sibling-import.yml', 'require-js-extension.yml']) {
killedBy: new-project generation (flat) writes a complete flat project
statusReason: tsconfig.base.json: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/init.ts:360:5
 async function writeSharedStatic(w: Writer): Promise<void> {
   const map: [string, string][] = [
     ['shared/tsconfig.base.json', 'tsconfig.base.json'],
-    ['shared/oxlintrc.json', '.oxlintrc.json'],
+    [],
     ['shared/markdownlint-cli2.jsonc', '.markdownlint-cli2.jsonc'],
     ['shared/sgconfig.yml', 'sgconfig.yml'],
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ArrayDeclaration
src/init.ts:361:5
   const map: [string, string][] = [
     ['shared/tsconfig.base.json', 'tsconfig.base.json'],
     ['shared/oxlintrc.json', '.oxlintrc.json'],
-    ['shared/markdownlint-cli2.jsonc', '.markdownlint-cli2.jsonc'],
+    [],
     ['shared/sgconfig.yml', 'sgconfig.yml'],
     ['shared/vitest.config.ts.template', 'vitest.config.ts'],
killedBy: runCli init generates a new flat project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/init.ts:365:5
     ['shared/sgconfig.yml', 'sgconfig.yml'],
     ['shared/vitest.config.ts.template', 'vitest.config.ts'],
     ['shared/gitignore', '.gitignore'],
-    ['shared/npmrc', '.npmrc'],
+    [],
   ];
   for (const [from, to] of map) await put(w, to, readTemplate(from));
killedBy: new-project generation (flat) writes a complete flat project
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
src/init.ts:368:123
     ['shared/npmrc', '.npmrc'],
   ];
   for (const [from, to] of map) await put(w, to, readTemplate(from));
-  for (const rule of ['no-class.yml', 'no-default-export.yml', 'no-deep-sibling-import.yml', 'require-js-extension.yml']) {
-    await put(w, join('rules', rule), readTemplate(join('shared', 'rules', rule)));
-  }
+  for (const rule of ['no-class.yml', 'no-default-export.yml', 'no-deep-sibling-import.yml', 'require-js-extension.yml']) {}
 }
 
killedBy: new-project generation (flat) writes a complete flat project
statusReason: rules/no-class.yml: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/init.ts:368:22
     ['shared/npmrc', '.npmrc'],
   ];
   for (const [from, to] of map) await put(w, to, readTemplate(from));
-  for (const rule of ['no-class.yml', 'no-default-export.yml', 'no-deep-sibling-import.yml', 'require-js-extension.yml']) {
+  for (const rule of []) {
     await put(w, join('rules', rule), readTemplate(join('shared', 'rules', rule)));
   }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: rules/no-class.yml: expected false to be true // Object.is equality

[Killed] BlockStatement
src/init.ts:373:100
   }
 }
 
-async function writePackage(w: Writer, dir: string, pkgName: string, value: string): Promise<void> {
-  await put(w, join(dir, 'package.json'), packageJsonFor(pkgName));
-  await put(w, join(dir, 'tsconfig.json'), PACKAGE_TSCONFIG);
-  await put(w, join(dir, 'src', 'index.ts'), sourceModule(value));
-  await put(w, join(dir, 'src', 'index.test.ts'), smokeTest(value));
-}
+async function writePackage(w: Writer, dir: string, pkgName: string, value: string): Promise<void> {}
 
 // ----------------------------------------------------------------------------
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: apps/demo/src/index.ts: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/init.ts:387:24
 const DEFAULT_ACTIVE_SLOTS = ['types', 'lint', 'struct', 'dead', 'test', 'docs', 'links', 'spell'];
 
 async function initNew(options: InitOptions, cwd: string): Promise<InitResult> {
-  const shape: Shape = options.shape ?? 'flat';
+  const shape: Shape = options.shape && 'flat';
   const name = options.name ?? (basename(cwd) || 'app');
   const scope = options.scope ?? null;
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: expected 'flat' to be 'monorepo' // Object.is equality

[Killed] LogicalOperator
src/init.ts:388:16
 
 async function initNew(options: InitOptions, cwd: string): Promise<InitResult> {
   const shape: Shape = options.shape ?? 'flat';
-  const name = options.name ?? (basename(cwd) || 'app');
+  const name = options.name && (basename(cwd) || 'app');
   const scope = options.scope ?? null;
   const license = options.license ?? 'MIT';
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: apps/demo/src/index.ts: expected false to be true // Object.is equality

[NoCoverage] ConditionalExpression
src/init.ts:388:33
 
 async function initNew(options: InitOptions, cwd: string): Promise<InitResult> {
   const shape: Shape = options.shape ?? 'flat';
-  const name = options.name ?? (basename(cwd) || 'app');
+  const name = options.name ?? (true);
   const scope = options.scope ?? null;
   const license = options.license ?? 'MIT';

[Killed] LogicalOperator
src/init.ts:389:17
 async function initNew(options: InitOptions, cwd: string): Promise<InitResult> {
   const shape: Shape = options.shape ?? 'flat';
   const name = options.name ?? (basename(cwd) || 'app');
-  const scope = options.scope ?? null;
+  const scope = options.scope && null;
   const license = options.license ?? 'MIT';
   const author = options.author ?? null;
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: expected 'demo' to be '@demo/demo' // Object.is equality

[Survived] LogicalOperator
src/init.ts:390:19
   const shape: Shape = options.shape ?? 'flat';
   const name = options.name ?? (basename(cwd) || 'app');
   const scope = options.scope ?? null;
-  const license = options.license ?? 'MIT';
+  const license = options.license && 'MIT';
   const author = options.author ?? null;
   const fullName = scope ? `${scope}/${name}` : name;

[Survived] LogicalOperator
src/init.ts:391:18
   const name = options.name ?? (basename(cwd) || 'app');
   const scope = options.scope ?? null;
   const license = options.license ?? 'MIT';
-  const author = options.author ?? null;
+  const author = options.author && null;
   const fullName = scope ? `${scope}/${name}` : name;
   const adapters = options.adapters ?? ADAPTERS;

[Killed] LogicalOperator
src/init.ts:393:20
   const license = options.license ?? 'MIT';
   const author = options.author ?? null;
   const fullName = scope ? `${scope}/${name}` : name;
-  const adapters = options.adapters ?? ADAPTERS;
+  const adapters = options.adapters && ADAPTERS;
   const slots = options.slots ?? SLOTS;
   const checkrideSpec = options.checkrideSpec ?? `^${productVersion()}`;
killedBy: new-project generation (flat) writes a complete flat project
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] LogicalOperator
src/init.ts:394:17
   const author = options.author ?? null;
   const fullName = scope ? `${scope}/${name}` : name;
   const adapters = options.adapters ?? ADAPTERS;
-  const slots = options.slots ?? SLOTS;
+  const slots = options.slots && SLOTS;
   const checkrideSpec = options.checkrideSpec ?? `^${productVersion()}`;
 
killedBy: new-project generation (flat) writes a complete flat project
statusReason: slots is not iterable

[Survived] LogicalOperator
src/init.ts:395:25
   const fullName = scope ? `${scope}/${name}` : name;
   const adapters = options.adapters ?? ADAPTERS;
   const slots = options.slots ?? SLOTS;
-  const checkrideSpec = options.checkrideSpec ?? `^${productVersion()}`;
+  const checkrideSpec = options.checkrideSpec && `^${productVersion()}`;
 
   const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };

[Killed] LogicalOperator
src/init.ts:397:36
   const slots = options.slots ?? SLOTS;
   const checkrideSpec = options.checkrideSpec ?? `^${productVersion()}`;
 
-  const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };
+  const w: Writer = { cwd, dryRun: options.dryRun && false, written: [] };
 
   await writeSharedStatic(w);
killedBy: new-project generation (flat) --dry-run writes nothing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/init.ts:397:54
   const slots = options.slots ?? SLOTS;
   const checkrideSpec = options.checkrideSpec ?? `^${productVersion()}`;
 
-  const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };
+  const w: Writer = { cwd, dryRun: options.dryRun ?? true, written: [] };
 
   await writeSharedStatic(w);
killedBy: new-project generation (flat) writes a complete flat project
statusReason: package.json: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/init.ts:405:123
   await put(w, 'pnpm-workspace.yaml', render(readTemplate(join(shape, 'pnpm-workspace.yaml')), { name }));
 
   await put(w, 'cspell.json', cspellWithName(name, scope));
-  await put(w, 'package.json', rootPackageJson(fullName, license, author, collectDevDeps(adapters, slots, checkrideSpec), shape !== 'flat'));
+  await put(w, 'package.json', rootPackageJson(fullName, license, author, collectDevDeps(adapters, slots, checkrideSpec), true));
   await put(w, 'LICENSE', licenseText(license, author ?? fullName));
   await put(w, 'README.md', readme(name));

[Survived] EqualityOperator
src/init.ts:405:123
   await put(w, 'pnpm-workspace.yaml', render(readTemplate(join(shape, 'pnpm-workspace.yaml')), { name }));
 
   await put(w, 'cspell.json', cspellWithName(name, scope));
-  await put(w, 'package.json', rootPackageJson(fullName, license, author, collectDevDeps(adapters, slots, checkrideSpec), shape !== 'flat'));
+  await put(w, 'package.json', rootPackageJson(fullName, license, author, collectDevDeps(adapters, slots, checkrideSpec), shape === 'flat'));
   await put(w, 'LICENSE', licenseText(license, author ?? fullName));
   await put(w, 'README.md', readme(name));

[Survived] LogicalOperator
src/init.ts:406:48
 
   await put(w, 'cspell.json', cspellWithName(name, scope));
   await put(w, 'package.json', rootPackageJson(fullName, license, author, collectDevDeps(adapters, slots, checkrideSpec), shape !== 'flat'));
-  await put(w, 'LICENSE', licenseText(license, author ?? fullName));
+  await put(w, 'LICENSE', licenseText(license, author && fullName));
   await put(w, 'README.md', readme(name));
   await put(w, 'AGENTS.md', agentsMd(DEFAULT_ACTIVE_SLOTS));

[Killed] ConditionalExpression
src/init.ts:411:7
   await put(w, 'AGENTS.md', agentsMd(DEFAULT_ACTIVE_SLOTS));
   await put(w, 'CLAUDE.md', claudeMd());
 
-  if (shape === 'flat') {
+  if (true) {
     await put(w, join('src', 'index.ts'), sourceModule(name));
     await put(w, join('src', 'index.test.ts'), smokeTest(name));
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: apps/demo/src/index.ts: expected false to be true // Object.is equality

[Killed] BlockStatement
src/init.ts:411:25
   await put(w, 'AGENTS.md', agentsMd(DEFAULT_ACTIVE_SLOTS));
   await put(w, 'CLAUDE.md', claudeMd());
 
-  if (shape === 'flat') {
-    await put(w, join('src', 'index.ts'), sourceModule(name));
-    await put(w, join('src', 'index.test.ts'), smokeTest(name));
-  } else if (shape === 'monorepo') {
+  if (shape === 'flat') {} else if (shape === 'monorepo') {
     await writePackage(w, join('libs', 'core'), scope ? `${scope}/core` : 'core', 'core');
     await writePackage(w, join('apps', name), fullName, name);
killedBy: new-project generation (flat) writes a complete flat project
statusReason: src/index.ts: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/init.ts:414:14
   if (shape === 'flat') {
     await put(w, join('src', 'index.ts'), sourceModule(name));
     await put(w, join('src', 'index.test.ts'), smokeTest(name));
-  } else if (shape === 'monorepo') {
+  } else if (true) {
     await writePackage(w, join('libs', 'core'), scope ? `${scope}/core` : 'core', 'core');
     await writePackage(w, join('apps', name), fullName, name);
killedBy: new-project generation (flat) generates a hybrid project with a root app plus a package
statusReason: src/index.ts: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/init.ts:414:14
   if (shape === 'flat') {
     await put(w, join('src', 'index.ts'), sourceModule(name));
     await put(w, join('src', 'index.test.ts'), smokeTest(name));
-  } else if (shape === 'monorepo') {
+  } else if (shape !== 'monorepo') {
     await writePackage(w, join('libs', 'core'), scope ? `${scope}/core` : 'core', 'core');
     await writePackage(w, join('apps', name), fullName, name);
killedBy: new-project generation (flat) generates a monorepo with an app and a lib package
statusReason: apps/demo/src/index.ts: expected false to be true // Object.is equality

[Killed] BlockStatement
src/init.ts:417:10
   } else if (shape === 'monorepo') {
     await writePackage(w, join('libs', 'core'), scope ? `${scope}/core` : 'core', 'core');
     await writePackage(w, join('apps', name), fullName, name);
-  } else {
-    await put(w, join('src', 'index.ts'), sourceModule(name));
-    await put(w, join('src', 'index.test.ts'), smokeTest(name));
-    await writePackage(w, join('packages', 'core'), scope ? `${scope}/core` : 'core', 'core');
-  }
+  } else {}
 
   if (options.stdout) {
killedBy: new-project generation (flat) generates a hybrid project with a root app plus a package
statusReason: src/index.ts: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/init.ts:423:7
     await writePackage(w, join('packages', 'core'), scope ? `${scope}/core` : 'core', 'core');
   }
 
-  if (options.stdout) {
+  if (true) {
     options.stdout.write(`checkride init: generated a ${shape} project (${w.written.length} files)${w.dryRun ? ' [dry run]' : ''}.\n`);
   }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: Cannot read properties of undefined (reading 'write')

[Survived] ConditionalExpression
src/init.ts:423:7
     await writePackage(w, join('packages', 'core'), scope ? `${scope}/core` : 'core', 'core');
   }
 
-  if (options.stdout) {
+  if (false) {
     options.stdout.write(`checkride init: generated a ${shape} project (${w.written.length} files)${w.dryRun ? ' [dry run]' : ''}.\n`);
   }

[Killed] ObjectLiteral
src/init.ts:426:10
   if (options.stdout) {
     options.stdout.write(`checkride init: generated a ${shape} project (${w.written.length} files)${w.dryRun ? ' [dry run]' : ''}.\n`);
   }
-  return { mode: 'new', shape, written: w.written, skipped: [], disabled: [], exitCode: 0 };
+  return {};
 }
 
killedBy: new-project generation (flat) writes a complete flat project
statusReason: expected undefined to be 'new' // Object.is equality

[Survived] ArrayDeclaration
src/init.ts:426:75
   if (options.stdout) {
     options.stdout.write(`checkride init: generated a ${shape} project (${w.written.length} files)${w.dryRun ? ' [dry run]' : ''}.\n`);
   }
-  return { mode: 'new', shape, written: w.written, skipped: [], disabled: [], exitCode: 0 };
+  return { mode: 'new', shape, written: w.written, skipped: [], disabled: ["Stryker was here"], exitCode: 0 };
 }
 

[Killed] BlockStatement
src/init.ts:433:67
 // Existing-project mode
 // ----------------------------------------------------------------------------
 
-async function readIfExists(path: string): Promise<string | null> {
-  try {
-    return await readFile(path, 'utf8');
-  } catch {
-    return null;
-  }
-}
+async function readIfExists(path: string): Promise<string | null> {}
 
 async function initExisting(options: InitOptions, cwd: string): Promise<InitResult> {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/init.ts:434:7
 // ----------------------------------------------------------------------------
 
 async function readIfExists(path: string): Promise<string | null> {
-  try {
-    return await readFile(path, 'utf8');
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/init.ts:436:11
 async function readIfExists(path: string): Promise<string | null> {
   try {
     return await readFile(path, 'utf8');
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of undefined (reading 'replace')

[Survived] LogicalOperator
src/init.ts:442:20
 }
 
 async function initExisting(options: InitOptions, cwd: string): Promise<InitResult> {
-  const adapters = options.adapters ?? ADAPTERS;
+  const adapters = options.adapters && ADAPTERS;
   const slots = options.slots ?? SLOTS;
   const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };

[Killed] BooleanLiteral
src/init.ts:444:54
 async function initExisting(options: InitOptions, cwd: string): Promise<InitResult> {
   const adapters = options.adapters ?? ADAPTERS;
   const slots = options.slots ?? SLOTS;
-  const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };
+  const w: Writer = { cwd, dryRun: options.dryRun ?? true, written: [] };
   const skipped: string[] = [];
 
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-existing-LS76X6/checkride.config.json'

[Survived] LogicalOperator
src/init.ts:444:36
 async function initExisting(options: InitOptions, cwd: string): Promise<InitResult> {
   const adapters = options.adapters ?? ADAPTERS;
   const slots = options.slots ?? SLOTS;
-  const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };
+  const w: Writer = { cwd, dryRun: options.dryRun && false, written: [] };
   const skipped: string[] = [];
 

[Survived] ArrayDeclaration
src/init.ts:445:29
   const adapters = options.adapters ?? ADAPTERS;
   const slots = options.slots ?? SLOTS;
   const w: Writer = { cwd, dryRun: options.dryRun ?? false, written: [] };
-  const skipped: string[] = [];
+  const skipped: string[] = ["Stryker was here"];
 
   const items = inventory({ cwd, slots, adapters });

[Killed] EqualityOperator
src/init.ts:448:39
   const skipped: string[] = [];
 
   const items = inventory({ cwd, slots, adapters });
-  const adopted = items.filter((i) => i.status === 'adopted');
+  const adopted = items.filter((i) => i.status !== 'adopted');
 
   // Step 3: run each adopted check once; failing slots are recorded as `false`
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected undefined to be 'tsc' // Object.is equality

[Killed] ConditionalExpression
src/init.ts:448:39
   const skipped: string[] = [];
 
   const items = inventory({ cwd, slots, adapters });
-  const adopted = items.filter((i) => i.status === 'adopted');
+  const adopted = items.filter((i) => false);
 
   // Step 3: run each adopted check once; failing slots are recorded as `false`
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected undefined to be 'tsc' // Object.is equality

[Killed] LogicalOperator
src/init.ts:452:17
 
   // Step 3: run each adopted check once; failing slots are recorded as `false`
   // (disabled) so the first `pnpm check` is green-ish — re-enable as you fix.
-  const probe = options.probeFailures ?? defaultProbe;
+  const probe = options.probeFailures && defaultProbe;
   const failing = new Set(await probe(adopted.map((i) => i.slot), cwd));
   const disabled = adopted.filter((i) => failing.has(i.slot)).map((i) => i.slot);
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected false to be 'tsc' // Object.is equality

[Killed] ArrowFunction
src/init.ts:453:51
   // Step 3: run each adopted check once; failing slots are recorded as `false`
   // (disabled) so the first `pnpm check` is green-ish — re-enable as you fix.
   const probe = options.probeFailures ?? defaultProbe;
-  const failing = new Set(await probe(adopted.map((i) => i.slot), cwd));
+  const failing = new Set(await probe(adopted.map(() => undefined), cwd));
   const disabled = adopted.filter((i) => failing.has(i.slot)).map((i) => i.slot);
 
killedBy: existing-project adoption (idempotent) disables a slot whose check fails and reports it (step 3)
statusReason: expected [] to include 'lint'
