[Killed] ArrowFunction
src/init.ts:454:67
   // (disabled) so the first `pnpm check` is green-ish — re-enable as you fix.
   const probe = options.probeFailures ?? defaultProbe;
   const failing = new Set(await probe(adopted.map((i) => i.slot), cwd));
-  const disabled = adopted.filter((i) => failing.has(i.slot)).map((i) => i.slot);
+  const disabled = adopted.filter((i) => failing.has(i.slot)).map(() => undefined);
 
   // checkride.config.json reflecting adopted tools (and disabled failures). Never
killedBy: existing-project adoption (idempotent) disables a slot whose check fails and reports it (step 3)
statusReason: expected [ undefined ] to include 'lint'

[Killed] ArrowFunction
src/init.ts:454:35
   // (disabled) so the first `pnpm check` is green-ish — re-enable as you fix.
   const probe = options.probeFailures ?? defaultProbe;
   const failing = new Set(await probe(adopted.map((i) => i.slot), cwd));
-  const disabled = adopted.filter((i) => failing.has(i.slot)).map((i) => i.slot);
+  const disabled = adopted.filter(() => undefined).map((i) => i.slot);
 
   // checkride.config.json reflecting adopted tools (and disabled failures). Never
killedBy: existing-project adoption (idempotent) disables a slot whose check fails and reports it (step 3)
statusReason: expected [] to include 'lint'

[Killed] BlockStatement
src/init.ts:459:32
   // checkride.config.json reflecting adopted tools (and disabled failures). Never
   // overwrite an existing one.
   const configPath = join(cwd, 'checkride.config.json');
-  if (!existsSync(configPath)) {
-    const checks: Record<string, string | false> = {};
-    for (const i of adopted) {
-      if (failing.has(i.slot)) checks[i.slot] = false;
-      else if (i.adapter) checks[i.slot] = i.adapter;
-    }
-    await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);
-  } else {
+  if (!existsSync(configPath)) {} else {
     skipped.push('checkride.config.json (exists)');
   }
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-existing-6QqJvU/checkride.config.json'

[Killed] ConditionalExpression
src/init.ts:459:7
   // checkride.config.json reflecting adopted tools (and disabled failures). Never
   // overwrite an existing one.
   const configPath = join(cwd, 'checkride.config.json');
-  if (!existsSync(configPath)) {
+  if (true) {
     const checks: Record<string, string | false> = {};
     for (const i of adopted) {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected [ …(3) ] to include 'checkride.config.json (exists)'

[Killed] BlockStatement
src/init.ts:461:30
   const configPath = join(cwd, 'checkride.config.json');
   if (!existsSync(configPath)) {
     const checks: Record<string, string | false> = {};
-    for (const i of adopted) {
-      if (failing.has(i.slot)) checks[i.slot] = false;
-      else if (i.adapter) checks[i.slot] = i.adapter;
-    }
+    for (const i of adopted) {}
     await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);
   } else {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected undefined to be 'tsc' // Object.is equality

[Killed] BooleanLiteral
src/init.ts:462:49
   if (!existsSync(configPath)) {
     const checks: Record<string, string | false> = {};
     for (const i of adopted) {
-      if (failing.has(i.slot)) checks[i.slot] = false;
+      if (failing.has(i.slot)) checks[i.slot] = true;
       else if (i.adapter) checks[i.slot] = i.adapter;
     }
killedBy: existing-project adoption (idempotent) disables a slot whose check fails and reports it (step 3)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/init.ts:462:11
   if (!existsSync(configPath)) {
     const checks: Record<string, string | false> = {};
     for (const i of adopted) {
-      if (failing.has(i.slot)) checks[i.slot] = false;
+      if (false) checks[i.slot] = false;
       else if (i.adapter) checks[i.slot] = i.adapter;
     }
killedBy: existing-project adoption (idempotent) disables a slot whose check fails and reports it (step 3)
statusReason: expected 'oxlint' to be false // Object.is equality

[Killed] ConditionalExpression
src/init.ts:463:16
     const checks: Record<string, string | false> = {};
     for (const i of adopted) {
       if (failing.has(i.slot)) checks[i.slot] = false;
-      else if (i.adapter) checks[i.slot] = i.adapter;
+      else if (false) checks[i.slot] = i.adapter;
     }
     await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected undefined to be 'tsc' // Object.is equality

[Survived] ConditionalExpression
src/init.ts:463:16
     const checks: Record<string, string | false> = {};
     for (const i of adopted) {
       if (failing.has(i.slot)) checks[i.slot] = false;
-      else if (i.adapter) checks[i.slot] = i.adapter;
+      else if (true) checks[i.slot] = i.adapter;
     }
     await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);

[Killed] ObjectLiteral
src/init.ts:465:61
       if (failing.has(i.slot)) checks[i.slot] = false;
       else if (i.adapter) checks[i.slot] = i.adapter;
     }
-    await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);
+    await put(w, 'checkride.config.json', `${JSON.stringify({}, null, 2)}\n`);
   } else {
     skipped.push('checkride.config.json (exists)');
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of undefined (reading 'types')

[Killed] BlockStatement
src/init.ts:466:10
       else if (i.adapter) checks[i.slot] = i.adapter;
     }
     await put(w, 'checkride.config.json', `${JSON.stringify({ checks }, null, 2)}\n`);
-  } else {
-    skipped.push('checkride.config.json (exists)');
-  }
+  } else {}
 
   // .gitignore: ensure .check/ is ignored (append, never clobber).
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected [ …(3) ] to include 'checkride.config.json (exists)'

[Killed] EqualityOperator
src/init.ts:473:7
   // .gitignore: ensure .check/ is ignored (append, never clobber).
   const gitignorePath = join(cwd, '.gitignore');
   const gi = await readIfExists(gitignorePath);
-  if (gi === null) {
+  if (gi !== null) {
     await put(w, '.gitignore', '.check/\n');
   } else if (!/^\.check\/?\s*$/m.test(gi)) {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
src/init.ts:473:7
   // .gitignore: ensure .check/ is ignored (append, never clobber).
   const gitignorePath = join(cwd, '.gitignore');
   const gi = await readIfExists(gitignorePath);
-  if (gi === null) {
+  if (false) {
     await put(w, '.gitignore', '.check/\n');
   } else if (!/^\.check\/?\s*$/m.test(gi)) {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of null (reading 'replace')

[NoCoverage] BlockStatement
src/init.ts:475:44
   const gi = await readIfExists(gitignorePath);
   if (gi === null) {
     await put(w, '.gitignore', '.check/\n');
-  } else if (!/^\.check\/?\s*$/m.test(gi)) {
-    if (!w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
-    w.written.push('.gitignore (appended .check/)');
-  } else {
+  } else if (!/^\.check\/?\s*$/m.test(gi)) {} else {
     skipped.push('.gitignore (.check/ already ignored)');
   }

[Survived] ConditionalExpression
src/init.ts:475:14
   const gi = await readIfExists(gitignorePath);
   if (gi === null) {
     await put(w, '.gitignore', '.check/\n');
-  } else if (!/^\.check\/?\s*$/m.test(gi)) {
+  } else if (false) {
     if (!w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
     w.written.push('.gitignore (appended .check/)');

[NoCoverage] ConditionalExpression
src/init.ts:476:9
   if (gi === null) {
     await put(w, '.gitignore', '.check/\n');
   } else if (!/^\.check\/?\s*$/m.test(gi)) {
-    if (!w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
+    if (false) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
     w.written.push('.gitignore (appended .check/)');
   } else {

[NoCoverage] BooleanLiteral
src/init.ts:476:9
   if (gi === null) {
     await put(w, '.gitignore', '.check/\n');
   } else if (!/^\.check\/?\s*$/m.test(gi)) {
-    if (!w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
+    if (w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
     w.written.push('.gitignore (appended .check/)');
   } else {

[Survived] BlockStatement
src/init.ts:478:10
   } else if (!/^\.check\/?\s*$/m.test(gi)) {
     if (!w.dryRun) await writeFile(gitignorePath, `${gi.replace(/\s*$/, '')}\n.check/\n`);
     w.written.push('.gitignore (appended .check/)');
-  } else {
-    skipped.push('.gitignore (.check/ already ignored)');
-  }
+  } else {}
 
   // AGENTS.md stanza (create or refresh, idempotent).

[Survived] ArrowFunction
src/init.ts:485:42
   // AGENTS.md stanza (create or refresh, idempotent).
   const agentsPath = join(cwd, 'AGENTS.md');
   const existing = await readIfExists(agentsPath);
-  const stanza = buildStanza(adopted.map((i) => i.slot));
+  const stanza = buildStanza(adopted.map(() => undefined));
   const nextAgents = applyStanza(existing ?? '', stanza);
   if (nextAgents !== existing) {

[Killed] LogicalOperator
src/init.ts:486:34
   const agentsPath = join(cwd, 'AGENTS.md');
   const existing = await readIfExists(agentsPath);
   const stanza = buildStanza(adopted.map((i) => i.slot));
-  const nextAgents = applyStanza(existing ?? '', stanza);
+  const nextAgents = applyStanza(existing && '', stanza);
   if (nextAgents !== existing) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ConditionalExpression
src/init.ts:487:7
   const existing = await readIfExists(agentsPath);
   const stanza = buildStanza(adopted.map((i) => i.slot));
   const nextAgents = applyStanza(existing ?? '', stanza);
-  if (nextAgents !== existing) {
+  if (true) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
     w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected [ …(3) ] to include 'AGENTS.md (stanza unchanged)'

[Killed] ConditionalExpression
src/init.ts:487:7
   const existing = await readIfExists(agentsPath);
   const stanza = buildStanza(adopted.map((i) => i.slot));
   const nextAgents = applyStanza(existing ?? '', stanza);
-  if (nextAgents !== existing) {
+  if (false) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
     w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-existing-PE8wVS/AGENTS.md'

[Killed] BooleanLiteral
src/init.ts:488:9
   const stanza = buildStanza(adopted.map((i) => i.slot));
   const nextAgents = applyStanza(existing ?? '', stanza);
   if (nextAgents !== existing) {
-    if (!w.dryRun) await writeFile(agentsPath, nextAgents);
+    if (w.dryRun) await writeFile(agentsPath, nextAgents);
     w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
   } else {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-existing-yY1Pr4/AGENTS.md'

[Killed] ConditionalExpression
src/init.ts:488:9
   const stanza = buildStanza(adopted.map((i) => i.slot));
   const nextAgents = applyStanza(existing ?? '', stanza);
   if (nextAgents !== existing) {
-    if (!w.dryRun) await writeFile(agentsPath, nextAgents);
+    if (false) await writeFile(agentsPath, nextAgents);
     w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
   } else {
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-existing-W3VOFT/AGENTS.md'

[Survived] EqualityOperator
src/init.ts:489:20
   const nextAgents = applyStanza(existing ?? '', stanza);
   if (nextAgents !== existing) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
-    w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
+    w.written.push(existing !== null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
   } else {
     skipped.push('AGENTS.md (stanza unchanged)');

[Survived] ConditionalExpression
src/init.ts:489:20
   const nextAgents = applyStanza(existing ?? '', stanza);
   if (nextAgents !== existing) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
-    w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
+    w.written.push(false ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
   } else {
     skipped.push('AGENTS.md (stanza unchanged)');

[Killed] BlockStatement
src/init.ts:490:10
   if (nextAgents !== existing) {
     if (!w.dryRun) await writeFile(agentsPath, nextAgents);
     w.written.push(existing === null ? 'AGENTS.md' : 'AGENTS.md (refreshed stanza)');
-  } else {
-    skipped.push('AGENTS.md (stanza unchanged)');
-  }
+  } else {}
 
   // CLAUDE.md pointer if absent.
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected [ …(3) ] to include 'AGENTS.md (stanza unchanged)'

[Survived] BlockStatement
src/init.ts:496:32
 
   // CLAUDE.md pointer if absent.
   const claudePath = join(cwd, 'CLAUDE.md');
-  if (!existsSync(claudePath)) {
-    await put(w, 'CLAUDE.md', claudeMd());
-  } else {
+  if (!existsSync(claudePath)) {} else {
     skipped.push('CLAUDE.md (exists)');
   }

[Survived] ConditionalExpression
src/init.ts:496:7
 
   // CLAUDE.md pointer if absent.
   const claudePath = join(cwd, 'CLAUDE.md');
-  if (!existsSync(claudePath)) {
+  if (false) {
     await put(w, 'CLAUDE.md', claudeMd());
   } else {

[Survived] BlockStatement
src/init.ts:498:10
   const claudePath = join(cwd, 'CLAUDE.md');
   if (!existsSync(claudePath)) {
     await put(w, 'CLAUDE.md', claudeMd());
-  } else {
-    skipped.push('CLAUDE.md (exists)');
-  }
+  } else {}
 
   if (options.stdout) {

[NoCoverage] BlockStatement
src/init.ts:506:30
     options.stdout.write(
       `checkride init: adopted ${adopted.length} slot(s); wrote ${w.written.length} file(s)${w.dryRun ? ' [dry run]' : ''}.\n`,
     );
-    if (disabled.length > 0) {
-      options.stdout.write(`  disabled failing slots (enable as you fix): ${disabled.join(', ')}\n`);
-    }
+    if (disabled.length > 0) {}
   }
   return { mode: 'existing', shape: null, written: w.written, skipped, disabled, exitCode: 0 };

[NoCoverage] ConditionalExpression
src/init.ts:506:9
     options.stdout.write(
       `checkride init: adopted ${adopted.length} slot(s); wrote ${w.written.length} file(s)${w.dryRun ? ' [dry run]' : ''}.\n`,
     );
-    if (disabled.length > 0) {
+    if (true) {
       options.stdout.write(`  disabled failing slots (enable as you fix): ${disabled.join(', ')}\n`);
     }

[Killed] BlockStatement
src/init.ts:518:61
 // ----------------------------------------------------------------------------
 
 /** Detect new vs existing by the presence of a package.json. */
-export function detectMode(cwd: string): 'new' | 'existing' {
-  return existsSync(join(cwd, 'package.json')) ? 'existing' : 'new';
-}
+export function detectMode(cwd: string): 'new' | 'existing' {}
 
 /** Run `checkride init` against `cwd`. */
killedBy: detectMode new when there is no package.json
statusReason: expected undefined to be 'new' // Object.is equality

[Killed] BlockStatement
src/init.ts:523:74
 }
 
 /** Run `checkride init` against `cwd`. */
-export async function runInit(options: InitOptions): Promise<InitResult> {
-  const cwd = options.cwd ?? process.cwd();
-  return detectMode(cwd) === 'existing' ? initExisting(options, cwd) : initNew(options, cwd);
-}
+export async function runInit(options: InitOptions): Promise<InitResult> {}
 
killedBy: runCli init generates a new flat project
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/init.ts:524:15
 
 /** Run `checkride init` against `cwd`. */
 export async function runInit(options: InitOptions): Promise<InitResult> {
-  const cwd = options.cwd ?? process.cwd();
+  const cwd = options.cwd && process.cwd();
   return detectMode(cwd) === 'existing' ? initExisting(options, cwd) : initNew(options, cwd);
 }
killedBy: new-project generation (flat) writes a complete flat project
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/init.ts:525:10
 /** Run `checkride init` against `cwd`. */
 export async function runInit(options: InitOptions): Promise<InitResult> {
   const cwd = options.cwd ?? process.cwd();
-  return detectMode(cwd) === 'existing' ? initExisting(options, cwd) : initNew(options, cwd);
+  return false ? initExisting(options, cwd) : initNew(options, cwd);
 }
 
killedBy: existing-project adoption (idempotent) adopts detected tools and refreshes idempotently
statusReason: expected 'new' to be 'existing' // Object.is equality

[Killed] EqualityOperator
src/init.ts:525:10
 /** Run `checkride init` against `cwd`. */
 export async function runInit(options: InitOptions): Promise<InitResult> {
   const cwd = options.cwd ?? process.cwd();
-  return detectMode(cwd) === 'existing' ? initExisting(options, cwd) : initNew(options, cwd);
+  return detectMode(cwd) !== 'existing' ? initExisting(options, cwd) : initNew(options, cwd);
 }
 
killedBy: runCli init generates a new flat project
statusReason: expected false to be true // Object.is equality
