[Killed] Regex
src/links.ts:45:17
   '.pnpm-store',
 ]);
 
-const LINK_RE = /\[([^\]\n]*)\]\(([^)\n]+)\)/g;
+const LINK_RE = /\[([^\]\n]*)\]\(([)\n]+)\)/g;
 
 async function walkMarkdown(dir: string, acc: string[]): Promise<string[]> {
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:47:76
 
 const LINK_RE = /\[([^\]\n]*)\]\(([^)\n]+)\)/g;
 
-async function walkMarkdown(dir: string, acc: string[]): Promise<string[]> {
-  let entries;
-  try {
-    entries = await readdir(dir, { withFileTypes: true });
-  } catch {
-    return acc;
-  }
-  for (const entry of entries) {
-    const full = join(dir, entry.name);
-    if (entry.isDirectory()) {
-      if (EXCLUDE_DIRS.has(entry.name)) continue;
-      await walkMarkdown(full, acc);
-      continue;
-    }
-    if (entry.isFile() && entry.name.endsWith('.md')) {
-      acc.push(full);
-    }
-  }
-  return acc;
-}
+async function walkMarkdown(dir: string, acc: string[]): Promise<string[]> {}
 
 function isExternal(target: string): boolean {
killedBy: runCli run (built-in links path) exits 0 when the only check passes
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/links.ts:49:7
 
 async function walkMarkdown(dir: string, acc: string[]): Promise<string[]> {
   let entries;
-  try {
-    entries = await readdir(dir, { withFileTypes: true });
-  } catch {
+  try {} catch {
     return acc;
   }
killedBy: passes when relative targets resolve
statusReason: entries is not iterable

[Killed] BooleanLiteral
src/links.ts:50:51
 async function walkMarkdown(dir: string, acc: string[]): Promise<string[]> {
   let entries;
   try {
-    entries = await readdir(dir, { withFileTypes: true });
+    entries = await readdir(dir, { withFileTypes: false });
   } catch {
     return acc;
killedBy: runCli run (built-in links path) exits 0 when the only check passes
statusReason: expected 2 to be +0 // Object.is equality

[NoCoverage] BlockStatement
src/links.ts:51:11
   let entries;
   try {
     entries = await readdir(dir, { withFileTypes: true });
-  } catch {
-    return acc;
-  }
+  } catch {}
   for (const entry of entries) {
     const full = join(dir, entry.name);

[Killed] BlockStatement
src/links.ts:54:32
   } catch {
     return acc;
   }
-  for (const entry of entries) {
-    const full = join(dir, entry.name);
-    if (entry.isDirectory()) {
-      if (EXCLUDE_DIRS.has(entry.name)) continue;
-      await walkMarkdown(full, acc);
-      continue;
-    }
-    if (entry.isFile() && entry.name.endsWith('.md')) {
-      acc.push(full);
-    }
-  }
+  for (const entry of entries) {}
   return acc;
 }
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/links.ts:56:9
   }
   for (const entry of entries) {
     const full = join(dir, entry.name);
-    if (entry.isDirectory()) {
+    if (true) {
       if (EXCLUDE_DIRS.has(entry.name)) continue;
       await walkMarkdown(full, acc);
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/links.ts:56:30
   }
   for (const entry of entries) {
     const full = join(dir, entry.name);
-    if (entry.isDirectory()) {
-      if (EXCLUDE_DIRS.has(entry.name)) continue;
-      await walkMarkdown(full, acc);
-      continue;
-    }
+    if (entry.isDirectory()) {}
     if (entry.isFile() && entry.name.endsWith('.md')) {
       acc.push(full);

[Killed] ConditionalExpression
src/links.ts:57:11
   for (const entry of entries) {
     const full = join(dir, entry.name);
     if (entry.isDirectory()) {
-      if (EXCLUDE_DIRS.has(entry.name)) continue;
+      if (false) continue;
       await walkMarkdown(full, acc);
       continue;
killedBy: ignores markdown under excluded directories
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/links.ts:57:11
   for (const entry of entries) {
     const full = join(dir, entry.name);
     if (entry.isDirectory()) {
-      if (EXCLUDE_DIRS.has(entry.name)) continue;
+      if (true) continue;
       await walkMarkdown(full, acc);
       continue;

[Killed] ConditionalExpression
src/links.ts:61:9
       await walkMarkdown(full, acc);
       continue;
     }
-    if (entry.isFile() && entry.name.endsWith('.md')) {
+    if (false) {
       acc.push(full);
     }
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/links.ts:61:55
       await walkMarkdown(full, acc);
       continue;
     }
-    if (entry.isFile() && entry.name.endsWith('.md')) {
-      acc.push(full);
-    }
+    if (entry.isFile() && entry.name.endsWith('.md')) {}
   }
   return acc;
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:68:46
   return acc;
 }
 
-function isExternal(target: string): boolean {
-  return (
-    target.startsWith('http://') ||
-    target.startsWith('https://') ||
-    target.startsWith('mailto:')
-  );
-}
+function isExternal(target: string): boolean {}
 
 function stripFragment(target: string): string {
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/links.ts:70:5
 
 function isExternal(target: string): boolean {
   return (
-    target.startsWith('http://') ||
-    target.startsWith('https://') ||
+    target.startsWith('http://') && target.startsWith('https://') ||
     target.startsWith('mailto:')
   );
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/links.ts:70:5
 
 function isExternal(target: string): boolean {
   return (
-    target.startsWith('http://') ||
-    target.startsWith('https://') ||
-    target.startsWith('mailto:')
+    true
   );
 }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/links.ts:71:5
 function isExternal(target: string): boolean {
   return (
     target.startsWith('http://') ||
-    target.startsWith('https://') ||
+    target.endsWith('https://') ||
     target.startsWith('mailto:')
   );
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/links.ts:72:5
   return (
     target.startsWith('http://') ||
     target.startsWith('https://') ||
-    target.startsWith('mailto:')
+    target.endsWith('mailto:')
   );
 }
killedBy: skips external links, bare anchors, and strips fragments
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/links.ts:76:48
   );
 }
 
-function stripFragment(target: string): string {
-  const hash = target.indexOf('#');
-  return hash === -1 ? target : target.slice(0, hash);
-}
+function stripFragment(target: string): string {}
 
 function parseLinks(text: string): { line: number; target: string }[] {
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/links.ts:78:33
 
 function stripFragment(target: string): string {
   const hash = target.indexOf('#');
-  return hash === -1 ? target : target.slice(0, hash);
+  return hash === -1 ? target : target;
 }
 
killedBy: skips external links, bare anchors, and strips fragments
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/links.ts:78:10
 
 function stripFragment(target: string): string {
   const hash = target.indexOf('#');
-  return hash === -1 ? target : target.slice(0, hash);
+  return hash !== -1 ? target : target.slice(0, hash);
 }
 
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/links.ts:81:71
   return hash === -1 ? target : target.slice(0, hash);
 }
 
-function parseLinks(text: string): { line: number; target: string }[] {
-  const hits: { line: number; target: string }[] = [];
-  const lines = text.split('\n');
-  for (let i = 0; i < lines.length; i += 1) {
-    const line = lines[i] ?? '';
-    let m: RegExpExecArray | null;
-    LINK_RE.lastIndex = 0;
-    while ((m = LINK_RE.exec(line)) !== null) {
-      hits.push({ line: i + 1, target: m[2] ?? '' });
-    }
-  }
-  return hits;
-}
+function parseLinks(text: string): { line: number; target: string }[] {}
 
 async function checkFile(mdPath: string, repoRoot: string): Promise<LinkMiss[]> {
killedBy: passes when relative targets resolve
statusReason: parseLinks is not a function or its return value is not iterable

[Killed] ConditionalExpression
src/links.ts:84:19
 function parseLinks(text: string): { line: number; target: string }[] {
   const hits: { line: number; target: string }[] = [];
   const lines = text.split('\n');
-  for (let i = 0; i < lines.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const line = lines[i] ?? '';
     let m: RegExpExecArray | null;
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:84:45
 function parseLinks(text: string): { line: number; target: string }[] {
   const hits: { line: number; target: string }[] = [];
   const lines = text.split('\n');
-  for (let i = 0; i < lines.length; i += 1) {
-    const line = lines[i] ?? '';
-    let m: RegExpExecArray | null;
-    LINK_RE.lastIndex = 0;
-    while ((m = LINK_RE.exec(line)) !== null) {
-      hits.push({ line: i + 1, target: m[2] ?? '' });
-    }
-  }
+  for (let i = 0; i < lines.length; i += 1) {}
   return hits;
 }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/links.ts:85:18
   const hits: { line: number; target: string }[] = [];
   const lines = text.split('\n');
   for (let i = 0; i < lines.length; i += 1) {
-    const line = lines[i] ?? '';
+    const line = lines[i] && '';
     let m: RegExpExecArray | null;
     LINK_RE.lastIndex = 0;
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/links.ts:88:12
     const line = lines[i] ?? '';
     let m: RegExpExecArray | null;
     LINK_RE.lastIndex = 0;
-    while ((m = LINK_RE.exec(line)) !== null) {
+    while (false) {
       hits.push({ line: i + 1, target: m[2] ?? '' });
     }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:88:47
     const line = lines[i] ?? '';
     let m: RegExpExecArray | null;
     LINK_RE.lastIndex = 0;
-    while ((m = LINK_RE.exec(line)) !== null) {
-      hits.push({ line: i + 1, target: m[2] ?? '' });
-    }
+    while ((m = LINK_RE.exec(line)) !== null) {}
   }
   return hits;
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/links.ts:89:25
     let m: RegExpExecArray | null;
     LINK_RE.lastIndex = 0;
     while ((m = LINK_RE.exec(line)) !== null) {
-      hits.push({ line: i + 1, target: m[2] ?? '' });
+      hits.push({ line: i - 1, target: m[2] ?? '' });
     }
   }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected 1 to be 3 // Object.is equality

[Killed] LogicalOperator
src/links.ts:89:40
     let m: RegExpExecArray | null;
     LINK_RE.lastIndex = 0;
     while ((m = LINK_RE.exec(line)) !== null) {
-      hits.push({ line: i + 1, target: m[2] ?? '' });
+      hits.push({ line: i + 1, target: m[2] && '' });
     }
   }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:97:7
 
 async function checkFile(mdPath: string, repoRoot: string): Promise<LinkMiss[]> {
   let text: string;
-  try {
-    text = await readFile(mdPath, 'utf8');
-  } catch {
+  try {} catch {
     return [];
   }
killedBy: runCli run (built-in links path) exits 0 when the only check passes
statusReason: expected 2 to be +0 // Object.is equality

[NoCoverage] BlockStatement
src/links.ts:99:11
   let text: string;
   try {
     text = await readFile(mdPath, 'utf8');
-  } catch {
-    return [];
-  }
+  } catch {}
   const misses: LinkMiss[] = [];
   for (const { line, target } of parseLinks(text)) {

[Killed] BlockStatement
src/links.ts:103:52
     return [];
   }
   const misses: LinkMiss[] = [];
-  for (const { line, target } of parseLinks(text)) {
-    if (!target) continue;
-    if (isExternal(target)) continue;
-    if (target.startsWith('#')) continue;
-
-    const fileHalf = stripFragment(target).trim();
-    if (!fileHalf) continue;
-
-    const base = isAbsolute(fileHalf)
-      ? join(repoRoot, fileHalf)
-      : resolve(dirname(mdPath), fileHalf);
-
-    if (!existsSync(base)) {
-      misses.push({
-        file: relative(repoRoot, mdPath),
-        line,
-        link: target,
-        resolved: relative(repoRoot, base),
-      });
-    }
-  }
+  for (const { line, target } of parseLinks(text)) {}
   return misses;
 }
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/links.ts:104:9
   }
   const misses: LinkMiss[] = [];
   for (const { line, target } of parseLinks(text)) {
-    if (!target) continue;
+    if (target) continue;
     if (isExternal(target)) continue;
     if (target.startsWith('#')) continue;
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/links.ts:104:9
   }
   const misses: LinkMiss[] = [];
   for (const { line, target } of parseLinks(text)) {
-    if (!target) continue;
+    if (true) continue;
     if (isExternal(target)) continue;
     if (target.startsWith('#')) continue;
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/links.ts:105:9
   const misses: LinkMiss[] = [];
   for (const { line, target } of parseLinks(text)) {
     if (!target) continue;
-    if (isExternal(target)) continue;
+    if (true) continue;
     if (target.startsWith('#')) continue;
 
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/links.ts:105:9
   const misses: LinkMiss[] = [];
   for (const { line, target } of parseLinks(text)) {
     if (!target) continue;
-    if (isExternal(target)) continue;
+    if (false) continue;
     if (target.startsWith('#')) continue;
 
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/links.ts:106:9
   for (const { line, target } of parseLinks(text)) {
     if (!target) continue;
     if (isExternal(target)) continue;
-    if (target.startsWith('#')) continue;
+    if (true) continue;
 
     const fileHalf = stripFragment(target).trim();
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/links.ts:106:9
   for (const { line, target } of parseLinks(text)) {
     if (!target) continue;
     if (isExternal(target)) continue;
-    if (target.startsWith('#')) continue;
+    if (target.endsWith('#')) continue;
 
     const fileHalf = stripFragment(target).trim();

[Survived] MethodExpression
src/links.ts:108:22
     if (isExternal(target)) continue;
     if (target.startsWith('#')) continue;
 
-    const fileHalf = stripFragment(target).trim();
+    const fileHalf = stripFragment(target);
     if (!fileHalf) continue;
 

[Killed] ConditionalExpression
src/links.ts:109:9
     if (target.startsWith('#')) continue;
 
     const fileHalf = stripFragment(target).trim();
-    if (!fileHalf) continue;
+    if (true) continue;
 
     const base = isAbsolute(fileHalf)
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/links.ts:109:9
     if (target.startsWith('#')) continue;
 
     const fileHalf = stripFragment(target).trim();
-    if (!fileHalf) continue;
+    if (fileHalf) continue;
 
     const base = isAbsolute(fileHalf)
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/links.ts:115:9
       ? join(repoRoot, fileHalf)
       : resolve(dirname(mdPath), fileHalf);
 
-    if (!existsSync(base)) {
+    if (existsSync(base)) {
       misses.push({
         file: relative(repoRoot, mdPath),
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/links.ts:115:9
       ? join(repoRoot, fileHalf)
       : resolve(dirname(mdPath), fileHalf);
 
-    if (!existsSync(base)) {
+    if (false) {
       misses.push({
         file: relative(repoRoot, mdPath),
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/links.ts:128:70
 }
 
 /** Run the links check against `cwd`; never throws on a per-file read failure. */
-export async function checkLinks(cwd: string): Promise<CheckOutcome> {
-  const files = await walkMarkdown(cwd, []);
-  const misses: LinkMiss[] = [];
-  for (const f of files) {
-    misses.push(...(await checkFile(f, cwd)));
-  }
-
-  if (misses.length === 0) {
-    return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
-  }
-
-  const stderr = misses
-    .map((m) => `check-links: broken link in ${m.file}:${m.line} -> ${m.link} (resolved: ${m.resolved})`)
-    .join('\n');
-  return {
-    ok: false,
-    exit_code: 1,
-    stdout: `${JSON.stringify(misses, null, 2)}\n`,
-    stderr: `${stderr}\n`,
-  };
-}
+export async function checkLinks(cwd: string): Promise<CheckOutcome> {}
 
killedBy: passes when relative targets resolve
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ArrayDeclaration
src/links.ts:130:30
 /** Run the links check against `cwd`; never throws on a per-file read failure. */
 export async function checkLinks(cwd: string): Promise<CheckOutcome> {
   const files = await walkMarkdown(cwd, []);
-  const misses: LinkMiss[] = [];
+  const misses: LinkMiss[] = ["Stryker was here"];
   for (const f of files) {
     misses.push(...(await checkFile(f, cwd)));
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/links.ts:131:26
 export async function checkLinks(cwd: string): Promise<CheckOutcome> {
   const files = await walkMarkdown(cwd, []);
   const misses: LinkMiss[] = [];
-  for (const f of files) {
-    misses.push(...(await checkFile(f, cwd)));
-  }
+  for (const f of files) {}
 
   if (misses.length === 0) {
killedBy: fails and reports a broken relative target with its line number
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/links.ts:135:7
     misses.push(...(await checkFile(f, cwd)));
   }
 
-  if (misses.length === 0) {
+  if (misses.length !== 0) {
     return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
   }
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/links.ts:135:28
     misses.push(...(await checkFile(f, cwd)));
   }
 
-  if (misses.length === 0) {
-    return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
-  }
+  if (misses.length === 0) {}
 
   const stderr = misses
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/links.ts:136:70
   }
 
   if (misses.length === 0) {
-    return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
+    return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: false }, null, 2)}\n`, stderr: '' };
   }
 
killedBy: passes when relative targets resolve
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] BooleanLiteral
src/links.ts:136:18
   }
 
   if (misses.length === 0) {
-    return { ok: true, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
+    return { ok: false, exit_code: 0, stdout: `${JSON.stringify({ ok: true }, null, 2)}\n`, stderr: '' };
   }
 
killedBy: passes when relative targets resolve
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/links.ts:140:10
   }
 
   const stderr = misses
-    .map((m) => `check-links: broken link in ${m.file}:${m.line} -> ${m.link} (resolved: ${m.resolved})`)
+    .map(() => undefined)
     .join('\n');
   return {
killedBy: fails and reports a broken relative target with its line number
statusReason: expected '\n' to contain 'broken link in README.md:3'

[Killed] ObjectLiteral
src/links.ts:142:10
   const stderr = misses
     .map((m) => `check-links: broken link in ${m.file}:${m.line} -> ${m.link} (resolved: ${m.resolved})`)
     .join('\n');
-  return {
-    ok: false,
-    exit_code: 1,
-    stdout: `${JSON.stringify(misses, null, 2)}\n`,
-    stderr: `${stderr}\n`,
-  };
+  return {};
 }
 
killedBy: fails and reports a broken relative target with its line number
statusReason: expected undefined to be false // Object.is equality
