[Killed] BlockStatement
src/orchestrator.ts:77:100
 export type RunResult = { ok: boolean; summary: Summary; exitCode: number };
 
 /** Port of the interim `select_checks`: only/skip/opt-in selection by slot name. */
-export function selectChecks(resolved: readonly ResolvedCheck[], flags: RunFlags): ResolvedCheck[] {
-  const only = flags.only ?? null;
-  const skipSet = new Set(flags.skip ?? []);
-  const includeSet = new Set(flags.include ?? []);
-  const all = flags.all ?? false;
-  return resolved.filter((r) => {
-    if (only) return only.includes(r.slot);
-    if (skipSet.has(r.slot)) return false;
-    if (r.optIn && !all && !includeSet.has(r.slot)) return false;
-    return true;
-  });
-}
+export function selectChecks(resolved: readonly ResolvedCheck[], flags: RunFlags): ResolvedCheck[] {}
 
 /** Append an adapter's `changedArgs` under `--changed` (otherwise base args). */
killedBy: runDoctor (injected env) everything present -> ok, exit 0
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] LogicalOperator
src/orchestrator.ts:78:16
 
 /** Port of the interim `select_checks`: only/skip/opt-in selection by slot name. */
 export function selectChecks(resolved: readonly ResolvedCheck[], flags: RunFlags): ResolvedCheck[] {
-  const only = flags.only ?? null;
+  const only = flags.only && null;
   const skipSet = new Set(flags.skip ?? []);
   const includeSet = new Set(flags.include ?? []);
killedBy: selectChecks --only restricts to the named slots
statusReason: expected [ 'types', 'lint' ] to deeply equal [ 'lint' ]

[Killed] LogicalOperator
src/orchestrator.ts:79:27
 /** Port of the interim `select_checks`: only/skip/opt-in selection by slot name. */
 export function selectChecks(resolved: readonly ResolvedCheck[], flags: RunFlags): ResolvedCheck[] {
   const only = flags.only ?? null;
-  const skipSet = new Set(flags.skip ?? []);
+  const skipSet = new Set(flags.skip && []);
   const includeSet = new Set(flags.include ?? []);
   const all = flags.all ?? false;
killedBy: selectChecks --skip removes a slot entirely
statusReason: expected [ 'types', 'lint' ] to deeply equal [ 'types' ]

[Killed] LogicalOperator
src/orchestrator.ts:80:30
 export function selectChecks(resolved: readonly ResolvedCheck[], flags: RunFlags): ResolvedCheck[] {
   const only = flags.only ?? null;
   const skipSet = new Set(flags.skip ?? []);
-  const includeSet = new Set(flags.include ?? []);
+  const includeSet = new Set(flags.include && []);
   const all = flags.all ?? false;
   return resolved.filter((r) => {
killedBy: selectChecks --include adds a specific opt-in slot
statusReason: expected [ 'types', 'lint' ] to include 'mutation'

[Killed] LogicalOperator
src/orchestrator.ts:81:15
   const only = flags.only ?? null;
   const skipSet = new Set(flags.skip ?? []);
   const includeSet = new Set(flags.include ?? []);
-  const all = flags.all ?? false;
+  const all = flags.all && false;
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
killedBy: selectChecks --all includes opt-in slots
statusReason: expected [ 'types', 'lint' ] to include 'mutation'

[Killed] BooleanLiteral
src/orchestrator.ts:81:28
   const only = flags.only ?? null;
   const skipSet = new Set(flags.skip ?? []);
   const includeSet = new Set(flags.include ?? []);
-  const all = flags.all ?? false;
+  const all = flags.all ?? true;
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [ 'types', 'lint', 'mutation' ] to deeply equal [ 'types', 'lint' ]

[Killed] MethodExpression
src/orchestrator.ts:82:10
   const skipSet = new Set(flags.skip ?? []);
   const includeSet = new Set(flags.include ?? []);
   const all = flags.all ?? false;
-  return resolved.filter((r) => {
-    if (only) return only.includes(r.slot);
-    if (skipSet.has(r.slot)) return false;
-    if (r.optIn && !all && !includeSet.has(r.slot)) return false;
-    return true;
-  });
+  return resolved;
 }
 
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [ 'types', 'lint', 'mutation' ] to deeply equal [ 'types', 'lint' ]

[Killed] BlockStatement
src/orchestrator.ts:82:33
   const skipSet = new Set(flags.skip ?? []);
   const includeSet = new Set(flags.include ?? []);
   const all = flags.all ?? false;
-  return resolved.filter((r) => {
-    if (only) return only.includes(r.slot);
-    if (skipSet.has(r.slot)) return false;
-    if (r.optIn && !all && !includeSet.has(r.slot)) return false;
-    return true;
-  });
+  return resolved.filter((r) => {});
 }
 
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [] to deeply equal [ 'types', 'lint' ]

[Killed] ConditionalExpression
src/orchestrator.ts:83:9
   const includeSet = new Set(flags.include ?? []);
   const all = flags.all ?? false;
   return resolved.filter((r) => {
-    if (only) return only.includes(r.slot);
+    if (true) return only.includes(r.slot);
     if (skipSet.has(r.slot)) return false;
     if (r.optIn && !all && !includeSet.has(r.slot)) return false;
killedBy: selectChecks default run excludes opt-in slots
statusReason: Cannot read properties of null (reading 'includes')

[Killed] ConditionalExpression
src/orchestrator.ts:83:9
   const includeSet = new Set(flags.include ?? []);
   const all = flags.all ?? false;
   return resolved.filter((r) => {
-    if (only) return only.includes(r.slot);
+    if (false) return only.includes(r.slot);
     if (skipSet.has(r.slot)) return false;
     if (r.optIn && !all && !includeSet.has(r.slot)) return false;
killedBy: selectChecks --only restricts to the named slots
statusReason: expected [ 'types', 'lint' ] to deeply equal [ 'lint' ]

[Killed] ConditionalExpression
src/orchestrator.ts:84:9
   const all = flags.all ?? false;
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
-    if (skipSet.has(r.slot)) return false;
+    if (true) return false;
     if (r.optIn && !all && !includeSet.has(r.slot)) return false;
     return true;
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [] to deeply equal [ 'types', 'lint' ]

[Killed] BooleanLiteral
src/orchestrator.ts:84:37
   const all = flags.all ?? false;
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
-    if (skipSet.has(r.slot)) return false;
+    if (skipSet.has(r.slot)) return true;
     if (r.optIn && !all && !includeSet.has(r.slot)) return false;
     return true;
killedBy: selectChecks --skip removes a slot entirely
statusReason: expected [ 'types', 'lint' ] to deeply equal [ 'types' ]

[Killed] BooleanLiteral
src/orchestrator.ts:85:20
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
     if (skipSet.has(r.slot)) return false;
-    if (r.optIn && !all && !includeSet.has(r.slot)) return false;
+    if (r.optIn && all && !includeSet.has(r.slot)) return false;
     return true;
   });
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [ 'types', 'lint', 'mutation' ] to deeply equal [ 'types', 'lint' ]

[Killed] ConditionalExpression
src/orchestrator.ts:85:9
   return resolved.filter((r) => {
     if (only) return only.includes(r.slot);
     if (skipSet.has(r.slot)) return false;
-    if (r.optIn && !all && !includeSet.has(r.slot)) return false;
+    if (false) return false;
     return true;
   });
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [ 'types', 'lint', 'mutation' ] to deeply equal [ 'types', 'lint' ]

[Killed] BooleanLiteral
src/orchestrator.ts:86:12
     if (only) return only.includes(r.slot);
     if (skipSet.has(r.slot)) return false;
     if (r.optIn && !all && !includeSet.has(r.slot)) return false;
-    return true;
+    return false;
   });
 }
killedBy: selectChecks default run excludes opt-in slots
statusReason: expected [] to deeply equal [ 'types', 'lint' ]

[Killed] BlockStatement
src/orchestrator.ts:91:75
 }
 
 /** Append an adapter's `changedArgs` under `--changed` (otherwise base args). */
-export function runtimeArgs(adapter: Adapter, changed: boolean): string[] {
-  if (changed && adapter.changedArgs) return [...adapter.args, ...adapter.changedArgs];
-  return adapter.args;
-}
+export function runtimeArgs(adapter: Adapter, changed: boolean): string[] {}
 
 function spawnCheck(command: string, args: string[], cwd: string): Promise<CheckOutcome> {
killedBy: runtimeArgs appends changedArgs under --changed
statusReason: expected undefined to deeply equal [ 'run', '--changed', 'main' ]

[Killed] LogicalOperator
src/orchestrator.ts:92:7
 
 /** Append an adapter's `changedArgs` under `--changed` (otherwise base args). */
 export function runtimeArgs(adapter: Adapter, changed: boolean): string[] {
-  if (changed && adapter.changedArgs) return [...adapter.args, ...adapter.changedArgs];
+  if (changed || adapter.changedArgs) return [...adapter.args, ...adapter.changedArgs];
   return adapter.args;
 }
killedBy: runtimeArgs leaves args untouched without --changed
statusReason: expected [ 'run', '--changed', 'main' ] to deeply equal [ 'run' ]

[Killed] ConditionalExpression
src/orchestrator.ts:92:7
 
 /** Append an adapter's `changedArgs` under `--changed` (otherwise base args). */
 export function runtimeArgs(adapter: Adapter, changed: boolean): string[] {
-  if (changed && adapter.changedArgs) return [...adapter.args, ...adapter.changedArgs];
+  if (false) return [...adapter.args, ...adapter.changedArgs];
   return adapter.args;
 }
killedBy: runtimeArgs appends changedArgs under --changed
statusReason: expected [ 'run' ] to deeply equal [ 'run', '--changed', 'main' ]

[Killed] BlockStatement
src/orchestrator.ts:96:90
   return adapter.args;
 }
 
-function spawnCheck(command: string, args: string[], cwd: string): Promise<CheckOutcome> {
-  return new Promise((resolveOutcome) => {
-    const proc = spawn(command, args, {
-      cwd,
-      stdio: ['ignore', 'pipe', 'pipe'],
-      env: { ...process.env, FORCE_COLOR: '0', NO_COLOR: '1' },
-    });
-    let stdout = '';
-    let stderr = '';
-    proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
-    proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
-    proc.on('error', (err) => {
-      resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
-    });
-    proc.on('close', (code) => {
-      resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
-    });
-  });
-}
+function spawnCheck(command: string, args: string[], cwd: string): Promise<CheckOutcome> {}
 
 const defaultRunner: CheckRunner = (resolved, ctx) => {
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: Cannot read properties of undefined (reading 'stdout')

[Killed] BlockStatement
src/orchestrator.ts:97:42
 }
 
 function spawnCheck(command: string, args: string[], cwd: string): Promise<CheckOutcome> {
-  return new Promise((resolveOutcome) => {
-    const proc = spawn(command, args, {
-      cwd,
-      stdio: ['ignore', 'pipe', 'pipe'],
-      env: { ...process.env, FORCE_COLOR: '0', NO_COLOR: '1' },
-    });
-    let stdout = '';
-    let stderr = '';
-    proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
-    proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
-    proc.on('error', (err) => {
-      resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
-    });
-    proc.on('close', (code) => {
-      resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
-    });
-  });
+  return new Promise((resolveOutcome) => {});
 }
 
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/orchestrator.ts:105:39
     });
     let stdout = '';
     let stderr = '';
-    proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
+    proc.stdout.on('data', (chunk) => {});
     proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
     proc.on('error', (err) => {
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-CbSi02/.check/emit.json'

[Killed] AssignmentOperator
src/orchestrator.ts:105:41
     });
     let stdout = '';
     let stderr = '';
-    proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
+    proc.stdout.on('data', (chunk) => { stdout -= chunk.toString(); });
     proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
     proc.on('error', (err) => {
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: outcome.stdout.trim is not a function

[NoCoverage] AssignmentOperator
src/orchestrator.ts:106:41
     let stdout = '';
     let stderr = '';
     proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
-    proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
+    proc.stderr.on('data', (chunk) => { stderr -= chunk.toString(); });
     proc.on('error', (err) => {
       resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });

[NoCoverage] BlockStatement
src/orchestrator.ts:106:39
     let stdout = '';
     let stderr = '';
     proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
-    proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
+    proc.stderr.on('data', (chunk) => {});
     proc.on('error', (err) => {
       resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });

[Killed] BlockStatement
src/orchestrator.ts:107:31
     let stderr = '';
     proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
     proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
-    proc.on('error', (err) => {
-      resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
-    });
+    proc.on('error', (err) => {});
     proc.on('close', (code) => {
       resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
killedBy: runChecks (real subprocess) reports a spawn failure for a missing binary
statusReason: expected { name: 'ghost', …(6) } to match object { ok: false, exit_code: -1 }
(5 matching properties omitted from actual)

[Killed] BooleanLiteral
src/orchestrator.ts:108:28
     proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
     proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
     proc.on('error', (err) => {
-      resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
+      resolveOutcome({ ok: true, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
     });
     proc.on('close', (code) => {
killedBy: runChecks (real subprocess) reports a spawn failure for a missing binary
statusReason: expected { name: 'ghost', …(6) } to match object { ok: false, exit_code: -1 }
(5 matching properties omitted from actual)

[Killed] UnaryOperator
src/orchestrator.ts:108:46
     proc.stdout.on('data', (chunk) => { stdout += chunk.toString(); });
     proc.stderr.on('data', (chunk) => { stderr += chunk.toString(); });
     proc.on('error', (err) => {
-      resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
+      resolveOutcome({ ok: false, exit_code: +1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
     });
     proc.on('close', (code) => {
killedBy: runChecks (real subprocess) reports a spawn failure for a missing binary
statusReason: expected { name: 'ghost', …(6) } to match object { ok: false, exit_code: -1 }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/orchestrator.ts:110:32
     proc.on('error', (err) => {
       resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
     });
-    proc.on('close', (code) => {
-      resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
-    });
+    proc.on('close', (code) => {});
   });
 }
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/orchestrator.ts:111:51
       resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
     });
     proc.on('close', (code) => {
-      resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
+      resolveOutcome({ ok: code === 0, exit_code: code && -1, stdout, stderr });
     });
   });
killedBy: runChecks (real subprocess) captures a non-zero exit and writes non-JSON stdout as text
statusReason: expected { name: 'boom', adapter: 'boom', …(5) } to match object { ok: false, exit_code: 3 }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/orchestrator.ts:111:28
       resolveOutcome({ ok: false, exit_code: -1, stdout: '', stderr: `Failed to spawn: ${err.message}` });
     });
     proc.on('close', (code) => {
-      resolveOutcome({ ok: code === 0, exit_code: code ?? -1, stdout, stderr });
+      resolveOutcome({ ok: true, exit_code: code ?? -1, stdout, stderr });
     });
   });
killedBy: runChecks (real subprocess) captures a non-zero exit and writes non-JSON stdout as text
statusReason: expected { name: 'boom', adapter: 'boom', …(5) } to match object { ok: false, exit_code: 3 }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/orchestrator.ts:116:55
   });
 }
 
-const defaultRunner: CheckRunner = (resolved, ctx) => {
-  const adapter = resolved.adapter;
-  if (!adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
-  if (adapter.builtin === 'links') return checkLinks(ctx.cwd);
-  return spawnCheck(adapter.command, runtimeArgs(adapter, ctx.changed), ctx.cwd);
-};
+const defaultRunner: CheckRunner = (resolved, ctx) => {};
 
 /** Persist raw output: JSON to `.check/<outputFile>`, else stdout/stderr text. */
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: Cannot read properties of undefined (reading 'stdout')

[Killed] BooleanLiteral
src/orchestrator.ts:118:7
 
 const defaultRunner: CheckRunner = (resolved, ctx) => {
   const adapter = resolved.adapter;
-  if (!adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
+  if (adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
   if (adapter.builtin === 'links') return checkLinks(ctx.cwd);
   return spawnCheck(adapter.command, runtimeArgs(adapter, ctx.changed), ctx.cwd);
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-WLuVz4/.check/emit.json'

[Killed] ConditionalExpression
src/orchestrator.ts:118:7
 
 const defaultRunner: CheckRunner = (resolved, ctx) => {
   const adapter = resolved.adapter;
-  if (!adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
+  if (true) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
   if (adapter.builtin === 'links') return checkLinks(ctx.cwd);
   return spawnCheck(adapter.command, runtimeArgs(adapter, ctx.changed), ctx.cwd);
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-P1z8b2/.check/emit.json'

[Killed] ConditionalExpression
src/orchestrator.ts:119:7
 const defaultRunner: CheckRunner = (resolved, ctx) => {
   const adapter = resolved.adapter;
   if (!adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
-  if (adapter.builtin === 'links') return checkLinks(ctx.cwd);
+  if (false) return checkLinks(ctx.cwd);
   return spawnCheck(adapter.command, runtimeArgs(adapter, ctx.changed), ctx.cwd);
 };
killedBy: runCli run (built-in links path) exits 1 when a check fails
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/orchestrator.ts:119:7
 const defaultRunner: CheckRunner = (resolved, ctx) => {
   const adapter = resolved.adapter;
   if (!adapter) return Promise.resolve({ ok: true, exit_code: 0, stdout: '', stderr: '' });
-  if (adapter.builtin === 'links') return checkLinks(ctx.cwd);
+  if (true) return checkLinks(ctx.cwd);
   return spawnCheck(adapter.command, runtimeArgs(adapter, ctx.changed), ctx.cwd);
 };
killedBy: runChecks (real subprocess) captures a non-zero exit and writes non-JSON stdout as text
statusReason: expected { name: 'boom', adapter: 'boom', …(5) } to match object { ok: false, exit_code: 3 }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/orchestrator.ts:124:99
 };
 
 /** Persist raw output: JSON to `.check/<outputFile>`, else stdout/stderr text. */
-async function persistOutput(cwd: string, adapter: Adapter, outcome: CheckOutcome): Promise<void> {
-  const dir = join(cwd, '.check');
-  if (adapter.outputFile && outcome.stdout.trim()) {
-    try {
-      JSON.parse(outcome.stdout);
-      await writeFile(join(dir, adapter.outputFile), outcome.stdout);
-      return;
-    } catch {
-      // Not JSON after all; fall through to raw text.
-    }
-  }
-  if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
-  if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
-}
+async function persistOutput(cwd: string, adapter: Adapter, outcome: CheckOutcome): Promise<void> {}
 
 function writeLine(out: Out, line: string): void {
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-zVCixX/.check/emit.json'

[Killed] ConditionalExpression
src/orchestrator.ts:126:7
 /** Persist raw output: JSON to `.check/<outputFile>`, else stdout/stderr text. */
 async function persistOutput(cwd: string, adapter: Adapter, outcome: CheckOutcome): Promise<void> {
   const dir = join(cwd, '.check');
-  if (adapter.outputFile && outcome.stdout.trim()) {
+  if (false) {
     try {
       JSON.parse(outcome.stdout);
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-ykId1c/.check/emit.json'

[Killed] BlockStatement
src/orchestrator.ts:126:52
 /** Persist raw output: JSON to `.check/<outputFile>`, else stdout/stderr text. */
 async function persistOutput(cwd: string, adapter: Adapter, outcome: CheckOutcome): Promise<void> {
   const dir = join(cwd, '.check');
-  if (adapter.outputFile && outcome.stdout.trim()) {
-    try {
-      JSON.parse(outcome.stdout);
-      await writeFile(join(dir, adapter.outputFile), outcome.stdout);
-      return;
-    } catch {
-      // Not JSON after all; fall through to raw text.
-    }
-  }
+  if (adapter.outputFile && outcome.stdout.trim()) {}
   if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
   if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-325KCh/.check/emit.json'

[Killed] BlockStatement
src/orchestrator.ts:127:9
 async function persistOutput(cwd: string, adapter: Adapter, outcome: CheckOutcome): Promise<void> {
   const dir = join(cwd, '.check');
   if (adapter.outputFile && outcome.stdout.trim()) {
-    try {
-      JSON.parse(outcome.stdout);
-      await writeFile(join(dir, adapter.outputFile), outcome.stdout);
-      return;
-    } catch {
+    try {} catch {
       // Not JSON after all; fall through to raw text.
     }
killedBy: runChecks (real subprocess) spawns a command, captures JSON, and persists the output file
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-MBChYC/.check/emit.json'

[Killed] ConditionalExpression
src/orchestrator.ts:135:7
       // Not JSON after all; fall through to raw text.
     }
   }
-  if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
+  if (false) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
   if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
 }
killedBy: runChecks (real subprocess) captures a non-zero exit and writes non-JSON stdout as text
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-spawn-VgY3UT/.check/boom.stdout.txt'

[Survived] ConditionalExpression
src/orchestrator.ts:135:7
       // Not JSON after all; fall through to raw text.
     }
   }
-  if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
+  if (true) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
   if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
 }

[Survived] ConditionalExpression
src/orchestrator.ts:136:7
     }
   }
   if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
-  if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
+  if (true) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
 }
 

[Survived] MethodExpression
src/orchestrator.ts:136:7
     }
   }
   if (outcome.stdout.trim()) await writeFile(join(dir, `${adapter.slot}.stdout.txt`), outcome.stdout);
-  if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
+  if (outcome.stderr) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
 }
 

[Killed] BlockStatement
src/orchestrator.ts:139:50
   if (outcome.stderr.trim()) await writeFile(join(dir, `${adapter.slot}.stderr.txt`), outcome.stderr);
 }
 
-function writeLine(out: Out, line: string): void {
-  out.write(`${line}\n`);
-}
+function writeLine(out: Out, line: string): void {}
 
 function formatStatusLine(check: SummaryCheck): string {
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected '' to contain 'all checks passed'

[Survived] BlockStatement
src/orchestrator.ts:143:56
   out.write(`${line}\n`);
 }
 
-function formatStatusLine(check: SummaryCheck): string {
-  const mark = check.ok ? '✔' : '✘';
-  const name = check.name.padEnd(8);
-  const duration = `${check.duration_ms}ms`.padStart(8);
-  return `  ${mark} ${name} ${duration}  ${check.description}`;
-}
+function formatStatusLine(check: SummaryCheck): string {}
 
 function skippedEntry(resolved: ResolvedCheck): SummaryCheck {

[Killed] BlockStatement
src/orchestrator.ts:150:62
   return `  ${mark} ${name} ${duration}  ${check.description}`;
 }
 
-function skippedEntry(resolved: ResolvedCheck): SummaryCheck {
-  return {
-    name: resolved.slot,
-    adapter: resolved.adapter?.name ?? null,
-    description: resolved.adapter?.description ?? resolved.slot,
-    ok: true,
-    skipped: true,
-    reason: resolved.skip ?? 'skipped',
-    exit_code: null,
-    duration_ms: 0,
-    output_file: resolved.adapter?.outputFile ?? null,
-  };
-}
+function skippedEntry(resolved: ResolvedCheck): SummaryCheck {}
 
 function buildSummary(checks: SummaryCheck[]): Summary {
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] OptionalChaining
src/orchestrator.ts:153:14
 function skippedEntry(resolved: ResolvedCheck): SummaryCheck {
   return {
     name: resolved.slot,
-    adapter: resolved.adapter?.name ?? null,
+    adapter: resolved.adapter.name ?? null,
     description: resolved.adapter?.description ?? resolved.slot,
     ok: true,
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: Cannot read properties of null (reading 'name')

[Survived] LogicalOperator
src/orchestrator.ts:153:14
 function skippedEntry(resolved: ResolvedCheck): SummaryCheck {
   return {
     name: resolved.slot,
-    adapter: resolved.adapter?.name ?? null,
+    adapter: resolved.adapter?.name && null,
     description: resolved.adapter?.description ?? resolved.slot,
     ok: true,
