[Killed] OptionalChaining
src/orchestrator.ts:154:18
   return {
     name: resolved.slot,
     adapter: resolved.adapter?.name ?? null,
-    description: resolved.adapter?.description ?? resolved.slot,
+    description: resolved.adapter.description ?? resolved.slot,
     ok: true,
     skipped: true,
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: Cannot read properties of null (reading 'description')

[Survived] LogicalOperator
src/orchestrator.ts:154:18
   return {
     name: resolved.slot,
     adapter: resolved.adapter?.name ?? null,
-    description: resolved.adapter?.description ?? resolved.slot,
+    description: resolved.adapter?.description && resolved.slot,
     ok: true,
     skipped: true,

[Killed] BooleanLiteral
src/orchestrator.ts:155:9
     name: resolved.slot,
     adapter: resolved.adapter?.name ?? null,
     description: resolved.adapter?.description ?? resolved.slot,
-    ok: true,
+    ok: false,
     skipped: true,
     reason: resolved.skip ?? 'skipped',
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/orchestrator.ts:156:14
     adapter: resolved.adapter?.name ?? null,
     description: resolved.adapter?.description ?? resolved.slot,
     ok: true,
-    skipped: true,
+    skipped: false,
     reason: resolved.skip ?? 'skipped',
     exit_code: null,
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/orchestrator.ts:157:13
     description: resolved.adapter?.description ?? resolved.slot,
     ok: true,
     skipped: true,
-    reason: resolved.skip ?? 'skipped',
+    reason: resolved.skip && 'skipped',
     exit_code: null,
     duration_ms: 0,
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected 'skipped' to be 'disabled in checkride.config.json' // Object.is equality

[Killed] OptionalChaining
src/orchestrator.ts:160:18
     reason: resolved.skip ?? 'skipped',
     exit_code: null,
     duration_ms: 0,
-    output_file: resolved.adapter?.outputFile ?? null,
+    output_file: resolved.adapter.outputFile ?? null,
   };
 }
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: Cannot read properties of null (reading 'outputFile')

[Survived] LogicalOperator
src/orchestrator.ts:160:18
     reason: resolved.skip ?? 'skipped',
     exit_code: null,
     duration_ms: 0,
-    output_file: resolved.adapter?.outputFile ?? null,
+    output_file: resolved.adapter?.outputFile && null,
   };
 }

[Killed] BlockStatement
src/orchestrator.ts:164:56
   };
 }
 
-function buildSummary(checks: SummaryCheck[]): Summary {
-  return {
-    schema_version: SCHEMA_VERSION,
-    timestamp: new Date().toISOString(),
-    ok: checks.every((c) => c.ok),
-    total_duration_ms: checks.reduce((sum, c) => sum + c.duration_ms, 0),
-    checks,
-  };
-}
+function buildSummary(checks: SummaryCheck[]): Summary {}
 
 /** Run the selected checks against `cwd`, persist output, write the summary. */
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ArrowFunction
src/orchestrator.ts:168:22
   return {
     schema_version: SCHEMA_VERSION,
     timestamp: new Date().toISOString(),
-    ok: checks.every((c) => c.ok),
+    ok: checks.every(() => undefined),
     total_duration_ms: checks.reduce((sum, c) => sum + c.duration_ms, 0),
     checks,
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/orchestrator.ts:168:9
   return {
     schema_version: SCHEMA_VERSION,
     timestamp: new Date().toISOString(),
-    ok: checks.every((c) => c.ok),
+    ok: checks.some(c => c.ok),
     total_duration_ms: checks.reduce((sum, c) => sum + c.duration_ms, 0),
     checks,
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/orchestrator.ts:169:38
     schema_version: SCHEMA_VERSION,
     timestamp: new Date().toISOString(),
     ok: checks.every((c) => c.ok),
-    total_duration_ms: checks.reduce((sum, c) => sum + c.duration_ms, 0),
+    total_duration_ms: checks.reduce(() => undefined, 0),
     checks,
   };

[Survived] ArithmeticOperator
src/orchestrator.ts:169:50
     schema_version: SCHEMA_VERSION,
     timestamp: new Date().toISOString(),
     ok: checks.every((c) => c.ok),
-    total_duration_ms: checks.reduce((sum, c) => sum + c.duration_ms, 0),
+    total_duration_ms: checks.reduce((sum, c) => sum - c.duration_ms, 0),
     checks,
   };

[Killed] LogicalOperator
src/orchestrator.ts:176:15
 
 /** Run the selected checks against `cwd`, persist output, write the summary. */
 export async function runChecks(options: RunOptions): Promise<RunResult> {
-  const cwd = options.cwd ?? process.cwd();
+  const cwd = options.cwd && process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: ENOENT: no such file or directory, open '/var/folders/_w/1vg482bs06b67m74r9y6w_f00000gn/T/checkride-orc-wOlsTZ/.check/summary.json'

[Killed] ConditionalExpression
src/orchestrator.ts:179:18
   const cwd = options.cwd ?? process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
-  const config = options.config !== undefined ? options.config : loadConfig(cwd);
+  const config = false ? options.config : loadConfig(cwd);
   const stderr = options.stderr ?? process.stderr;
   const stdout = options.stdout ?? process.stdout;
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/orchestrator.ts:180:18
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
-  const stderr = options.stderr ?? process.stderr;
+  const stderr = options.stderr && process.stderr;
   const stdout = options.stdout ?? process.stdout;
   const runner = options.runner ?? defaultRunner;
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected '' to contain 'all checks passed'

[Survived] LogicalOperator
src/orchestrator.ts:181:18
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stderr = options.stderr ?? process.stderr;
-  const stdout = options.stdout ?? process.stdout;
+  const stdout = options.stdout && process.stdout;
   const runner = options.runner ?? defaultRunner;
   const json = options.json ?? false;

[Killed] LogicalOperator
src/orchestrator.ts:182:18
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stderr = options.stderr ?? process.stderr;
   const stdout = options.stdout ?? process.stdout;
-  const runner = options.runner ?? defaultRunner;
+  const runner = options.runner && defaultRunner;
   const json = options.json ?? false;
   const bail = options.bail ?? false;
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: expected true to be false // Object.is equality

[NoCoverage] BooleanLiteral
src/orchestrator.ts:183:32
   const stderr = options.stderr ?? process.stderr;
   const stdout = options.stdout ?? process.stdout;
   const runner = options.runner ?? defaultRunner;
-  const json = options.json ?? false;
+  const json = options.json ?? true;
   const bail = options.bail ?? false;
   const changed = options.changed ?? false;

[Survived] LogicalOperator
src/orchestrator.ts:183:16
   const stderr = options.stderr ?? process.stderr;
   const stdout = options.stdout ?? process.stdout;
   const runner = options.runner ?? defaultRunner;
-  const json = options.json ?? false;
+  const json = options.json && false;
   const bail = options.bail ?? false;
   const changed = options.changed ?? false;

[Killed] LogicalOperator
src/orchestrator.ts:184:16
   const stdout = options.stdout ?? process.stdout;
   const runner = options.runner ?? defaultRunner;
   const json = options.json ?? false;
-  const bail = options.bail ?? false;
+  const bail = options.bail && false;
   const changed = options.changed ?? false;
 
killedBy: runChecks (injected runner) --bail stops after the first failure
statusReason: expected [ { name: 'lint', …(6) }, …(1) ] to have a length of 1 but got 2

[Survived] BooleanLiteral
src/orchestrator.ts:184:32
   const stdout = options.stdout ?? process.stdout;
   const runner = options.runner ?? defaultRunner;
   const json = options.json ?? false;
-  const bail = options.bail ?? false;
+  const bail = options.bail ?? true;
   const changed = options.changed ?? false;
 

[Survived] LogicalOperator
src/orchestrator.ts:185:19
   const runner = options.runner ?? defaultRunner;
   const json = options.json ?? false;
   const bail = options.bail ?? false;
-  const changed = options.changed ?? false;
+  const changed = options.changed && false;
 
   await mkdir(join(cwd, '.check'), { recursive: true });

[Survived] BooleanLiteral
src/orchestrator.ts:185:38
   const runner = options.runner ?? defaultRunner;
   const json = options.json ?? false;
   const bail = options.bail ?? false;
-  const changed = options.changed ?? false;
+  const changed = options.changed ?? true;
 
   await mkdir(join(cwd, '.check'), { recursive: true });

[Survived] BooleanLiteral
src/orchestrator.ts:187:49
   const bail = options.bail ?? false;
   const changed = options.changed ?? false;
 
-  await mkdir(join(cwd, '.check'), { recursive: true });
+  await mkdir(join(cwd, '.check'), { recursive: false });
 
   const resolved = resolveChecks({ slots, adapters, config, cwd });

[Survived] ConditionalExpression
src/orchestrator.ts:192:7
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const selected = selectChecks(resolved, options);
 
-  if (!json) writeLine(stderr, `\nRunning ${selected.length} check(s)...\n`);
+  if (false) writeLine(stderr, `\nRunning ${selected.length} check(s)...\n`);
 
   const checks: SummaryCheck[] = [];

[Survived] BooleanLiteral
src/orchestrator.ts:192:7
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const selected = selectChecks(resolved, options);
 
-  if (!json) writeLine(stderr, `\nRunning ${selected.length} check(s)...\n`);
+  if (json) writeLine(stderr, `\nRunning ${selected.length} check(s)...\n`);
 
   const checks: SummaryCheck[] = [];

[Killed] BooleanLiteral
src/orchestrator.ts:196:19
 
   const checks: SummaryCheck[] = [];
   for (const r of selected) {
-    if (r.skip || !r.adapter) {
+    if (r.skip || r.adapter) {
       const entry = skippedEntry(r);
       checks.push(entry);
killedBy: runChecks (injected runner) reports per-check results and overall failure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/orchestrator.ts:196:9
 
   const checks: SummaryCheck[] = [];
   for (const r of selected) {
-    if (r.skip || !r.adapter) {
+    if (false) {
       const entry = skippedEntry(r);
       checks.push(entry);
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: Cannot read properties of null (reading 'description')

[Survived] BooleanLiteral
src/orchestrator.ts:199:11
     if (r.skip || !r.adapter) {
       const entry = skippedEntry(r);
       checks.push(entry);
-      if (!json) writeLine(stderr, `  ○ ${entry.name.padEnd(8)}      skip  ${entry.reason ?? ''}`);
+      if (json) writeLine(stderr, `  ○ ${entry.name.padEnd(8)}      skip  ${entry.reason ?? ''}`);
       continue;
     }

[Survived] ConditionalExpression
src/orchestrator.ts:199:11
     if (r.skip || !r.adapter) {
       const entry = skippedEntry(r);
       checks.push(entry);
-      if (!json) writeLine(stderr, `  ○ ${entry.name.padEnd(8)}      skip  ${entry.reason ?? ''}`);
+      if (true) writeLine(stderr, `  ○ ${entry.name.padEnd(8)}      skip  ${entry.reason ?? ''}`);
       continue;
     }

[Survived] BooleanLiteral
src/orchestrator.ts:203:9
       continue;
     }
     const adapter = r.adapter;
-    if (!json) writeLine(stderr, `  ▸ ${r.slot}  ${adapter.description}`);
+    if (json) writeLine(stderr, `  ▸ ${r.slot}  ${adapter.description}`);
     const start = performance.now();
     const outcome = await runner(r, { cwd, changed });

[Survived] ConditionalExpression
src/orchestrator.ts:203:9
       continue;
     }
     const adapter = r.adapter;
-    if (!json) writeLine(stderr, `  ▸ ${r.slot}  ${adapter.description}`);
+    if (false) writeLine(stderr, `  ▸ ${r.slot}  ${adapter.description}`);
     const start = performance.now();
     const outcome = await runner(r, { cwd, changed });

[Survived] ArithmeticOperator
src/orchestrator.ts:206:36
     if (!json) writeLine(stderr, `  ▸ ${r.slot}  ${adapter.description}`);
     const start = performance.now();
     const outcome = await runner(r, { cwd, changed });
-    const duration_ms = Math.round(performance.now() - start);
+    const duration_ms = Math.round(performance.now() + start);
     await persistOutput(cwd, adapter, outcome);
     const entry: SummaryCheck = {

[Survived] BooleanLiteral
src/orchestrator.ts:218:9
       output_file: adapter.outputFile,
     };
     checks.push(entry);
-    if (!json) writeLine(stderr, formatStatusLine(entry));
+    if (json) writeLine(stderr, formatStatusLine(entry));
     if (!outcome.ok && bail) break;
   }

[Survived] ConditionalExpression
src/orchestrator.ts:218:9
       output_file: adapter.outputFile,
     };
     checks.push(entry);
-    if (!json) writeLine(stderr, formatStatusLine(entry));
+    if (false) writeLine(stderr, formatStatusLine(entry));
     if (!outcome.ok && bail) break;
   }

[Killed] BooleanLiteral
src/orchestrator.ts:219:9
     };
     checks.push(entry);
     if (!json) writeLine(stderr, formatStatusLine(entry));
-    if (!outcome.ok && bail) break;
+    if (outcome.ok && bail) break;
   }
 
killedBy: runChecks (injected runner) --bail stops after the first failure
statusReason: expected [ { name: 'lint', …(6) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/orchestrator.ts:219:9
     };
     checks.push(entry);
     if (!json) writeLine(stderr, formatStatusLine(entry));
-    if (!outcome.ok && bail) break;
+    if (false) break;
   }
 
killedBy: runChecks (injected runner) --bail stops after the first failure
statusReason: expected [ { name: 'lint', …(6) }, …(1) ] to have a length of 1 but got 2

[Survived] BlockStatement
src/orchestrator.ts:225:13
   const summary = buildSummary(checks);
   await writeFile(join(cwd, '.check', 'summary.json'), `${JSON.stringify(summary, null, 2)}\n`);
 
-  if (json) {
-    stdout.write(`${JSON.stringify(summary, null, 2)}\n`);
-  } else {
+  if (json) {} else {
     writeLine(stderr, '');
     const status = summary.ok ? '✔ all checks passed' : '✘ one or more checks failed';

[Killed] BlockStatement
src/orchestrator.ts:227:10
 
   if (json) {
     stdout.write(`${JSON.stringify(summary, null, 2)}\n`);
-  } else {
-    writeLine(stderr, '');
-    const status = summary.ok ? '✔ all checks passed' : '✘ one or more checks failed';
-    writeLine(stderr, `${status} in ${summary.total_duration_ms}ms`);
-    writeLine(stderr, 'report: .check/summary.json');
-    writeLine(stderr, '');
-  }
+  } else {}
 
   return { ok: summary.ok, summary, exitCode: summary.ok ? 0 : 1 };
killedBy: runChecks (injected runner) records a disabled slot as skipped and prints human output
statusReason: expected '\nRunning 2 check(s)...\n\n  ○ types …' to contain 'all checks passed'

[Killed] BlockStatement
src/orchestrator.ts:255:90
 
 export type FixResult = { ok: boolean; exitCode: number; ran: string[] };
 
-function spawnInherit(command: string, args: string[], cwd: string): Promise<FixOutcome> {
-  return new Promise((resolveOutcome) => {
-    const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
-    proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
-    proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
-  });
-}
+function spawnInherit(command: string, args: string[], cwd: string): Promise<FixOutcome> {}
 
 const defaultFixRunner: FixRunner = (adapter, ctx) =>
killedBy: runFix the default fix runner spawns the adapter command
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
src/orchestrator.ts:256:42
 export type FixResult = { ok: boolean; exitCode: number; ran: string[] };
 
 function spawnInherit(command: string, args: string[], cwd: string): Promise<FixOutcome> {
-  return new Promise((resolveOutcome) => {
-    const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
-    proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
-    proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
-  });
+  return new Promise((resolveOutcome) => {});
 }
 
killedBy: runFix the default fix runner spawns the adapter command
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BlockStatement
src/orchestrator.ts:258:28
 function spawnInherit(command: string, args: string[], cwd: string): Promise<FixOutcome> {
   return new Promise((resolveOutcome) => {
     const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
-    proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
+    proc.on('error', () => {});
     proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
   });

[NoCoverage] BooleanLiteral
src/orchestrator.ts:258:51
 function spawnInherit(command: string, args: string[], cwd: string): Promise<FixOutcome> {
   return new Promise((resolveOutcome) => {
     const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
-    proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
+    proc.on('error', () => { resolveOutcome({ ok: true, exit_code: -1 }); });
     proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
   });

[Killed] BlockStatement
src/orchestrator.ts:259:32
   return new Promise((resolveOutcome) => {
     const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
     proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
-    proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
+    proc.on('close', (code) => {});
   });
 }
killedBy: runFix the default fix runner spawns the adapter command
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/orchestrator.ts:259:55
   return new Promise((resolveOutcome) => {
     const proc = spawn(command, args, { cwd, stdio: 'inherit', env: process.env });
     proc.on('error', () => { resolveOutcome({ ok: false, exit_code: -1 }); });
-    proc.on('close', (code) => { resolveOutcome({ ok: code === 0, exit_code: code ?? -1 }); });
+    proc.on('close', (code) => { resolveOutcome({ ok: code !== 0, exit_code: code ?? -1 }); });
   });
 }
killedBy: runFix the default fix runner spawns the adapter command
statusReason: expected { ok: false, exitCode: 1, …(1) } to match object { ok: true, exitCode: +0, …(1) }

[Killed] ArrowFunction
src/orchestrator.ts:263:37
   });
 }
 
-const defaultFixRunner: FixRunner = (adapter, ctx) =>
-  spawnInherit(adapter.command, adapter.fixArgs ?? [], ctx.cwd);
+const defaultFixRunner: FixRunner = () => undefined;
 
 /** Run every active adapter's `fixArgs` (`checkride fix`). */
killedBy: runFix the default fix runner spawns the adapter command
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] LogicalOperator
src/orchestrator.ts:264:33
 }
 
 const defaultFixRunner: FixRunner = (adapter, ctx) =>
-  spawnInherit(adapter.command, adapter.fixArgs ?? [], ctx.cwd);
+  spawnInherit(adapter.command, adapter.fixArgs && [], ctx.cwd);
 
 /** Run every active adapter's `fixArgs` (`checkride fix`). */
killedBy: runFix the default fix runner spawns the adapter command
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/orchestrator.ts:268:15
 
 /** Run every active adapter's `fixArgs` (`checkride fix`). */
 export async function runFix(options: FixOptions): Promise<FixResult> {
-  const cwd = options.cwd ?? process.cwd();
+  const cwd = options.cwd && process.cwd();
   const slots = options.slots ?? SLOTS;
   const adapters = options.adapters ?? ADAPTERS;
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [ { name: 'oxlint', …(1) } ] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] LogicalOperator
src/orchestrator.ts:273:21
   const adapters = options.adapters ?? ADAPTERS;
   const config = options.config !== undefined ? options.config : loadConfig(cwd);
   const stderr = options.stderr ?? process.stderr;
-  const fixRunner = options.fixRunner ?? defaultFixRunner;
+  const fixRunner = options.fixRunner && defaultFixRunner;
 
   const resolved = resolveChecks({ slots, adapters, config, cwd });
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] MethodExpression
src/orchestrator.ts:276:19
   const fixRunner = options.fixRunner ?? defaultFixRunner;
 
   const resolved = resolveChecks({ slots, adapters, config, cwd });
-  const fixable = selectChecks(resolved, options).filter((r) => r.adapter?.fixArgs);
+  const fixable = selectChecks(resolved, options);
 
   if (fixable.length === 0) {
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [ …(2) ] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] ArrowFunction
src/orchestrator.ts:276:58
   const fixRunner = options.fixRunner ?? defaultFixRunner;
 
   const resolved = resolveChecks({ slots, adapters, config, cwd });
-  const fixable = selectChecks(resolved, options).filter((r) => r.adapter?.fixArgs);
+  const fixable = selectChecks(resolved, options).filter(() => undefined);
 
   if (fixable.length === 0) {
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] EqualityOperator
src/orchestrator.ts:278:7
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const fixable = selectChecks(resolved, options).filter((r) => r.adapter?.fixArgs);
 
-  if (fixable.length === 0) {
+  if (fixable.length !== 0) {
     writeLine(stderr, 'checkride fix: no active adapters expose a fix command.');
     return { ok: true, exitCode: 0, ran: [] };
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] BlockStatement
src/orchestrator.ts:278:29
   const resolved = resolveChecks({ slots, adapters, config, cwd });
   const fixable = selectChecks(resolved, options).filter((r) => r.adapter?.fixArgs);
 
-  if (fixable.length === 0) {
-    writeLine(stderr, 'checkride fix: no active adapters expose a fix command.');
-    return { ok: true, exitCode: 0, ran: [] };
-  }
+  if (fixable.length === 0) {}
 
   const ran: string[] = [];
killedBy: runFix no-ops when nothing is fixable
statusReason: expected '' to contain 'no active adapters'

[Survived] BooleanLiteral
src/orchestrator.ts:280:18
 
   if (fixable.length === 0) {
     writeLine(stderr, 'checkride fix: no active adapters expose a fix command.');
-    return { ok: true, exitCode: 0, ran: [] };
+    return { ok: false, exitCode: 0, ran: [] };
   }
 

[Killed] ObjectLiteral
src/orchestrator.ts:280:12
 
   if (fixable.length === 0) {
     writeLine(stderr, 'checkride fix: no active adapters expose a fix command.');
-    return { ok: true, exitCode: 0, ran: [] };
+    return {};
   }
 
killedBy: runFix no-ops when nothing is fixable
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/orchestrator.ts:284:12
   }
 
   const ran: string[] = [];
-  let ok = true;
+  let ok = false;
   for (const r of fixable) {
     const adapter = r.adapter;
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected { ok: false, exitCode: 1, …(1) } to match object { ok: true, exitCode: +0, …(1) }

[Killed] BlockStatement
src/orchestrator.ts:285:28
 
   const ran: string[] = [];
   let ok = true;
-  for (const r of fixable) {
-    const adapter = r.adapter;
-    if (!adapter) continue;
-    writeLine(stderr, `  ▸ fix ${r.slot.padEnd(8)} (${adapter.name})`);
-    const outcome = await fixRunner(adapter, { cwd });
-    ran.push(adapter.name);
-    writeLine(stderr, outcome.ok ? `  ✔ ${r.slot}` : `  ✘ ${r.slot} (exit ${outcome.exit_code})`);
-    if (!outcome.ok) ok = false;
-  }
+  for (const r of fixable) {}
 
   return { ok, exitCode: ok ? 0 : 1, ran };
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] BooleanLiteral
src/orchestrator.ts:287:9
   let ok = true;
   for (const r of fixable) {
     const adapter = r.adapter;
-    if (!adapter) continue;
+    if (adapter) continue;
     writeLine(stderr, `  ▸ fix ${r.slot.padEnd(8)} (${adapter.name})`);
     const outcome = await fixRunner(adapter, { cwd });
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] ConditionalExpression
src/orchestrator.ts:287:9
   let ok = true;
   for (const r of fixable) {
     const adapter = r.adapter;
-    if (!adapter) continue;
+    if (true) continue;
     writeLine(stderr, `  ▸ fix ${r.slot.padEnd(8)} (${adapter.name})`);
     const outcome = await fixRunner(adapter, { cwd });
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] ObjectLiteral
src/orchestrator.ts:289:46
     const adapter = r.adapter;
     if (!adapter) continue;
     writeLine(stderr, `  ▸ fix ${r.slot.padEnd(8)} (${adapter.name})`);
-    const outcome = await fixRunner(adapter, { cwd });
+    const outcome = await fixRunner(adapter, {});
     ran.push(adapter.name);
     writeLine(stderr, outcome.ok ? `  ✔ ${r.slot}` : `  ✘ ${r.slot} (exit ${outcome.exit_code})`);
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected [ { name: 'oxlint', cwd: undefined } ] to deeply equal [ { name: 'oxlint', cwd: '/work' } ]

[Killed] BooleanLiteral
src/orchestrator.ts:292:27
     const outcome = await fixRunner(adapter, { cwd });
     ran.push(adapter.name);
     writeLine(stderr, outcome.ok ? `  ✔ ${r.slot}` : `  ✘ ${r.slot} (exit ${outcome.exit_code})`);
-    if (!outcome.ok) ok = false;
+    if (!outcome.ok) ok = true;
   }
 
killedBy: runFix reports a failing fix command with its exit code
statusReason: expected { ok: true, exitCode: +0, …(1) } to match object { ok: false, exitCode: 1 }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/orchestrator.ts:292:9
     const outcome = await fixRunner(adapter, { cwd });
     ran.push(adapter.name);
     writeLine(stderr, outcome.ok ? `  ✔ ${r.slot}` : `  ✘ ${r.slot} (exit ${outcome.exit_code})`);
-    if (!outcome.ok) ok = false;
+    if (outcome.ok) ok = false;
   }
 
killedBy: runFix runs fix only for active fixable adapters, passing the cwd
statusReason: expected { ok: false, exitCode: 1, …(1) } to match object { ok: true, exitCode: +0, …(1) }
